{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 49, "total_negative": 1, "total_reviews": 50}, "reviews": {"37617260": {"recommendationid": "37617260", "author": {"steamid": "76561198076517628", "num_games_owned": 473, "num_reviews": 46, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1512055093}, "language": "russian", "review": "Капец какая сложная игра. Пердак подгарает канкретно......", "timestamp_created": 1511669842, "timestamp_updated": 1511669842, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.539364", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36893461": {"recommendationid": "36893461", "author": {"steamid": "76561197970849026", "num_games_owned": 871, "num_reviews": 5, "playtime_forever": 2278, "playtime_last_two_weeks": 0, "last_played": 1511583947}, "language": "english", "review": "A good fun little game. You can play for ten minutes or 2 hours and always have fun in this simplictic Card game / RPG mix.", "timestamp_created": 1511402194, "timestamp_updated": 1511402194, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36867511": {"recommendationid": "36867511", "author": {"steamid": "76561198003518140", "num_games_owned": 1191, "num_reviews": 138, "playtime_forever": 58, "playtime_last_two_weeks": 0, "last_played": 1511395899}, "language": "english", "review": "Spent 60 minutes so far playing.  The game is really fun and simple to understand Roguelike game.  I highly recommend to my friends.  Cute graphics, no bugs found yet and straight-foward gameplay, and a great price make this a must have for any fans of Roguelikes.", "timestamp_created": 1511395998, "timestamp_updated": 1511395998, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36411199": {"recommendationid": "36411199", "author": {"steamid": "76561198073092169", "num_games_owned": 616, "num_reviews": 594, "playtime_forever": 504, "playtime_last_two_weeks": 0, "last_played": 1507914261}, "language": "english", "review": "Surprisingly good.  Played much more than I thought, and easy to play in short bursts.", "timestamp_created": 1510289061, "timestamp_updated": 1510289061, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36263157": {"recommendationid": "36263157", "author": {"steamid": "76561197996567652", "num_games_owned": 693, "num_reviews": 6, "playtime_forever": 608, "playtime_last_two_weeks": 0, "last_played": 1510156194}, "language": "english", "review": "We Slay Monsters is a roguelike where you fight monsters with poker hands you create from cards randomly dealt to you. Each of the three classes has different ways to manipulate the deck, and the card suits have various special attacks depending on the class, so they all play very, very differently, and each of them is suited to different types of monsters/dungeons. The game vaguely follows Desktop Dungeons pattern of having 25 'story' dungeons (i.e., themed dungeons with certain set attributes - everything inside them is still randomised) and a whole load of side dungeons for grinding out permanent unlocks. It's also super unbalanced, with some special abilities an order of magnitude better than others. \n\nDespite (or maybe because) of all that, We Slay Monsters is very good at creating the kind of chaotic memorable fights and daring escapes that roguelikes specialise in. And it's simply super fun to figure out how to use the various diverse tools at your disposal to beat an overpowering force. It looks childish, but it sort of goes well together with the game's anything goes approach. It's a great cartoonish antidote to the games obsessed with balance and tiny incremental upgrades to control the players. It used to be piss-easy, but the addition of hard mode in the recent patch has made it an easy recommendation.", "timestamp_created": 1509782837, "timestamp_updated": 1509782837, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35605756": {"recommendationid": "35605756", "author": {"steamid": "76561198079351783", "num_games_owned": 193, "num_reviews": 84, "playtime_forever": 143, "playtime_last_two_weeks": 0, "last_played": 1511638083}, "language": "german", "review": "Quietschbuntes Roguelike/lite...\n\nDas Karten-System macht das Spiel logischerweise ziemlich einzigartig. Und an die Tatsache, dass man jeden Dungeon mit einem neuen Helden startet muss man sich erst gewöhnen...\n\nDennoch ziemlich geniale Idee, nach 2,5 (?) Jahren EA auch demensprechend ausgereift, \"polished\" und einfach nur \"gut zu spielen\" ... \n\nSpätestens im Sale auf jeden Fall Top!\n\nWer mag darf gerne hier in Bild und Ton reinschauen:\n\nhttps://youtu.be/u416keWaxiQ\n\nGrüßle\n\n", "timestamp_created": 1507588618, "timestamp_updated": 1507588618, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35022461": {"recommendationid": "35022461", "author": {"steamid": "76561197970480620", "num_games_owned": 2669, "num_reviews": 37, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1505666001}, "language": "english", "review": "A lite yet extremely fun poker hand matching dungeon crawler.  Get Quests, Clear Dungeons, Get Gold, Upgrade Buildings, and Enjoy Life!  While exploring dungeons, you have many choices along the way, and it's all about how you would like to level the current character to complete that dungeon.  Dungeons get harder as quests appear, but upgrading buildings offsets that.  You choose a different person with every dungeon, so there is no party or any character to get attached to for very long.  Yet it just all works together.", "timestamp_created": 1505651713, "timestamp_updated": 1505651713, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34968971": {"recommendationid": "34968971", "author": {"steamid": "76561198003414986", "num_games_owned": 198, "num_reviews": 31, "playtime_forever": 1861, "playtime_last_two_weeks": 0, "last_played": 1504976431}, "language": "czech", "review": "Great game!", "timestamp_created": 1505472897, "timestamp_updated": 1505472897, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.461336", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34183436": {"recommendationid": "34183436", "author": {"steamid": "76561198010672528", "num_games_owned": 779, "num_reviews": 2, "playtime_forever": 2883, "playtime_last_two_weeks": 0, "last_played": 1505069898}, "language": "english", "review": "[h1]TL;DR - How Many Times/Ways Can I Say \"Casual\"[/h1]\n(Why don't more people put the TLDR at the [b]top[/b] of the review?  I mean if someone's not going to read the long version, they're probably not going to click the \"Read More\" and scroll down to the bottom.)\n\nAt this point in time, We Slay Monsters is definitely a rogue(-very)-lite game.  If that's not your thing, then stop right now and check back in a few months…\n\nNo, really, if you need a game that has even a hint brutal (or even \"challenging\" really) difficulty, then stop reading now and look for a different game.  (Check back later for \"challenging\" though.)\n\nStill, reading?  Okay.  We Slay Monsters is a good, fun casual game.  It has an appropriately light tone and an engaging story.  Each chapter has monsters themed to it.  The gameplay mechanics are solid.  Each of the three classes plays differently despite basically boiling down to having one or two ranged attacks and two or three melee attacks.\n\nEach dungeon run is a one-shot.  The hero starts at level 1 and maxes out at level 10.  Complete a dungeon and the hero graduates (and is gone).  For both good and bad, there's no character-build to consider and obsess over.  Only the academy improvements are persistent (and there's no branching there).\n\nThe relaxed, self-contained nature of the gameplay what makes it a good casual game.  You can spend all day doing dungeon after dungeon.  Or you can let it sit for months, fire it back up, and pick up where you left off without missing a beat.\n\n[h1]Way Too Long; Did Read[/h1]\nI'm sure there are/will be negative reviews saying that this plays like a mobile game (without the microtransactions).  I wouldn't disagree.  If it weren't for the screen size needed to properly play the game, I think this would be a killer mobile game.  I'd buy it in a heartbeat on Google Play.\n\nAs a PC game, it can be a nice change-of-pace/time-killer.  If you can't invest time in or otherwise don't want to fire up the \"serious\" game you're currently playing, this is a good alternative.  You can close it at any time and come back to it whenever.  It'll still be waiting where you left it and you can just start playing, no matter how long it's been.\n\nThe story doesn't take itself seriously.  You spend the first chapter fighting \"evil\" farm animals.  The self-serious tone over mostly silly things keeps the game light up until most of the way through the last chapter.  Before and after story of each dungeon is told in something of a wall-o-text style with a background image.  That might be off-putting to some, but the writing and humor make up for it--nothing profound our unique, but still solid.\n\nThere are two weaknesses in the story.  \nFirst, in relation to the gameplay, it really peaks in chapter 3.  The events in that chapter alter how you play the game in ways absent from any of the other chapters.  The story altering the gameplay for just that chapter leaves the other chapters noticeably lacking from the absence. \n\nSecond, the impression I get is that the final two chapters were rather forced in an effort to wrap up the game.  For example, there's a section in chapter 4 where you go through three dungeons in a row for essentially the same reason.  There's a similar section in chapter 5.\n\n(I feel the need to note on the last item that there was definitely still development work being done.  New and significant additions were being made to the game during that time.  So it wasn't a case of pure \"just get it out the door\"; more like the story took a backseat in creative priority.)\n\nYou've probably read (many times) already that class attacks are based off of poker combos: pairs, three-of-a-kind, straights, etc.  Where the game really shines is the design and implementation of the three classes.  Each class has their own deck of four suits.  Each of the 12 total suits has its own unique effects.  The combination of suits make each class have a different play style.  The class-specific abilities add even more distinctiveness, but with the (current) lack of difficulty you'll probably find yourself not really using the active ones very often.\n\nAnd again, I see where this is where a number of \"rogue-like\" fans will have issue:  The game has minimal challenge overall.  Before and shortly after it was on Steam, that was completely different.  The odds of finishing a dungeon were probably 50/50 at best.  But that was when it was just a one-shot dungeon crawl with no story (and one class).  Once work on the story started, I think the focus shifted to making it easier so people had a chance to get through the story without the frustration of failing 50-75% of the time.\n\nNow that the story is complete, there has been talk of putting more difficulty back into the game.  While I hope that's true, I also recognize that the game has been in development for years.  At some point the developer may want to move on to something else.  Another factor is that maybe the game won't sell well enough to justify continued support.  Because of that, I'm reviewing it as it is now.\n\nAnd right now, I'm satisfied.  Is it perfect?  No.  Is it fun?  For me, yes.  Would I like a little more work done on it?  Who wouldn't.  But even if what it is now is the final result, I'll still launch the game now and again to slay monsters.", "timestamp_created": 1502512908, "timestamp_updated": 1502512908, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.515362", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33941794": {"recommendationid": "33941794", "author": {"steamid": "76561198021656095", "num_games_owned": 810, "num_reviews": 106, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1497228327}, "language": "english", "review": "The card/poker based attack system is unique and a lot of fun, even if the game is a bit unpolished.", "timestamp_created": 1501561373, "timestamp_updated": 1501561373, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33247360": {"recommendationid": "33247360", "author": {"steamid": "76561198064445036", "num_games_owned": 1268, "num_reviews": 152, "playtime_forever": 348, "playtime_last_two_weeks": 0, "last_played": 1499197480}, "language": "german", "review": "Was ist We Slay Monsters? Ein kleines feines Spiel in welchem Ihr mit Kartencombos Gegner besiegen müsst und einen Dungeon von Mostern reinigen müsst. Dieses Spiel zeigt einem das es nicht auf die Grafik ankommt sondern auf das Gameplay bzw. die Idee dahinter. In diesem berechnet sich der Schaden mit den Karten auf eurer Hand, sprich habt Ihr ein Paar, eine Straße oder 3 der gleichen Farbe macht Ihr mehr schaden, als einfluss sieht man hier das normale Pokerspiel. Das klingt zwar beim lesen recht komisch, gibt dem Spiel aber einen gewissen Zufalls und auch einen Taktikaspekt welchem dem Spiel die nötge tiefe gibt. Ausserdem könnt Ihr mit dem verdienten Geld auch eure Stadt verbessern, welche euch dann bessere Ausrüstung, bessere Helden und bessere Karten bieten. Wo wir gerade bei Helden sind, vor jeder Runde gibt es zufällige Helden welche je einen Vorteil mit sich bringen, solltet Ihr sterben ist der Held Tot und Ihr müsst in dem Dungeon erneunt anfangen. Es gibt noch weit mehr über dieses Spiel zu sagen, aber das solltet ihr selber rausfinden (ich sag nur Rüstungaufbessern, Goldupdates, Levelups, die verschienen Gegner, Tagesherausfoderungen etc.). Daumen weit hoch für dieses einzigartige Spiel.", "timestamp_created": 1499200441, "timestamp_updated": 1499200441, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33152436": {"recommendationid": "33152436", "author": {"steamid": "76561198053788131", "num_games_owned": 5080, "num_reviews": 203, "playtime_forever": 495, "playtime_last_two_weeks": 0, "last_played": 1498911108}, "language": "english", "review": "[h1]OVERVIEW[/h1]\nWe Slay Monsters is a turn-based dungeon crawler with rogue-like elements from indie developers, Furiously Inactive Games.\n\nIn We Slay Monsters, you take the role of a headmaster given the task of restoring the once great Academy of Dungeoneering to its former glory. You see, after a long period of peace and prosperity, during which the Academy fell into disuse and disrepair, now there are stirrings of doom and destruction. Farm animals are going mad, it seems, attacking and capturing the citizens of the land, and with all of the old heroes retired or dead, a new stream of dungeoneer graduates is required.\n\nYour first mission involves taking one of four raw wizard graduates to rescue a wizard in order to restore the academy's wizard's tower to use and train more wizards. Your next mission requires you to rescue a drunkard warrior so that he may occupy the academy's barracks and train more warriors. And then you need to rescue a rogue so that she can reopen the tavern and train rogues.\n\nOnce the academy has been restored to full operation, you take on missions across the land to find the cause of the current disturbances and restore peace to the land, or something like that.\n\n[h1]Graphics[/h1]\nThe graphics in We Slay Monsters are very simple, but with considerable personality. The game is played from a top-down view, with a weird perspective that makes the walls of the dungeons appear very short. Each dungeon is a tile-based map and the tiles fit together well, but there's not a whole lot of variation in room shape or tile graphics. There are a few different themes -- dungeons, farms, etc. -- but once you've seen one or two stages in each theme, you've probably seen everything there is to see in terms of maps.\n\nThe character graphics are much more creative. They're displayed from a sort of two-dimensional side-on perspective and drawn on top of the map, which works quite well, though you'll occasionally find yourself clicking on your character rather than the map behind him or her. Your graduates look very green and wide-eyed, as they should. Some wear spectacles, and they all start out with the most basic equipment: in the case of a wizard, a crude magic orb and crude staff. As you collect or upgrade your equipment your character graphics change to reflect your new acquisition, both on the map screen and, sometimes rather comically, on the character screen as well. Though simple, the effect is fantastic and really suits the game. It's just a shame there's not more variation in equipment. \n\nEnemy graphics, too, are mostly well done. You'll see crazy, wild-eyed cows and goats; zombie chickens (soon-to-be headless zombie chickens); explosive sheep with evil eyes; and a number of other weird evil-infused animals. They're drawn well and each is worthwhile examining close up on the creature screen, together with their abilities and in-game effects. Playing cards are simply drawn, but easy to distinguish. Card effects are good, too.\n\nThere are no in-game options. The standard Unity launcher is used, allowing you to select a resolution, full-screen or windowed mode, and a detail level, ranging from good to fantastic. I didn't encounter any performance issues.\n\n[h1]Sound[/h1]\nI think I only heard one music track in the game, but I may be wrong. In any case, the music fits the game well, with a sort of minimal classical sound that's a bit quirky. It's unassuming and makes nice background music.\n\nThe sound effects are appropriate and fit their actions. Sometimes they sound a bit like the soundtrack to a slapstick comedy sketch, but that fits the game well, too.\n\nThere are no voices.\n\n[h1]Gameplay[/h1]\nWe Slay Monsters plays like a traditional turn-based, tile-based rogue-like dungeon crawler, but in place of normal attacks, you have a hand of five cards, with which you attempt to make poker-like hands to cause damage to your enemies. It's also rather silly, with your heroes being young, wide-eyed graduates and many of your enemies being crazed farm animals.\n\nThe cards you have available come a deck of 54 cards with numbers one through nine from six suits, which depend on your chosen class: wizard, warrior, or rogue. Some suits are used for range attacks and others are for melee. Each suit has a special effect that triggers when you use a single card of that suit, and a super special effect that triggers when you use at least three cards of that suit. Effects can be very different, from extra turns, to teleporting your target or shrinking them, to turning them into a rabid duck that attacks the closest target.\n\nThere are some tactics involved in card choice as sometimes you may be better off playing a three-card straight or two pairs, from multiple suits, and other times you may be better off playing a three-card flush from one suit in order to use the super special effect from that suit. More cards is not always better.\n\nCollecting loot dropped by monsters or lying about in the dungeon can give you gold, which when you've collected enough allows you to buy one of six random items from the shop, or may give you an item. If you don't want the item you can always choose to sell it immediately for more gold. Regardless of class, your character can hold four usable items and has five equipment slots: head, body, feet, main hand, and off hand. You start with worthless items in your main and off hand, but through finding and buying new items or upgrades, can end up with some pretty potent combinations. There aren't many item types or different bonuses available, though, so you'll quickly see everything that's available.\n\nKilling enough monsters gains you a level, which awards extra health and a choice of two new perks from a randomly selected list. These include basic stat modifiers as well as special abilities that trigger on certain cards being drawn. As each graduate can only reach level 10, a number of the abilities that are related to experience points are worth less than you might expect. And as each graduate can only be used once -- they either die, leaving behind a grave for you to plunder next time you attempt the mission, or they succeed and graduate, never to be seen again. This reduces long-term progression, which is a shame.\n\nGold that you're awarded for completed missions can be spent on upgrading the academies buildings, granting certain active or passive abilities to the character types. Later on you can unlock a couple of other buildings, but each one only has a limited number of benefits available, so again, once you unlock them, you'll quickly see the upgrade potential (though it will take you some time to reach it).\n\nAs well as the story missions there are also 'random' (side quest) missions to keep you busy, as well as a leaderboard-scored challenge dungeon that changes regularly.\n\nIt's not all smooth playing, though. The game does have a number of bugs:\n- in-game badges and Steam Achievements not being awarded\n- some starting bonuses not working\n- hands becoming stuck, with new cards are drawn over the top\n- items bought in the shop not always being equipped\n- characters starting with equipment from previous characters\n\n[h1]PROS AND CONS[/h1]\nPros:\n+ Simple, addictive, and fun\n+ Charming graphics\n+ Steam Achievements and Trading Cards\n\nCons:\n- Only 10 levels per character\n- Limited long-term progression\n- Repetitive missions\n\n[h1]CONCLUSION[/h1]\nWe Slay Monsters is a fun and addictive card-based rogue-like dungeon crawler. The simple graphics and wacky humour are appealing, though are sometimes a little too much. The card-based gameplay works well, but does become repetitive quickly, and the game doesn't have enough longer-term progression or variation. It's also a bit buggy.\n\nA\n[h1]Save[/h1]\nL\nP\nQ\nR\n\nNote: I received this game for free for review purposes. This did not influence my review.\n\n[code]For more game reviews, visit [url=http://saveorquit.com/]Save or Quit[/url].[/code]\n", "timestamp_created": 1499028753, "timestamp_updated": 1499028753, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.515475", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "33058501": {"recommendationid": "33058501", "author": {"steamid": "76561198045401832", "num_games_owned": 88, "num_reviews": 104, "playtime_forever": 2848, "playtime_last_two_weeks": 0, "last_played": 1505673160}, "language": "english", "review": "Not a puzzler like Desktop Dungeon, although it feels like it, this game is an RPG that looks like it is from 1985. It is very addictive and the poker hands to cast spells is very unique and an awesome game mechanic. Huge replayablility and quests.", "timestamp_created": 1498861825, "timestamp_updated": 1498861825, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.502288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29227328": {"recommendationid": "29227328", "author": {"steamid": "76561198090680523", "num_games_owned": 769, "num_reviews": 7, "playtime_forever": 7158, "playtime_last_two_weeks": 0, "last_played": 1512507407}, "language": "english", "review": "One of the hidden Gems on Steam. \nDungeon crawler with very easy to grasp mechanics based on poker. \nAwesome game - try it! Warning - it is highly addictive. \n\nThe developer is very open to the community.", "timestamp_created": 1484325874, "timestamp_updated": 1484325874, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.547325", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "29149922": {"recommendationid": "29149922", "author": {"steamid": "76561198064268501", "num_games_owned": 903, "num_reviews": 91, "playtime_forever": 725, "playtime_last_two_weeks": 0, "last_played": 1499040320}, "language": "english", "review": "[b]We Slay Monsters[/b] is a roguelike (turn-based, permadeath) with a poker-esque card based combat mechanic. Don't let this put you off if you don't know how to play Poker. The game has a very nice tutorial and a \"cheat sheet' with some combinations you can use. Also, it's possible to use just one card to attack, so the player will always have an attack option.\n\nRight now there's three classes and four chapters to progress. Despite the game being permadeath for your characters, there's permanent progression, in which you can unlock better gear and abilities for your future characters. \n\nAt a first sight I thought the game didn't had procedural generation, but this is how it actually works: the levels are procedurally generated, but if you die, the next run in a mission will be on the exact same dungeon. According to the devs, this is a design choice, made it this way to loot the tombstone of your previous hero. This is actually nice because if you're having a hard time in a mission, you can learn some tricks in how to beat that specific dungeon layout. \n\nAlso, We Slay Monsters is a bit on the easy side (but this will change later). I think it's refreshing to see a roguelike game which is not a hell on earth like the most of the games of this genre. Don't get me wrong, I [b]love[/b] challenging games, but there's practically zero causal roguelikes, and sometimes I'm in the mood for a roguelike, but also in the mood to chill and relax. This game is a good choice for these moments.\n\nAll in all, I'm very happy with my purchase and strongly recommend this game, even if you haven't played a roguelike yet. The game is worth it even without a discount.\n\n[b]TL;DR[/b] - A great roguelike to chill and relax", "timestamp_created": 1483997453, "timestamp_updated": 1483997976, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.709457", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28900107": {"recommendationid": "28900107", "author": {"steamid": "76561198031330048", "num_games_owned": 128, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1483271975}, "language": "english", "review": "Cute game with solid mechanics and a well balnced combat system. This is more of a rogue-lite as it a bit on the easy side. I liked the additional \"re-building your town\"-stuff but ran quickly out of stuff I could spend my money on. Maybe in a future build there will be more options.", "timestamp_created": 1483272274, "timestamp_updated": 1483272274, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525386", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "25637120": {"recommendationid": "25637120", "author": {"steamid": "76561197967419832", "num_games_owned": 1133, "num_reviews": 181, "playtime_forever": 461, "playtime_last_two_weeks": 0, "last_played": 1497468671}, "language": "english", "review": "A great roguelike with a home base you can upgrade for more class abilities and improvement upon them. For combat, it's done with poker like mechanics. You have 5 cards at all times and draw from a deck, and you attack my making 'Combos', which is basically poker like hands. For example, Three of a kind, Flushes, Straits, etc. The longer your combo, and the higher value your cards, the more damage. Also, each card is Strength or Intelligence based, so when you level or get equipment, you can increase those values. \n\nThere are 6 Suits(like Diamond, Heart, Club, Spade for regular cards) for each class, are different for each class, and actually influence the battle. For example, for the Warrior, I'll name 3 his suits: Headbutt, Stab, and Shout. Headbutt will knock the enemy back, or if they're in a position where they can't be knocked back, they'll be stunned instead. Stab will make the enemy bleed(tke damage each turn, like poison). Shout will lower the the enemies defense for 3 turns. If you get a 6 of Stab, 7 of Headbutt, and 8 of Shout, and then attack of enemy with that, ALL those status effects will affect them, which can really help you out in combat. And each class has different suits, so tactics between the 3 Classes(that I know of) are really different, so there's plenty of variety.\n\nAt your home base, which is an Adventurer's Academy, you can purchase and upgrade abilities for your classes. For example, you can purchase the Teleport ability for your Wizard, which is an ability you can activate at any time(there's a cooldown between uses though). It lets you teleport up to 4 tiles away.\n\nAnyway, for any RPG or Roguelike fan, I absolutely recommend this game to you. Especially if you like the ones that let you build and upgrade a home base like in Desktop Dungeons or something.\n\n[b]Edit:[/b] I have no idea why, but when I review games, I have to cut the review in half, submit the first half, the edit it and paste in the second half, which is what I had to do here and for my other reviews. If you know why it does this and/or how to fix it, please add me to your friends list and tell me.", "timestamp_created": 1474560100, "timestamp_updated": 1474560252, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.520315", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "24095213": {"recommendationid": "24095213", "author": {"steamid": "76561198088113949", "num_games_owned": 23, "num_reviews": 9, "playtime_forever": 571, "playtime_last_two_weeks": 0, "last_played": 1469676783}, "language": "english", "review": "I actually legit like the game! Though, granted that it needs a bit of tweaking, it's still a great game to play! The poker and turn-based game actually is fun and simple too.\n\nYet, there are some noticable bugs here and there I have noticed for my good ol Mac OSX. So for those who haven't bought this game and are considering it, be aware of these issues.\n\n1: The Window size\nMy screen is a 1900x1200, where I selected it in the start-up menu. Though, it makes the game smaller and can only be at the bottom-left corner.\n\n2: That annoying sound when you're at low-health\nHaving that issue lowers my ratings even if it's a bug or not. I think the red edges flashing is enough to let us know that we're on low health. But, I put this onto here is because I noticed that it won't play the usual sound when I'm low on health, but when I hit the menu button, it'll go on until I complete the mission. Would be thankful if the devs fixed this.\n\nI'd give this game an exciting DND session/10 if the bugs can be tweaked.", "timestamp_created": 1467672354, "timestamp_updated": 1467672354, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471919", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "23422656": {"recommendationid": "23422656", "author": {"steamid": "76561198141481130", "num_games_owned": 273, "num_reviews": 4, "playtime_forever": 6972, "playtime_last_two_weeks": 0, "last_played": 1507694753}, "language": "english", "review": "I've been looking for a game like the Guild of Dungeoneering and stumbled into We Slay Monsters. As much as I loved the first game, I enjoy this one even more. The game is simple to learn. I really appreciate the way the game is structured to be able to pick how much time you have to invest in your next round. It is the kind of game that can be played while watching TV.", "timestamp_created": 1465237967, "timestamp_updated": 1465237967, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.508556", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "21754875": {"recommendationid": "21754875", "author": {"steamid": "76561198047472536", "num_games_owned": 353, "num_reviews": 5, "playtime_forever": 268, "playtime_last_two_weeks": 0, "last_played": 1502072585}, "language": "english", "review": "Really fun game, I first played it at SGC 2015, and instanlty loved it, it is a grat game to jsut kill some time with.", "timestamp_created": 1457646057, "timestamp_updated": 1457646057, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.474490", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "20783283": {"recommendationid": "20783283", "author": {"steamid": "76561198110110963", "num_games_owned": 185, "num_reviews": 4, "playtime_forever": 5625, "playtime_last_two_weeks": 0, "last_played": 1511385053}, "language": "russian", "review": "Отличная игра! Толика юмора, минималистичный презабавный арт, и, главное -  карты!\nНикогда не любила покер, но использовать его правила для рпг-боевки - это кон-гениально!\nПодобная механика представляет невероятное количество возможностей для интересных реализаций. С уклоном и в стратегию и тайм-менеджмент, и (!) даже в ММО или кооператив! Главное, чтобы это не скатилось до банального онлайн-казино))))\nУспешного развития вам, Furiously Inactive Games!", "timestamp_created": 1453892028, "timestamp_updated": 1453892028, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.636002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "19138952": {"recommendationid": "19138952", "author": {"steamid": "76561198049934592", "num_games_owned": 2498, "num_reviews": 34, "playtime_forever": 451, "playtime_last_two_weeks": 0, "last_played": 1483420906}, "language": "english", "review": "This is a very nice game, and it's only $5.\nThe card system is refreshing and upgrading the town keeps you motivated for more. For me it's not a game I play for hours, I prefer to play 1 or 2 dungeons at a time. I hope that doesn't sound negative because it doesn't make it bad at all. It's perrrfect for during lunch/break! Recommended :)", "timestamp_created": 1447815058, "timestamp_updated": 1447815058, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.520814", "comment_count": "2", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "18561476": {"recommendationid": "18561476", "author": {"steamid": "76561198004098028", "num_games_owned": 3026, "num_reviews": 25, "playtime_forever": 442, "playtime_last_two_weeks": 0, "last_played": 1448873237}, "language": "english", "review": "This is great!\n\nA nice roguelike, turn based game with a fair amount of challenge, a really nice UI and lots of quests and achievements.  The use of the card mechanic with attacks puts another level of strategy into the proceedings.  Art style is fun and it puts a lighthearted spin on all of your future deaths.  It's broken up into small parts and could be one of those mythical \"coffee break roguelikes\" (but who really gets a coffee break anymore....).\n\nThe pacing is excellent. It really moves along, it doesn't feel cheap and there's a lot here.  It may be Early Access, but it's very solid and due to the roguelike nature of it (random generation, the use of cards in attacks etc) there will be plenty of reasons to go back with lots of replayability.  And, it's five bucks.  C'mon!", "timestamp_created": 1445220910, "timestamp_updated": 1445220910, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477244", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "18293973": {"recommendationid": "18293973", "author": {"steamid": "76561198002570286", "num_games_owned": 364, "num_reviews": 1, "playtime_forever": 818, "playtime_last_two_weeks": 0, "last_played": 1494801680}, "language": "english", "review": "I love the game. I'm a busy father and love how I can play this for 20 minutes, beat a mission, and then quit. It's a great roguelike dungeon crawler. I love the battle system that uses poker rules. The graphics are wonderful as well. Can't wait to watch this game mature, but it is totally playable at this point. \n\nI had an issue starting the game when I originally purchased it, but the dev was quick to respond to my email and fix the problem. \n\nDo yourself a favor and pick it up.", "timestamp_created": 1443807307, "timestamp_updated": 1443807307, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.601079", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "18002573": {"recommendationid": "18002573", "author": {"steamid": "76561198003479630", "num_games_owned": 2229, "num_reviews": 78, "playtime_forever": 567, "playtime_last_two_weeks": 0, "last_played": 1486195962}, "language": "english", "review": "Buggy, but with a certain amount of charm. The price point is nice as well currently", "timestamp_created": 1442082189, "timestamp_updated": 1442082189, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.501998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "17994745": {"recommendationid": "17994745", "author": {"steamid": "76561198016791879", "num_games_owned": 719, "num_reviews": 21, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1464876854}, "language": "french", "review": "Un très bon rogue-like avec un style sympa qui ne se prend pas au sérieux. Un peu comme dans Dungeonman on doit développer sa guilde de chair à canon (enfin d'aventuriers quoi)... pour se faire on envoie nos petits troufions héroïques crever dans des donjons aux noms plus étranges les uns que les autres pour récuperer des artefacts aux noms à rallonge ou sauver de sombres crétins. Globalement la difficulté n'est pas très elevé mais ça arrive quand même très régulièrement de crever avant l'heure, auquel cas un autre kamikaze prendra la place du précédent. Par contre quand notre aventurier parvient à finir la quête en vie on gagne du pognon qu'on doit alors investir dans l'académie afin de par exemple débloquer de nouvelles capacités pour les guerriers (ou encore les mages ou les voleurs), booster l'équipement de base de nos chers troufions, etc, etc...\n\nL'un dans l'autre on passe un bon moment qui alterne savament réussite et échec sans que cela ne soit trop frustrant et on à pas l'impression de jouer pour rien puisqu'on voit nos aventuriers commencer avec un matos de plus en plus avancé au fur et à mesure que l'académie se développe, tout comme on voit cette dernière se transformer au fur et à mesure qu'on construit de nouveaux bâtiments.\n\nEn bref, je recommande chaudement ce rogue-like qui bien qu'étant en Early Access a déjà un beau potentiel.", "timestamp_created": 1442046407, "timestamp_updated": 1442046407, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502712", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "16330075": {"recommendationid": "16330075", "author": {"steamid": "76561198063688280", "num_games_owned": 583, "num_reviews": 2, "playtime_forever": 292, "playtime_last_two_weeks": 0, "last_played": 1480547555}, "language": "english", "review": "I enjoyed this and will definitely play some more in future when I have time and it gets out of early access.\n", "timestamp_created": 1434119162, "timestamp_updated": 1434119162, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.432406", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "15306949": {"recommendationid": "15306949", "author": {"steamid": "76561197970520021", "num_games_owned": 308, "num_reviews": 17, "playtime_forever": 275, "playtime_last_two_weeks": 0, "last_played": 1482372846}, "language": "english", "review": "A nice fun game, a different but enjoyable take on the rogue genre.  Recommended", "timestamp_created": 1428762515, "timestamp_updated": 1428762515, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.448315", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "15223268": {"recommendationid": "15223268", "author": {"steamid": "76561197985402177", "num_games_owned": 1038, "num_reviews": 12, "playtime_forever": 313, "playtime_last_two_weeks": 0, "last_played": 1470747507}, "language": "english", "review": "Fun little roguelike with permanent upgrades. A tad slowpaced, but also incredibly cheap. Well worth the money!", "timestamp_created": 1428258016, "timestamp_updated": 1428258016, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477244", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "15108555": {"recommendationid": "15108555", "author": {"steamid": "76561197995436761", "num_games_owned": 1089, "num_reviews": 33, "playtime_forever": 200, "playtime_last_two_weeks": 0, "last_played": 1450009019}, "language": "english", "review": "First off, let me get this out of the way: this game is pure unadulterated FUN and isn't that what games are ultimately about?!\n\nI've read some reviews here complaining about the graphics. I'm not sure what people expect but let's step back and look at what the game ISN'T. It's not a grimdark, goth, gibfest. It IS a playful little love note to roguelikes and the graphics and music are not at all amateurish. Come on, you have flying sharks, burping cows, your avatars were soda pop thick glasses and helmets are buckets. In other words, the art style is silly on purpose and has a sort of Gary Larson on acid vibe. \n\nThe game's Poker mechanic is well implemented and the best part for you non-Poker players is that there is a cheat sheet. Moreover, hands like flushes and straights can be 3, 4, or 5 cards so iunlike real poker, you don't have to draw a 5 card flush or straight. \n\nThe game is turn based and judicious use of the skip turn ability is advised especially in the case of the warrior as frequently - except for the rubber ducky ranged attack - you will be drawing cards to form melee attacks. If you run into a horde of beasties that are MUCH higher level than you, get away and come back when you have the chance. Studying the dungeon layout is important in making certain you always have an esacpe route.\n\nLoot is always fun as it should be but scrolls are a 50/50 proposition. Check your stats before reading one in case your health is low and you encounter a cursed scroll. Along the way you'll find treasure chests and vases that might contain gold to be spent at the shop, or some sort of buff for your character.\n\nXP is gained through slaying this twisted farmyard menagerie and as you level up, you get to pick two perks to buff your character. Also, you will find gear. Look at the stats because sometimes, a crude shield is better than a good shield depending on your strategy.\n\nLastly, the game has a sort of stronghold or school. You can upgrade barracks for better warrior attacks and your magic tower for better spells. \n\nAll in all there is a wonderful synergy going on with the game components. Some will complain that the game looks like a browser game and shouldn't be on Steam. Grow up and get past that! It's FUN. The developers clearly love the game an everything in the game has a purpose and is implemented on purpose. \n\nThis is a game that can be played in short bursts when you don't have time for long sessions of Pillars of Eternity or other epics. But that said, it can deviously draw you in for longer periods. I've been playing this since it came to Desura and only last evening did I add it to Steam. So the 77 minutes is actually not an accurate reprentation of my total time in this little beauty.\n\nI can't help but smile at the whimsy and little pokes of fun this game makes at roguelikes and RPGs in general. It's done well and with a firm sense of tongue in cheek.\n\nGet it as the price is a steal. Oh yeah, the elves really deserve all the death you can deal. :)", "timestamp_created": 1427633461, "timestamp_updated": 1427633461, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.515074", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "15055259": {"recommendationid": "15055259", "author": {"steamid": "76561198080162516", "num_games_owned": 48, "num_reviews": 4, "playtime_forever": 142, "playtime_last_two_weeks": 0, "last_played": 1447379843}, "language": "english", "review": "A Surprisingly entertaining game. I bought it before it was given the green light on Steam. \nGreat fun, easy to learn and play. \nThe graphics / art style is simple and yet seems to fit the game perfectly. Card based actions make for a fun gam, and you are awarded for use of luck and skill.\nThis game is worth the price of admission.\n", "timestamp_created": 1427338401, "timestamp_updated": 1427338401, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.501661", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "14572008": {"recommendationid": "14572008", "author": {"steamid": "76561198031789432", "num_games_owned": 836, "num_reviews": 153, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1423923768}, "language": "english", "review": "Disclaimer: preview copy received from the developer.\n\nWe Slay Monsters is basically a traditional roguelike. Its main difference from the norm is in the addition of poker-like card combos for skill use. It's a nice bit of spice. As roguelikes go, this game isn't very difficult.\n\nMy full preview is at [url=http://indiegames.com/2015/02/early_access_pick_we_slay_mons.html] IndieGames.com [/url]", "timestamp_created": 1424504278, "timestamp_updated": 1424504278, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.469275", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "14502533": {"recommendationid": "14502533", "author": {"steamid": "76561197990833248", "num_games_owned": 3606, "num_reviews": 148, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1459640463}, "language": "english", "review": "The card-based combat is a lot of fun, and helps to set the game apart from the slew of other small dungeon crawlers available on Steam. It will be much better once there's a campaign, instead of just random dungeons, but even in its incomplete state, there's enough entertainment here for $5.", "timestamp_created": 1424110409, "timestamp_updated": 1424110409, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.576377", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "14204162": {"recommendationid": "14204162", "author": {"steamid": "76561198008217535", "num_games_owned": 66, "num_reviews": 3, "playtime_forever": 596, "playtime_last_two_weeks": 0, "last_played": 1498145985}, "language": "english", "review": "I picked this game up after speaking with the Developers at last year's SGC.  I had been playing with the Wizard which is a fun class but it started to get old for me.  Ever since they added the warrior class and still have two more classes to add Cleric and Ranger archer type one it'll add more variety to what sort of character you want to use and how to fight the mobs.  As for what I have been playing It's been a remarkably fun game.  The card spell selection combat adds a new strategy element to the RPG dungeon crawler formula and ever since they added the fog of War to the game it's been a lot of fun.  Also the ability to upgrade your character's gear starting out at the academy is a nice feature but also comes with decision making.  Have your characters start with better gear or improve the class skills?  This will result in some fun gameplay and I really enjoy it.  It's current price isn't bad for such a fun little game that was created by a team of great people.  If you got this far in my review give this game a try it's good fun and it's feeling pretty well on it's way to being a complete game.", "timestamp_created": 1422426087, "timestamp_updated": 1422426087, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544495", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "14138435": {"recommendationid": "14138435", "author": {"steamid": "76561197993624207", "num_games_owned": 1424, "num_reviews": 39, "playtime_forever": 6671, "playtime_last_two_weeks": 0, "last_played": 1499255063}, "language": "english", "review": "EDIT: 22/06/2017: Version 1 of the game has been released! Excellent game with a full campaign and a lot of good content. The dev is still extremely active and is still working on a lot of improvements.\n\nI highly recommend this game.\n\n\n\nOriginal review:\n\nThis is a very cool game and I highly recommend it. The dev responds to feedback very quickly and seems genuinely eager to get more. My feedback on the discussion board has been responded to quickly and a lot of my suggestions have been taken on board. It's great to have a keen dev who responds very quickly to feedback and really seems interested!\n\nThe game itself is neat and it's constantly improving. The classes feel different enough and the skills are quite interesting. The poker-like mechanics make the game nifty and it lets you choose different play styles. Do you safe your good cards for the boss? Or do you kill the minions as quickly as possible and hope to get more good cards later?\n\nSome of the mechanics aren't perfect yet, but I have high hopes for this game. The game as it is now is rather run. Most people would play this game for maybe an hour at a time, but I've had several stints where I've played it for several hours at a time while also watching TV. It's one of those games where you can pause and consider your next move, or your ultimate strategy, and rarely feel to stressed.\n\nBased on the feedback and the win to loss ratio, I think a lot of people find the game tricky. I currently find the game too easy, but that's because my brain loves strategic turn-based games like this. The difficulty is often being tweaked and the powers are being tweaked so it's a really good situation to be in.\n\nI would highly recommend this game to those who want a light quick game, but also to those who like seeing the big picture and seeing your characters develop as time goes by.", "timestamp_created": 1422081637, "timestamp_updated": 1498123315, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.552941", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13953976": {"recommendationid": "13953976", "author": {"steamid": "76561198031082350", "num_games_owned": 1382, "num_reviews": 94, "playtime_forever": 275, "playtime_last_two_weeks": 0, "last_played": 1451607571}, "language": "english", "review": "normaly i love rougelikes and i cant get enogh of them to play but i cant reccomend this game to anyone really the grapics are way too simple and not that appealing the gameplay feels as if im takeing a ipod touch and playing one of those cheep 99 cent apps i played this for a short time and allready it was boreing i know this is early acess and all but this game really dosent have much to offer the player at this time ill change my review if things get better in the future but this game is not really worth the cash in my opinion 1.4/10\n\n", "timestamp_created": 1421047619, "timestamp_updated": 1421047619, "voted_up": false, "votes_up": 4, "votes_funny": 5, "weighted_vote_score": "0.266453", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13840276": {"recommendationid": "13840276", "author": {"steamid": "76561198059561891", "num_games_owned": 848, "num_reviews": 416, "playtime_forever": 125, "playtime_last_two_weeks": 0, "last_played": 1420403617}, "language": "english", "review": "I made a video preview to show off some of the features and gameplay of this game!\nhttp://youtu.be/3sGDJO9zw1k\nI hope you enjoy!\nMartyr", "timestamp_created": 1420419806, "timestamp_updated": 1420419806, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.476748", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13274818": {"recommendationid": "13274818", "author": {"steamid": "76561198001804927", "num_games_owned": 7133, "num_reviews": 76, "playtime_forever": 1550, "playtime_last_two_weeks": 0, "last_played": 1449639582}, "language": "english", "review": "https://www.youtube.com/watch?v=uKbhprDF884\n\nI am a huge fan of Rogue-likes, even casual ones like We Slay Monsters.  Even though dying isn't completely devestating like world-resetting, dying does still matter because all of the enhancements and leveling you've done will disappear. \n\nOne way to get back up to speed, if you've earned enough while dungeoning, is by upgrading establishments like barracks to train your \"new\" warriors.\n\nHonestly I feel like I'm just reciting the exact same details on the We Slay Monsters page itself.\n\nHow bout' I just list concerns / things that should be worked on?\n\nCurrently since Update 19, there are two classes you can choose, Wizards and Warriors.  Both play well enough with the wizard having far more range to attack early on.  It will be interesting to see where this game is when the rest of the classes are available to choose from.\n\nGraphically speaking, the visuals are amateurish.  Thankfully, the animation work is done well enough to not be too distracting but only so.  I really hope at the very least the environment artwork is upgraded, but truthfully they should update the whole package.\n\nBut that's it.  It's a solid casual Rogue-like with a neat spin on mechanics by use of a poker deck.  Truthfully speaking, if you enjoyed Rogue, then the visuals really should even bother you.", "timestamp_created": 1417988482, "timestamp_updated": 1417988482, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.522117", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13262505": {"recommendationid": "13262505", "author": {"steamid": "76561198024953074", "num_games_owned": 6370, "num_reviews": 123, "playtime_forever": 19956, "playtime_last_two_weeks": 0, "last_played": 1494775459}, "language": "english", "review": "Very fun little game.\n\nEven though the graphics and sounds are a bit generic, the game itself is fun to play, the \"poker-esque\" combat adds a nifty twist to the genre, sometimes making you consider what cards to use and what to save to build a good combo against a boss later on.\n\nRight now, the game's a bit bare, only offering two quest types, arena quests and dungeon quests. The dungeons are sometimes a bit tricky to get through on the first try due to the enemies in some rooms vastly exceeding your level and sometimes even opening doors to other, even deadlier rooms of enemies. Fortunately, the same quests can be repeated until you reboot the game, allowing you to retry failed quests.\n\nThe town you can improve using gold received from successful quests is a rewarding feature. I found myself always visiting the town after missions to see what cool things I could upgrade.\n\nUPDATE Nov 1st, 2015: The game still receives frequent updates and has vastly improved since my initial review of the game. The new Rogue class is interesting and the achievements are neat, except for a few that are just gender-specific duplicates of pre-existing achievements which seem just silly.\n\nThe game still struggles from balance issues with the Wizards as their amount of ranged attacks and protective spells tend to make you nigh indestructible, being able to clear rooms that are 3-5 levels above you with relative ease.\n\nThis is still a great game to quickly play a couple dungeons of every now and then.", "timestamp_created": 1417923023, "timestamp_updated": 1446355951, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.615854", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13144221": {"recommendationid": "13144221", "author": {"steamid": "76561198002734128", "num_games_owned": 1900, "num_reviews": 338, "playtime_forever": 174, "playtime_last_two_weeks": 0, "last_played": 1483408933}, "language": "english", "review": "At first glance, this seemed like just another rouge-like dungeon crawler.  This isn't necessarily a bad thing considering that I'm a big fan of the genre.  When I saw the trailer and watched one of the founders use cards to resolve combat, I knew I had to give it a try.  My first impressions were extremely positive as I was constantly trying to come up with ways to use my cards' effects to do damage and defend against enemy attacks. Some card effects teleport monsters away to a distant tile while others freeze them.  Some card suits make ranged attacks possible while others are strictly melee based.  My only gripe is the lack of tool tips and in-game encyclopedia as some game mechanics aren't explained all that well despite the presence of a tutorial.  All in all though, there's a lot of replayability here.\n\nhttps://www.youtube.com/watch?v=16zEYynRnOw", "timestamp_created": 1417278393, "timestamp_updated": 1417279368, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522756", "comment_count": "1", "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13133066": {"recommendationid": "13133066", "author": {"steamid": "76561198067630625", "num_games_owned": 52, "num_reviews": 22, "playtime_forever": 1283, "playtime_last_two_weeks": 0, "last_played": 1476921458}, "language": "french", "review": "Amusante combinaison. Ça semble difficile lors de la première partie, mais ça devient rapidement maitrisé, malheureusement au point d'arriver vite à se sortir de tous les défis. Malgré ça, on s'amuse quand même à y retourner jouer un petit coup aux cartes magiques.", "timestamp_created": 1417227057, "timestamp_updated": 1417227057, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "13129078": {"recommendationid": "13129078", "author": {"steamid": "76561197970532145", "num_games_owned": 463, "num_reviews": 39, "playtime_forever": 716, "playtime_last_two_weeks": 0, "last_played": 1499806966}, "language": "english", "review": "Just wanted to update this now that the game is out of early access and is a full release. The game's matured, gone through a lot of revisions, and had a TON of content added to it since my last review. All this is to say that if it was a good deal and a good game before, It's a GREAT deal and a GREAT game now.\n\nIt's still relatively simple compared to a lot of other roguelites out there. It's still the same game at it's core (aka if you tried it/checked it out before and hated it, you'll still hate it). And it's still a bit on the easy side. But it's also still very very cheap, has a TON of content/replayability, has that \"just one more dungeon\" factor that really keeps you playing, and is still made by a totally rad dev who deserves your support.\n\nSo yeah, I still HIGHLY recommend this game. Worth every penny.", "timestamp_created": 1417209930, "timestamp_updated": 1499805632, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.514156", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "13115420": {"recommendationid": "13115420", "author": {"steamid": "76561198136079549", "num_games_owned": 4, "num_reviews": 1, "playtime_forever": 43, "playtime_last_two_weeks": 0, "last_played": 1417142629}, "language": "english", "review": "Fun one person game! It took a few minutes to get use to, but after a little bit I was able to fully understand the concept. Very unique and I love the art! I wish there was a way to play with or against friends.", "timestamp_created": 1417142893, "timestamp_updated": 1417142893, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477244", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13101793": {"recommendationid": "13101793", "author": {"steamid": "76561198043198608", "num_games_owned": 2891, "num_reviews": 59, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1459975608}, "language": "english", "review": "Long story short: this is a mix of Runespell and Desktop Dungeon with a flavor of it's own. Basically you explore the floor of a Dungeon meeting your enemies. The fun is - you make the wrong turn and your lvl. 1 Wizard meets lvl. 7 mob.\nThe core of the battle is the card system which has shield, fire, ice and other elements instead of dimes and hearts. You choose cards and attack with the corresponding elements. Sounds not that fun, but believe me, it is when you actually burn  and teleport your enemies all over the floor.\nMany things should be improved in this game, but overall it's pretty fun. Oh, and you also have a base castle which you can upgrade. Upgrades increase your stats and gear.\nTL;DR: Fun game with an interesting mix of mechanics. Totally worth it. Cheers!", "timestamp_created": 1417075423, "timestamp_updated": 1417075423, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.582567", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "13082926": {"recommendationid": "13082926", "author": {"steamid": "76561198090232409", "num_games_owned": 212, "num_reviews": 4, "playtime_forever": 939, "playtime_last_two_weeks": 0, "last_played": 1450388824}, "language": "english", "review": "Some gameplay footage: https://www.youtube.com/watch?v=xMKulHR-O7k&feature=youtu.be\n\nSummary:  Overall, I think it's a pretty cool game, especially this early in development.  I definitely enjoy it, even though the map is pretty small and there are only a handful of things you can actually do.  Luckily, the dungeons are randomized, so it doesn't feel like you're doing the same thing over and over again.\n\nIf I could go back in time, I would buy this game again.\n\nEDIT: When the game was updated to include the next class of characters, my game at least was reset.  I still love this game, although I'm probably not going to play it again until it's finished, so that I don't have to keep doing the same thing over and over again.\n\nHey... here's another video:\nhttps://www.youtube.com/watch?v=Uybkz_0IKL8&list=UUi3TICZOxo2cDwLg38ep3Pw", "timestamp_created": 1416953095, "timestamp_updated": 1419104130, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "13050630": {"recommendationid": "13050630", "author": {"steamid": "76561198027019860", "num_games_owned": 1094, "num_reviews": 22, "playtime_forever": 4043, "playtime_last_two_weeks": 0, "last_played": 1498111684}, "language": "english", "review": "Good start so far, after I finally figured out how the game works, it's a little too easy, but I know over time with updates and such that will change. Even in it's present state I would recommend. It's fun in short bursts.", "timestamp_created": 1416723679, "timestamp_updated": 1416723679, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "13016565": {"recommendationid": "13016565", "author": {"steamid": "76561198072664858", "num_games_owned": 670, "num_reviews": 18, "playtime_forever": 4420, "playtime_last_two_weeks": 0, "last_played": 1507250837}, "language": "english", "review": "So much fun. Well worth the price. If you like poker you have to buy this.", "timestamp_created": 1416496200, "timestamp_updated": 1416496200, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504355", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "13006515": {"recommendationid": "13006515", "author": {"steamid": "76561197967680889", "num_games_owned": 643, "num_reviews": 121, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1498315971}, "language": "english", "review": "Considering how early in development this is it's surprisingly good fun. Plays a little like Dungeons of Dredmor / Hack, slash loot. The poker based combat system is enjoyable and has interesting strategical elements. Played for about an hour, already feels like money well spent. If you fancy something a little different, pick it up now.", "timestamp_created": 1416415305, "timestamp_updated": 1416415305, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.609683", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "13001294": {"recommendationid": "13001294", "author": {"steamid": "76561198037809694", "num_games_owned": 172, "num_reviews": 3, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1416371556}, "language": "english", "review": "Good fun, unique concept delivered quite well. Art style is nice and sound is also good. For a $5 purchase it's well worth it.", "timestamp_created": 1416371585, "timestamp_updated": 1416371585, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.476042", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "12997279": {"recommendationid": "12997279", "author": {"steamid": "76561198030021498", "num_games_owned": 782, "num_reviews": 4, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1436737432}, "language": "english", "review": "Early in game, but I'd say for it's price, it's definately worth it. Interesting combat mechanics as well as, it seeming to be pretty replayable thus far.\n\nFor it's price, if you like roguelikes or dungeon crawlers, I'd pick it up, I'd pay more for it, probably.", "timestamp_created": 1416341252, "timestamp_updated": 1416341252, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.506930", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
