{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 74, "total_negative": 3, "total_reviews": 77}, "reviews": {"37790428": {"recommendationid": "37790428", "author": {"steamid": "76561198431800233", "num_games_owned": 191, "num_reviews": 1, "playtime_forever": 226, "playtime_last_two_weeks": 0, "last_played": 1511544666}, "language": "english", "review": "Riptale is a roguelite action platformer with procedurally generated rooms you will have to traverse to get to the end of the in-game areas. In terms of story you play as a ronin-like samurai on his way to attack an opposing force mainly consisting of dragons of different sizes and abilities inside a dungeon while wielding nothing but his sword.\n\nI have to say, this is the game with the most felt impact on each kill in a long time. And the simple graphics don't interfere with that at all. This was my first impression and it lasts until now. Because of that the combat feels very satisfying.\n\nMentioned feeling gets intensified by the immediate risk any attack on an enemy implies. There's no blocking or other dedicated defensive movement option to get out of harm's way - you'll have to do one of two things to try and dodge out of a foe's expected aggressive reaction: You can jump. This is only possible if you happen to stand on ground at the time you are in need of evasion and is - depending on the type of enemy you're facing - more or less high risk. To resort to this normally means that you have run out of attacks and therefore the other possibility of retreat: The slash. You can slash three times in a row and move quite a distance along the way. One one hand this is a much safer method of avoiding attacks and is usually the better way to do that. On the other hand it requires planning ahead and keeping your cool, containing the last attack for an emergency or slash-dash in a triangle to return to your safe position in the end. Depending on the complexity of the room and the visibility of it's parts (if it's very high you might not see what's upwards or worse down below in case of a fall) this is not always easy and you will have to take risks now and again. Sometimes it's also important that your attacks are spot on, which brings me to the central gameplay element of Riptale: The slashes.\n\nThey can be best described as a kind of running / jumping straight forward attack with a sword strike at the end which both play out in lightning speed. This slash hits not only straight forward (or the exact direction of the attack), but a little later also registers some way behind the fighter. Aside from bosses I haven't met any foe that didn't die instantly from one hit. On the other hand your fighter takes four hits to die on normal difficulty (one on hard). Standing on flat ground you can attack forward and even when you slash partly down (but still also left or right) the samurai will rush exactly horizontally, even when he runs over a gap or into thin air, but the following slash will 'fire' in the exact direction your analog stick was facing, enabling a few strong tactics against lower placed foes. But you can also aim into the air or / and attack subsequently while not touching ground. From jumping, while falling, in all directions, even downward - until your three actions (represented as gems) run out. Then you'll have to wait shortly for them to replenish - long enough to get you in serious danger if you are in the wrong spot. Many reviewers describe the handling as lacking in precision. I think this feeling comes from two things: Firstly, the distance covered with one slash is enormous and it's quite difficult to predict where exactly your fighter will stop. Secondly, as soon as you hit some enemies or other obstacles you stop, even if the slash hits one or more targets behind it. Combined with the fast pace of movements (also some enemies') the struggle against the layout of the rooms sometimes amounts to quite a challenge. When adding the roguelike element of luck when in need of healing hearts this can quite often seem unfair. I had my best runs while keeping calm without focusing too much on achieving anything.\nConcerning the possibilities of healing you sometimes get hearts from killed foes and crates or urns which replenish one hit on your fighter. But you can also find money. It can be spent in randomly occurring shops. These (randomly) offer attack gems different from the straight slash. Since the fighter has three slots representing the chainable attacks you get to choose when the bought variant activates. I had much fun playing around with different combinations, because other than in some roguelites I ran into an opportunity without having nearly the amount of needed money only once thus far. And that might have come from clumsily missing lots of coins in the rooms before.\nWhich brings me to a point I like and dislike at the same time: While you can go back to previous rooms to your left and right and even take the contents there indefinitely (meaning neither coins nor hearts dissolve - kudos to you, developers !), once you fall down into a room you're cut off. You can't go back up, not even using your slashes. Since you can't pan down while standing on safe ground you'll often need to do a 'leap of fate' (no misspelling) which might draw you into a slashing fight with dangerously positioned foes while driving you into spending all your attacks. If you end up floating over a downward exit at that time you will simply fall down, because there is no double jump, forcing you to abandon all (possible) coins and hearts. While I can live with that, this may concern some players who struggle a little with roguelike elements, because this might make some runs much harder - especially luckless ones.\n\nAll in all, I recommend you watch some short reviews or Let's Plays of the game and at the same time keep my description of the combat flow in mind. That way you might be able to figure out if Riptale is for you or not. I won't try to explain graphics or music to others, because that's easily solved nowadays - with all that media out there.\nWhile sceptical at first I got a gem out of a sale that I'd have paid more than the full price for had I known what awaited me beforehand.", "timestamp_created": 1511795428, "timestamp_updated": 1511795428, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "37244164": {"recommendationid": "37244164", "author": {"steamid": "76561198025004266", "num_games_owned": 277, "num_reviews": 20, "playtime_forever": 506, "playtime_last_two_weeks": 0, "last_played": 1511674504}, "language": "english", "review": "Riptale is an excellent platform/fighting game where you have three gems that represent your attack combo and they do massive, high mobility attacks that chain together and let you dash around like an absolute madman and kill any non-boss that you hit - but with the catch that they take a bit of time to regenerate. The attacks are extremely satisfying; the sound, the hit slow-motion, the mobility, the way blood sprays out, it's great. It's also pleasingly tactical; you have to consider how the enemies will move as you approach and where your attacks will carry you so you can get in, land your hits and then end somewhere safe to pause for a second to get ready to attack again. That approach feels original and interesting. The graphics are simple but the animations are good and the high contrast style is striking.\n\nIt's great, original and cheap, so I would highly reccommend it.", "timestamp_created": 1511487796, "timestamp_updated": 1511487796, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36373699": {"recommendationid": "36373699", "author": {"steamid": "76561198136247140", "num_games_owned": 786, "num_reviews": 54, "playtime_forever": 112, "playtime_last_two_weeks": 0, "last_played": 1511100867}, "language": "koreana", "review": "화면의 위에 보이는 세 개의 아이콘이 공격의 쿨타임.\n업그레이드는 그 세 개의 공격을 다른 공격으로 업그레이드 하는 식으로 이루어지는 로그라이크\n시원시원한 액션을 바라고 샀건만 칼 한 번 휘두르는데 신중에 신중에 또다시 신중을 기해야됨.\n근데 그 편이 오히려 타격감이 더 좋게 느껴짐.", "timestamp_created": 1510142686, "timestamp_updated": 1510142686, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36256315": {"recommendationid": "36256315", "author": {"steamid": "76561198088192910", "num_games_owned": 199, "num_reviews": 9, "playtime_forever": 286, "playtime_last_two_weeks": 24, "last_played": 1513668010}, "language": "english", "review": "Cool game to play ;)\n\nMaybe add some modes or game saving. It's cool to have our character with all upgrades saved somewhere to play ;)", "timestamp_created": 1509757564, "timestamp_updated": 1509757564, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35444475": {"recommendationid": "35444475", "author": {"steamid": "76561198008690142", "num_games_owned": 470, "num_reviews": 43, "playtime_forever": 588, "playtime_last_two_weeks": 0, "last_played": 1509832458}, "language": "japanese", "review": "ノーマルを１周できたのでレビュー\n\nシャッ！と踏み込み、ズバッ！と切り裂き、プシャ！っと飛び散る血飛沫の爽快感！\nこのゲームの魅力の７割はこの単純明快な気持ちよさが占めていると言えるだろう\nアップテンポのBGMを聞きながら群がる敵を薙ぎ払う、なんというか最高に「SAMURAI」してる感がある\n\nけどクリア優先なら、別に敵を全滅させる必要はなく\n無視って走り抜けたほうが効率いいのはご愛嬌w\n\n難易度は普通より難しめ\n道中は毎部屋敵の配置も種類もランダムなんで相応のアドリブ力が必要になるが\nボスはどれもパターン覚えると余裕なタイプなので\nいかに道中を抜けるかが重要\n\nジェムは初期のストレートが使い勝手が非常によく、次点でクイックドロウ\nほかは趣味の領域かな？\nそのためお金がほぼ死に要素になってるのがちょいと残念\n\n総評としては値段に見合わぬ完成度の高さを持つ優良アクションゲーム\n普通に１０００円ぐらいだしてもいいレベルなのに、６００円というリーズナブルなお値段なので\n気になった人はセールを待たずに買っても後悔しないでしょう\n\n個人的に欲を言えば、血飛沫マシマシモード的なのが欲しかったかな\nもっとズバズバ切り裂きたい！", "timestamp_created": 1507035449, "timestamp_updated": 1507072862, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.683778", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34892291": {"recommendationid": "34892291", "author": {"steamid": "76561197967490296", "num_games_owned": 660, "num_reviews": 21, "playtime_forever": 817, "playtime_last_two_weeks": 0, "last_played": 1507005921}, "language": "english", "review": "[h1]Wow... This game is an Absolute Gem!!! ([u][i]you'll get the joke if you play the game[/i][/u]). It is a [b]Must-Play[/b] for Fans of Rogue-like, Samurai, Sword Play, Minimalist Aesthetics & Gameplay, and Pure Fun!!![/h1]\n\n[b][i][u]TL;DR - BUY IT!!![/u][/i][/b]\n\nFirst off, the price is Spot On. There's no reason to wait for a sale, get this game ASAYCAI [i](as soon as you can afford it).[/i] It is very fun, easy to pick up and difficult to master. The difficulty comes from some design flaws, like the fact that enemies can cheap shot you with a clairvoyance that is utteraly ridiculous, right as you enter a room... or that controls are in fact [i]too[/i] precise. \n\nYou do have to aim at your target before striking, and while it may seem like the controls are a little off - they are in fact incredibly pinpoint, almost to a fault. The angle and timing really matter, even more so given that you only have up to 3 consecutive attacks. If you have good spatial awareness, you'll get used to having to adjust your angle by literally a fraction of a degree. This could mean the difference between executing a sweet combo... or just getting executed.\n\nThe biggest issue I have with the game is the BG Music for the main levels. It's the exact same looped track and it does not really vibe well with the music in the Menu, Shops and \"secret\" Lore Rooms. It's way too fast-paced, and bass drum heavy to be the song that you're hearing throughout most of your playtime. The 16-bit Midi feel is great, but every other song in the game is much better than the main track imo. It wouldn't be so bad if it switched every 3 or so stages after you find the lore room.\n\nWould also be nice if you had the ability to switch the locations of your abilities at will, but maybe in a future update?  Anyway, it's a great game and I Highly Recommend it. Cheers!", "timestamp_created": 1505174252, "timestamp_updated": 1505174605, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34818120": {"recommendationid": "34818120", "author": {"steamid": "76561198240271542", "num_games_owned": 25, "num_reviews": 5, "playtime_forever": 38, "playtime_last_two_weeks": 0, "last_played": 1502813249}, "language": "spanish", "review": "Rápido, violento y entretenido. A lo mejor estar en alguna plataforma portatil le haria ganar un puntito mas.\n\nAnalisis completo en SidequestCL\n\nhttps://sidequestcl.wordpress.com/2017/09/08/review-riptale/", "timestamp_created": 1504888039, "timestamp_updated": 1511700147, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34540004": {"recommendationid": "34540004", "author": {"steamid": "76561198257559184", "num_games_owned": 509, "num_reviews": 5, "playtime_forever": 548, "playtime_last_two_weeks": 0, "last_played": 1512674158}, "language": "spanish", "review": "Buenísimo, lo gané en un sorteo entre más de 20,000 personas, pero desde el momento en que lo ví, sabía que tenía que ser mío, demasiado buenísimo, aunque no termino de entender el sistema de selección de nivel, pero jugando, es lo que menos me importa hahaha, lo único que me molesto es que al seleccionar un filtro, incluso al seleccionar bufandas de otros colores, se vuelve sólido al filtro, fuese mejor si la bufanda fuera independiente del filtro, pero buenísimo juego, muy recomendado.", "timestamp_created": 1503871252, "timestamp_updated": 1503871252, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34171012": {"recommendationid": "34171012", "author": {"steamid": "76561198022619296", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1502465729}, "language": "english", "review": "Great casual game! Difficult enough to keep me interested and coming back every now and then. I also like the atmosphere of this game. Nice!!", "timestamp_created": 1502465924, "timestamp_updated": 1502465924, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34142543": {"recommendationid": "34142543", "author": {"steamid": "76561198391645587", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1497813378}, "language": "finnish", "review": "Muuten hyvä, mutta aika haastava. Kokeneemmille palaajille varmasti just hyvä.", "timestamp_created": 1502357228, "timestamp_updated": 1502357228, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33797035": {"recommendationid": "33797035", "author": {"steamid": "76561198060101867", "num_games_owned": 438, "num_reviews": 25, "playtime_forever": 1592, "playtime_last_two_weeks": 0, "last_played": 1510431699}, "language": "japanese", "review": "クリアしたのでレビューします。\n今のところ日本語圏からのレビューが不評のものしかないので、好評のものもあるべきかなと。\n\nどんなゲームかはトレイラーを見たほうが速いと思うのでここには書きません。\nただ、とにかくオススメのゲームだ、ということだけは申しておきます。\n\n【Pros】\n・敵を斬った時の爽快感、血しぶき、上手く敵を連続で切れたり、上手く迂回することでダメージを喰らわずに厄介な敵を処理てきた時の達成感\n・キチガイじみた難易度\n・今でも覚えている、初めてボスに到達出来た時の感動\n・キチガイじみた難易度\n・初めてボスを倒せた時の感動\n・キチガイじみた難易度\n・初の4面（ラスト）到達、及びラスボスに邂逅した時の感動。このような感動は、他のゲームでは滅多に手に入らない。そこには本物の試練と、本物の恐怖、本物の戦闘、貴方の20時間以上の経験と努力の達成を賭けた全てが待っている。\n・キチガイじみた難易度\n・敵の動きもボスの動きも、何もかもがフェアー。特にボスに関しては、パターン化を完璧にすれば全てノーダメージで倒すことが可能。死んだ時は常に自分が悪い。だからこそ悔しいと思えるし、次こそはと思えるし、一人の人間をここまでプレイさせた。そして上手く行けば非常に嬉しい。\n・キチガイじみた難易度\n・あと自機が物凄いスピードと物凄い動きをするので最高にSAMURAIって感じがする。慣れるのに時間はかからないがこの自機を操作しているだけでも楽しいものがある。\n・キチガイじみた難易度\n・残りライフ1から慎重にプレイして持ち直せた時はマジで脳汁出る\n\n私はノーマルモードをクリアするのに24.6時間かかりました。ただ、ある程度このゲームに精通し、適切な攻略法に早く辿り着けばこれほどかかることは無いと思います。\nそれでもやはり難易度がマジで高いです。Steamの実績データによれば、ノーマルモードのクリア者は全体の1.1%しかいません（2017/07/26現在）。インスパイア元と思われるDownwellですら5%の人間がクリアしています。\n我こそはという方、ハードコアゲーマーな方は是非ご購入ください。\nまたゲーム自体のプレイ体験も非常に気持ちよく、途中で折れても600円の価値はあったと間違いなく感じられるゲームだと思います。クリア出来ないからといってこのゲームをプレイしないのは非常にもったいないです。\n\nハードモードは……ちょっと触ったのですがヌルゲーマーの私には流石にこれは無理だと感じたのでやめました。\n\n\n【Cons】\n・Downwellライクなところ。このゲームの制作陣がDownwellに非常にインスパイアされたということは本当によくわかる。よくわかるが、それでもこのゲームはDownwellライクである必要は決して無かった。このゲームはこれ単体として完全に完成している。昇華されてしまっている。ゲームの雰囲気自体はこれでよかったとは思うが、アンロックシステム等などをDownwellライクにする必要は全く無かったように思う。ゲームシステムや攻略法も、Downwellのそれとは全く違ったものになっている。\n・クリアしようとすると非常にシビアな立ち回りを要求されるため、トレイラーから予想されるようなズバズバしたプレイが出来なくなる。私は緊張感を楽しめたのと、ボス戦は非常に切りごたえがあるので気にしなかったが、ズバズバプレイモードみたいなのが欲しかった。\n・注意：攻略法に関わります→[spoiler]初期武器が一番強いので金を拾う必要が全くない。時点で強いのはホーミングだがこれは道中便利なだけでボス戦で全く用をなさない。そして1番目に配置するとボスで事故るので3番等に配置する必要があるがそうすると道中で使い道が無い[/spoiler] \n・[spoiler]石碑を読む必要が全くない[/spoiler]\n\nそれ以外はゲームが面白すぎて特に不満無いです。\n軽く爽快感を求めたい方にも、ハードなゲームがプレイしてみたい方にも非常にオススメな一品です。600円は、あまりに安い値段に思います。", "timestamp_created": 1501024887, "timestamp_updated": 1501024887, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.484322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33698779": {"recommendationid": "33698779", "author": {"steamid": "76561197994002775", "num_games_owned": 3197, "num_reviews": 656, "playtime_forever": 526, "playtime_last_two_weeks": 0, "last_played": 1493495189}, "language": "english", "review": "Awesome game, i enjoyed it each time\nits not so easy, but its awesome\nthe controls are smooth, the soundtrack is stimulating,\nthe blood effects are really great with the black and white theme\nhttps://www.youtube.com/watch?v=BIXQmNLaDH0", "timestamp_created": 1500650030, "timestamp_updated": 1500650030, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.489762", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33671913": {"recommendationid": "33671913", "author": {"steamid": "76561198019655958", "num_games_owned": 42, "num_reviews": 1, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1494348801}, "language": "english", "review": "Good game, if you like challenging yourself! Soundtrack is amazing!", "timestamp_created": 1500555949, "timestamp_updated": 1500555949, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.487847", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "33639531": {"recommendationid": "33639531", "author": {"steamid": "76561198091738104", "num_games_owned": 53, "num_reviews": 4, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1512008849}, "language": "english", "review": "You fight monsters with a pot on your head. 10/10 would pot again.", "timestamp_created": 1500416917, "timestamp_updated": 1500416917, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33440481": {"recommendationid": "33440481", "author": {"steamid": "76561198041753179", "num_games_owned": 511, "num_reviews": 19, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1500054069}, "language": "english", "review": "It's cool to swing your sword around, and with a little practice you can overcome the imprecision of the raw gameplay and be very good... until you reach the bosses.\n\nThe art style is reminescent of Downwell and another game called Nongunz (both rogue-likes too... coincidence?)\n\nI really liked Downwell; sadly I think in this game things are a bit more complicated to distinguish on the screen rather than in Downwell.\n\nAfter the first run I unlocked basically nothing more; every unlockable was just cosmetic, nothing gameplay-wise. There are trinkets you could collect by winning special challenges, but they do nothing (I'm sure of it, developer told so).\n\nAt the actual state of the game I think it could frustrate/bore you very quickly, but with some extra effort maybe it could be good as much as other titles like Downwell.\n\nVERY IMPORTANT: The twins boss is very unfair, at this point still haven't been able to beat 'em. I think it's the small arena, the limited control over the player, the randomic nature of enemy projectiles: fix it please.", "timestamp_created": 1499719797, "timestamp_updated": 1499719797, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.486721", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32939702": {"recommendationid": "32939702", "author": {"steamid": "76561198018959089", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 443, "playtime_last_two_weeks": 0, "last_played": 1493480471}, "language": "finnish", "review": "Dragons? Check. Ninja samurai warrior? Check. Blood'n'guts'gore? Check!", "timestamp_created": 1498661957, "timestamp_updated": 1498661957, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "32860139": {"recommendationid": "32860139", "author": {"steamid": "76561197998404588", "num_games_owned": 192, "num_reviews": 2, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1498501689}, "language": "english", "review": "a very rewarding and punishing rogue like game, simple controls, move left and right, dash in 1 of the 8 directions, seems simple yet doing it all properly in the heat of battle is very difficult, you choose the wrong direction and you might just get hit, get hti 4 times and game over try again so you gotta be careful and as such is a very fast paced game, if you like punishing but at the same time very rewarding gameplay then you will like this game.\n\nwhat I don't like is that when you go to the next room there's the possibility of getting hit right away which you can't do much, same case with off screen enemies, some enemeis can dash or teleport to you and when they do that off screen then you can't do much in the way of not getting hit by that, definitely the biggest frustration I had while playing", "timestamp_created": 1498578894, "timestamp_updated": 1498578894, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543623", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32762259": {"recommendationid": "32762259", "author": {"steamid": "76561198099613899", "num_games_owned": 152, "num_reviews": 2, "playtime_forever": 28, "playtime_last_two_weeks": 0, "last_played": 1512938482}, "language": "english", "review": "Tested this on my friends computer and just had to buy it for myself!\nOne of the best games I have played this year, a breath of fresh air with excellent soundtrack.", "timestamp_created": 1498379712, "timestamp_updated": 1498379712, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.539322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32674506": {"recommendationid": "32674506", "author": {"steamid": "76561198006386538", "num_games_owned": 337, "num_reviews": 3, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1496047928}, "language": "english", "review": "Disclaimer: I was a part of the team that build the Ludum Dare version of this game.\n\nFrom humble beginnings Riptale has grown into an amazing, action packed hack & slash platformer. The core combat is super satisfying. That said, there are hints of role-playing elements and story progression that have clearly been cut at some point, which is a shame. \n\nAs it is now, the game is a love letter to old school games like Ninja Gaiden with a rocking soundtrack to boot. Definitely worth picking up at the sales.", "timestamp_created": 1498213306, "timestamp_updated": 1498213306, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32591631": {"recommendationid": "32591631", "author": {"steamid": "76561198026386017", "num_games_owned": 313, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1510596105}, "language": "finnish", "review": "Hey thats pretty good!", "timestamp_created": 1497963628, "timestamp_updated": 1497963628, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32569489": {"recommendationid": "32569489", "author": {"steamid": "76561198023328440", "num_games_owned": 230, "num_reviews": 5, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1500636041}, "language": "english", "review": "Pretty decent little game.", "timestamp_created": 1497889643, "timestamp_updated": 1497889822, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.420772", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32568338": {"recommendationid": "32568338", "author": {"steamid": "76561198009854709", "num_games_owned": 1673, "num_reviews": 476, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1493667098}, "language": "italian", "review": "UN BAGNO DI SANGUE ANNUNCIATO (Riptale)\nQuando il rosso del sangue stacca sulla grafica in bianco e nero e i nemici esplodono in chiazze di morte a mezz'aria, state giocando a Riptale, un action platform roguelike originale e primitivamente soddisfacente.\n\nhttps://www.youtube.com/watch?v=j4zqu0LqxVA", "timestamp_created": 1497886745, "timestamp_updated": 1497886745, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.462703", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32567922": {"recommendationid": "32567922", "author": {"steamid": "76561198045687174", "num_games_owned": 130, "num_reviews": 3, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1501837260}, "language": "english", "review": "On the recommendation of my friend stribe, i got this game with little intrigue, but after playing it i found the controls simple and rather responsive, the fast past combat yet with time be four enemies to plan out your moves. The levels vary if you so it makes the game feel less repetitive if you die a lot.\n\n Generaly a fun arcade type of game", "timestamp_created": 1497885638, "timestamp_updated": 1497885638, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503804", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32403157": {"recommendationid": "32403157", "author": {"steamid": "76561198064810210", "num_games_owned": 155, "num_reviews": 8, "playtime_forever": 431, "playtime_last_two_weeks": 24, "last_played": 1514324185}, "language": "english", "review": "Never have I played a game that has caused me such consternation as Riptale. Every time I play I think to myself \"I hate this game. It sucks, it's too hard, there aren't enough pick-ups, there's no checkpoints or the ability to save progress so I can go about my life.\"\n\nAnd yet, I play it. I play it all the time. Almost every day out of a library of more than forty games I love, I play a game that I hate. It's flaws make it's perfection. It's difficult to describe how I feel about it. Perhaps this piece of art intends for me to reflect on the duality of man. Perhaps I'm supposed to find meaning in the hypocrisy of my choices. Perhaps it's just a really good game.\n\n10/10", "timestamp_created": 1497413347, "timestamp_updated": 1497413347, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.512252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32325940": {"recommendationid": "32325940", "author": {"steamid": "76561197976927468", "num_games_owned": 426, "num_reviews": 15, "playtime_forever": 506, "playtime_last_two_weeks": 0, "last_played": 1506065837}, "language": "english", "review": "[list]\n[*]Fast-paced\n[*]Great Soundtrack\n[*]Good Vibes\n[*]F**k those Twins\n[*]i r8 8/8\n[/list]", "timestamp_created": 1497123808, "timestamp_updated": 1497123870, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32324241": {"recommendationid": "32324241", "author": {"steamid": "76561197961690753", "num_games_owned": 440, "num_reviews": 9, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1495826417}, "language": "english", "review": "I love how you can only use your weapon abilities to move around, making it high-paced and tactical to get from A to B. I might have been spoiled by Spelunky a tad too much, expecting secrets to be everywhere in the game, but even without these deeper layers Riptale is a very fun experience. Boss fights can be a little annoying sometimes, but don't feel unfair or anything. The standard color palette has some issues with readability occassionally (haven't tried the unlockable ones yet), but is lovely to look at.", "timestamp_created": 1497118738, "timestamp_updated": 1497118738, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32232614": {"recommendationid": "32232614", "author": {"steamid": "76561198015619702", "num_games_owned": 336, "num_reviews": 7, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1494259673}, "language": "english", "review": "With mechanics this good, Riptale can pull you in for some immensly satisfying combo kills and keep you for the boss fights.  It's worth the cost for the fighting alone.", "timestamp_created": 1496810473, "timestamp_updated": 1496810473, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32212799": {"recommendationid": "32212799", "author": {"steamid": "76561198040030741", "num_games_owned": 918, "num_reviews": 111, "playtime_forever": 1589, "playtime_last_two_weeks": 0, "last_played": 1496693141}, "language": "english", "review": "Riptale as a casual experience is short, fun and challenging hack and slash platformer.\nYou start in one out of 3 randomly selected zones, go through random premade rooms with randomly placed enemies in them. \nIt's pretty straight forward - keep advancing until you reach the next stage (3 per zone), which will also increase the difficulty by placing more enemies / spikes to deal with. Once you made it past 3 stages, you will fight a boss, and advance to the next zone.\n\nYou're offered to mix 'n match your combo system to create a verity of attack patterns - these greatly change the gameplay so I advise trying them all out.\n\nSo far so good, but here is the catch for the completionists among you: prepare for the most unfair experience you've ever faced.\nIn order to 100% this one, you'll have to beat hard mode.\n\nHard mode entails:\n- 1 heart, can be upgraded to 2 with an RNG shrine buff.\n- No stat upgrade upon killing bosses.\n\nYou know when they say \"Don't try this at home?\", well this is it. The game is not optimized for this nature of a run, here are some things you should be aware of if you ever decide to attempt this:\n\n- You cannot precisely aim your attacks.\n- Enemies are hard to see sometimes. \n- Leaps of faith / charging towards an offscreen enemy just in time to get insta-gibbed.\n- Cheap telefrags.\n- Cheap deaths due to transition straight into an enemy. \n\nI did this because I can, but cannot recommend anyone else to attempt it unless you really like pain and suffering.\n\nHere is a montage of the brutality I went through:\nhttps://www.youtube.com/watch?v=ZbuYQTBoKvQ", "timestamp_created": 1496720042, "timestamp_updated": 1496720042, "voted_up": true, "votes_up": 26, "votes_funny": 3, "weighted_vote_score": "0.668005", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32109797": {"recommendationid": "32109797", "author": {"steamid": "76561198010134836", "num_games_owned": 7917, "num_reviews": 14, "playtime_forever": 1032, "playtime_last_two_weeks": 0, "last_played": 1495922385}, "language": "english", "review": "[h1]Basic Info[/h1] \n[b]Genre:[/b] Platforming Action Adventure\n[b]Difficulty:[/b] Medium-Hard\n\nIn the world of Riptale, Dragons threaten to take over the world. You have acquired three arcane gems that allows you to perform attacks on the dragons with your sword. You venture forth on a mission to kill as many dragons and their servants as possible. \nIn your journeys you collect gold from slain enemies and destructible items on the levels. You can use that gold in sparsely, scattered shops to by different and arcane gems that alters the way your attacks work, such as a quick-draw dash attacks, double and triple attacks,  homing attacks. You can chose in which order those appear and thusly create new combos. \nIn your journeys you may also come across magic rune stones that alter how you play, such as making you bunny jump, move faster or having more gems but not regenerating health.\nYou start with 4 hearts and getting hit by an enemy or their projectiles removes a heart - at zero hearts you die. But luckily enemies and destructible items on the levels can drop hearts. There is also one heart at the end of every lelve.\nSome levels may also have challenges that range from navigating a maze in darkness on time, not taking damage or killing all enemies in the room. Completing a challenge awards you with a trinket - a collectible item in the game.\nEach stage has 3 regular levels and then a boss level. Defeating a boss grants a bonus such as more gems and more hearts. All the levels, except the boss levels, are procedurally generated. \n\nThe narrative is delivered through the intro and books found in library on some levels and books between levels. Those are entirely optional to read, but gives a nice insight into why the ruin you just traversed became a ruin or why the garden you just got through was abandoned. \n\nThe game uses a minimalist 2D art-style. The base game is black, white and red, but as you progress in the game you can unlock different screen filters, such as the \"classic\" filter, which is green and reminds me of a nintendo gameboy or a red one which reminds me of the virtual boy. The screen filters does not affect the gameplay and is purely cosmetic. The game is well optimized and will run smoothly on most machines.\n\nThe soundtrack is uptempo and upbeat and will have your adrenaline pumping as you slay the dragons and their minions and strive for survival. The sound effects are top quality and helps you immerse yourself in the slaughtering. \n\nRiptale has near-infinite replayability as the levels are procedurally generated and there are plenty of different gem / attack combos for you to discover, not to mention that the difficulty is high, so even just defeating a boss will be challenging by itself. You will easily find yourself telling yourself \"just until I die next time, just one more try\".\n\n[code]Submitted for [url=http://steamcommunity.com/groups/elitegives]Elite Giveaways[/url] and [url=http://steamcommunity.com/groups/semeigaming]Semeicardia Gaming[/url].[/code]", "timestamp_created": 1496332058, "timestamp_updated": 1496332210, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.609509", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32097499": {"recommendationid": "32097499", "author": {"steamid": "76561198192660225", "num_games_owned": 813, "num_reviews": 4, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1496175091}, "language": "spanish", "review": "Entretenido, clásico y retador.\n\nRiptale es un juego 2D en ambientación a los juegos antiguos de mecánica simple pero con un grado de dificultad desafiante que te mantiene pegado a la pantalla aplicando los combos de ataque con destreza para no morir.\n\nTu objetivo es simple, matar a los enemigos mientras recorres el mundo, puedes jugarlo de forma casual o leyendo las notas que encontrarás en el camino para enterarte de la histora; al comienzo es dificil acostumbrarte a tener reflejos rápidos, pero a medida que juegas te acostumbras a ello, haciendote sentir genial por lograr esos combos ejecutados a la perfección.\n\nRecomendado por su ambientación, su diseño y su estilo de pelea algo peculiar, perfecto para pasar un rato de ocio.", "timestamp_created": 1496278355, "timestamp_updated": 1496278544, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.427184", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "32079569": {"recommendationid": "32079569", "author": {"steamid": "76561198003352401", "num_games_owned": 693, "num_reviews": 148, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1493395985}, "language": "french", "review": "Lorsque j’ai reçu la clé du jeu dans ma boîte mail et que je suis allé voir les screenshots de présentation, je me suis dit “belle repompe de Downwell“. J’ai tout de même lancé Riptale… et j’ai bien fait car je serais passé à côté d’un titre très sympa.\n\nContrairement à ce que j’avais pensé, le titre de Super God s’éloigne pas mal de celui de Moppin. Nous y dirigeons un épéiste découpant tous les ennemis qu’il croise sur son chemin.\n\nPetite subtilité, nous avons à disposition 3 charges permettant d’attaquer à peu près n’importe quelle cible à l’écran. Une fois celles-ci utilisées, il faut attendre un peu qu’elles se rechargent, sauf si vous avez réussi à lier parfaitement vos mouvements.\n\nAprès les balbutiements du départ, c’est un vrai plaisir d’enchaîner les combos dans des gerbes de sang sans jamais toucher le sol. Plus vous progressez et plus le plaisir de jeu augmente.\n\nL’argent récolté permet de modifier ses attaques et de bénéficier par exemple de frappes circulaires pour encore plus d’efficacité.\n\nLes niveaux et environnements sont assez variés, générés aléatoirement et vous devrez apprendre peu à peu les comportements des différents ennemis pour espérer survivre jusqu’au boss de chaque monde.\n\nBrutal, technique, Riptale est un excellent défouloir !\n\nhttps://www.youtube.com/watch?v=NjKwZW2FN-0", "timestamp_created": 1496214222, "timestamp_updated": 1496214222, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.504307", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31998826": {"recommendationid": "31998826", "author": {"steamid": "76561198180033302", "num_games_owned": 102, "num_reviews": 21, "playtime_forever": 330, "playtime_last_two_weeks": 0, "last_played": 1496264164}, "language": "english", "review": "I don't really make reviews for games that arent funny, but this game is completely different, this game is fast paced, action packed, and honestly one of, if not my favorite steam greenlit game. This game seems to have very similar visual designs to Downwell, and I LOVE Downwell, oh, and I haven't even gotten to the soundtrack. This game has one of the best soundtracks that I've listened to in a while, It's absolutely wonderful. So if I were to give this game a ranking between 1-10, I would gove this game a solid 9/10. The only issue I found with this game was the fact that you couldn't change controls (but I think that could be fixed later), no question, you should buy this game, and come on, it's only $5.99, if this game were being sold for $20 I would still buy it with an open heart and an open wallet. This game is the most perfect defenition of a hidden jem. In the end this game is amazing and I HEAVILY reccomend you get it.", "timestamp_created": 1495897859, "timestamp_updated": 1495897859, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31985620": {"recommendationid": "31985620", "author": {"steamid": "76561198065094838", "num_games_owned": 451, "num_reviews": 78, "playtime_forever": 345, "playtime_last_two_weeks": 0, "last_played": 1495770392}, "language": "japanese", "review": "ノリノリの曲に合わせて居合一閃、血しぶきと敵の亡骸を撒き散らしながらダンジョン奥深く潜っていくゲーム\nゲーム性はＰＶの通り、ただちょっとシステム的なアレで高難易度になってる。正直プレイする人を選ぶので注意。\n\n\nレビュー\n・攻撃・ジャンプだけのシンプルな操作\n・ライフ制と攻撃回数３回（時間で回数は回復する）だけと言うシビアなゲーム、このお陰で「敵をどう倒すか？」と言うパズル要素も生まれ、上手く決まった時に爽快感も。居合い斬りはジャンプ代わりに使ったりもする。連鎖が決まれば攻撃回数が回復し更に連鎖可能になったり。\n・少しのローグライク要素あり、ダンジョン内にある店には敵やオブジェクトから出るお金を集め購入、居合い斬りを三連続斬り・超誘導ホーミング斬りetc変更出来る。たまにお店とは別にステータス強化できるお墓があったり。\n・音楽がとても良い\n\n悪い点\n・マップ数は少ない３ステージのみ、大体１ステージ時間かかっても１０分くらい\n・ゲームパッド推奨、キーボードでプレイするのは絶対オススメしない\n・当たり判定が良くわからない、敵に重なってもダメージ食らわなかったりタイミングが本当に良く分からん\n・ローグライク要素は上手く機能してない、居合いの種類変更はホーミング居合い以外は必要あるのだろうか・・・ステータス強化系のアイテムはハズレばっかり。\n・攻撃は方向を選んで攻撃ボタンで居合するのだが、斬り付けたい方向に上手く攻撃出来ないことが多い。ノーマル攻撃でも多少は誘導してくれるがまあ外れる。お陰で余計なダメージをもらったり、敵に囲まれ一気に窮地に追い込まれる事ばかり。\n・ＰＶはホーミング性能が高い居合い攻撃を使っているので、かなり爽快にアクションしてる様に見える。が実際のザコ敵はあんなに突っ込んではいけない・・・\n・上手く連鎖が決まると攻撃回数が回復すると言ったな、あれは嘘だ。（敵を三連続でx3コンボで倒すと回復するのだろうが未だに良く分からん）\n・ジャンプが使い勝手悪い。多分、居合い斬りをより強調するためにそうしてるのだろうけど、マップの作り的にジャンプでギリギリいけなかったりする足場が多く、イラッとする\n・森のマップだけザコ敵が厄介すぎる\n・背景も自分も敵も白黒の為、自分がどこに居るのか分からなくなる時が度々・・・\n・アンロック要素・チャレンジマップ・・・これはなんだろうか\n\n\n正直、ゲームシステムの融通の利かなさを把握しながらプレイしないと到底クリアできない惜しい感じのゲーム\nゲームのポテンシャルの高さがあるだけに悪いとこが目立つ、２ステージまでクリアしたが頑張って全クリしたい\n・・・だ！か！ら！そっちに攻撃してねえって！", "timestamp_created": 1495847711, "timestamp_updated": 1495847869, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.545988", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31961465": {"recommendationid": "31961465", "author": {"steamid": "76561198054386085", "num_games_owned": 324, "num_reviews": 8, "playtime_forever": 29, "playtime_last_two_weeks": 0, "last_played": 1508468584}, "language": "english", "review": "Imagine Downwell with a katana (cooling system between hits) instead of when you hit directly the ground (for reload) + boss fights. Also the randomly generated dungeons, random items, stores, permadeath, extremely high difficulty and you got........Riptale!!!  \n\nSorry devs, i'm comparing to a game yet an awesome one as I may say!   \n\nGreat buy if you like action fast-paced, tight 360 degree control platforming epicness!! (those small slowdown slashing effect always makes me smile and feel like a badass!) \n\nGet it and git gud.\n\nps: Please add D-pad on the gamepad :)\nEDIT: D-Pad is bindable, but not preferable.", "timestamp_created": 1495753524, "timestamp_updated": 1495784885, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.477337", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31917083": {"recommendationid": "31917083", "author": {"steamid": "76561198026998275", "num_games_owned": 217, "num_reviews": 1, "playtime_forever": 163, "playtime_last_two_weeks": 0, "last_played": 1512709524}, "language": "english", "review": "[h1] Overview [/1]\n\nRiptale is an excellent game with an extremely tight game loop and inspires a zen-like gaming experience. However, if you do not have a controller, hate dying repeatedly or are looking for deep gameplay or story then I would suggest giving this a miss.\n\n[u] Gameplay [/u]\n\nYou start with 3 gems which you can expend to perform various slashing attacks. After each slash the game slows down briefly allowing you to chain together attacks and after a gem is expended you must wait for it to recharge. Your goal is to descend each cavern system and take out the boss at the bottom. You can get hit by enemies a total of 4 times before dying.\n\nSounds fairly simple, yes? Well it is. However, the controls make it much more difficult. To aim the attack, you've got to point the left-stick in the direction you wish to strike however you also use the left-stick to walk meaning that you've got to aim reflexively (Not to mention there's no reticle either). Personally it took me about an hour and a half to become comfortable with the controls, YMMV.\n\nScattered around the levels you can find boxes and vases which can be broken to find coins and hearts (monsters also drop these). The coins can be used at shops to replace your current gems with new ones with different attacks. This adds a little bit of variety to the combat as it allows you to adopt different styles of move differently.\n\nOccasionally you may find rooms off to the side which contain a stone tablet which give you some kind of wacky effect (From 3 extra gems to impossibly fast and slidey movement) or a challenge room which allows you to unlock various collectables.\n\nOnce you reach and defeat the boss you will be given a power-up (an extra gem or heart IE.) and released onto on of the other dungeons to defeat that boss. The power-up is temporary and will be lost after you die or restart the game. Looking at the achievements there also seems to be a \"main boss\" that I assume you would fight after defeating all the dungeons in one playthrough.\n\nDeath isn't a really big deal in this game. When you die you just simply hit restart and you'll respawn at the top of a random dungeon. I never felt like I was waiting around for the game to start again. Though there's probably about 5 seconds between dying and respawning, which might be too much for the easily frustrated.\n\nThe dungeon layout seems to be random, which makes sense given the number of times you're going to be replaying it. However, I feel like this game would benefit from a slightly more structured approach. I'd definitely be interested in a metroidvania with the same mechanics.\n\n[u] Graphics [/u]\n\nAt first the graphics are rather harsh due to their start black/white style, though after some time it doesn't really bother you. However, if it does irritate you, you'll quickly start unlocking filters (Faded, Green etc.). The graphics can get rather repetitive, however, they're still quite well done and look great with blood splattered all over them.\n\nEnemies look pretty good, the black/white/red aesthetic and animations differentiate them from the background however they can blend into the background sometimes, however this seems intentional as the ones that are often hard to recognize tend to be smaller, less troublesome enemies.\n\n[u] Sound [/u]\n\nThe soundtrack is awesome. Everyime I start up the game and I hear the music kick in it really gets me in the mood to slaughter a room of undead, cultists and dragons. \n\nThe sound effects used in the game are really well done, however I think a sound for when you run out of gems would be helpful in addition to making the sound of gems recharging a lot louder than they currently are. More feedback sounds in general would be helpful.\n\n[u] Story [/u]\n\nThere isn't really an in-depth story as such. It's basically summed up in the intro as \"dragons show up, kill everyone and can only be hurt by certain people able to use magic gems, one such warrior is questing around to exterminate them\". It's enough to give you context but nothing that drives the experience, though I think it would subtract from the experience if they focused too much on the story.\n\nApart from the intro scene you can also find books scattered around that provide you with snippets of lore. Some of them are quite entertaining to read.\n\n[h1] Conclusion [\\h1]\n\nThis is honestly a very solid game. I've got no reservations to recommend this game to anyone provided they have patience and a controller. There's certainly some room for improvement but it's mechanically complete and satisfying.\n\nThough. I really would like an option for more blood.", "timestamp_created": 1495543708, "timestamp_updated": 1495543708, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.490463", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31888766": {"recommendationid": "31888766", "author": {"steamid": "76561198083405157", "num_games_owned": 149, "num_reviews": 1, "playtime_forever": 159, "playtime_last_two_weeks": 0, "last_played": 1495391881}, "language": "english", "review": "Almost a great game, but the controls are genuinely awful.\n\nThey're somewhat sticky, so that directional commands do not always register in time. Half of the time, you will find it impossible to hit an enemy, having to attack multiple times to finally register a hit. \n\nThe restriction on how many attacks you have makes this particularly frustrating. Though you get more attacks with combo attacks, the level design and accuracy you can achieve make this mechanic less than prevalent. \n\nIronically, the most fun I had playing the game was when I found the powerup that gives you three extra gems. \n\nI've barely touched the bosses, but from what little experience I've had, they're even more infuriating to fight. The Twins, especially, due to their small size, mobility, and large attacks are almost impossible to hit. \n\nThe level design is boring; the washed out, colorless pallette is boring to look at, the levels themselves get repetative and are difficult to traverse, and the amount of times I've accidentally fallen into the pit to the next level while there's still more enemies to kill and money to collect is just annoying.\n\nThe other attacks you can get are also almost interesting.... If you could ever live long enough to afford more than one. Most of the attacks, I find, also tend to be either really inaccurate or they fuck up your rhythm. Maybe with more time to experiment, I would find them more useful.\n\nOverall, my impression of the game is: annoying.", "timestamp_created": 1495392624, "timestamp_updated": 1495406469, "voted_up": false, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.574637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31873987": {"recommendationid": "31873987", "author": {"steamid": "76561198055394667", "num_games_owned": 180, "num_reviews": 9, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1499204094}, "language": "english", "review": "Ever cut a guy in half so hard you cut the guy behind him in half?\nNow you have.", "timestamp_created": 1495336507, "timestamp_updated": 1495336507, "voted_up": true, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31833895": {"recommendationid": "31833895", "author": {"steamid": "76561198031825316", "num_games_owned": 108, "num_reviews": 1, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1505076304}, "language": "english", "review": "You could call it a testament to how much fun it is to play this game that i love it so much even if im terrible at it. it lives up to its fast-paced, action roots and the gem combat system adds an interesting amount of customization in your combos even if i still have no idea what half of them even do still", "timestamp_created": 1495166448, "timestamp_updated": 1495166448, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31816675": {"recommendationid": "31816675", "author": {"steamid": "76561198028287259", "num_games_owned": 2543, "num_reviews": 194, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1494118262}, "language": "brazilian", "review": "Tá difícil competir.", "timestamp_created": 1495085481, "timestamp_updated": 1495085481, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31774428": {"recommendationid": "31774428", "author": {"steamid": "76561198006229921", "num_games_owned": 120, "num_reviews": 71, "playtime_forever": 48, "playtime_last_two_weeks": 0, "last_played": 1496426386}, "language": "english", "review": "Im not a fan of hack and slash, but this game seems allright. Will be playing on my laptop when I have time :\n\nIf you enjoy hack and slash, this deal seems like a steal.", "timestamp_created": 1494874205, "timestamp_updated": 1494874205, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31753534": {"recommendationid": "31753534", "author": {"steamid": "76561198286017559", "num_games_owned": 1863, "num_reviews": 378, "playtime_forever": 229, "playtime_last_two_weeks": 0, "last_played": 1494793882}, "language": "english", "review": "In Riptale you take the role of the swordsman, a dragon hunter of sorts. You go through randomly generated levels and hack/slash through the enemies. Literally. There’s lots of blood and when you strike an enemy, you really go through him. Non-boss enemies die from one hit, but you must plan your attacks carefully, because it’s pretty easy for them to hit you too.\n\nI have enjoyed causing havoc wherever I go in this game, it's bloody, gory and a lot of fun, I'd recommend for any fan of the hack and slash series.", "timestamp_created": 1494783475, "timestamp_updated": 1494783475, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31747553": {"recommendationid": "31747553", "author": {"steamid": "76561197999383250", "num_games_owned": 993, "num_reviews": 22, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1494881934}, "language": "german", "review": "Das Spiel ist ein simpel gestaltetes Roguelike, die Steurung ist sehr präzise aber funktioniert wunderbar (mit Gamepad gespielt).\n\nIn dem Spiel startet man mit wenig Leben und kämpft sich durch eine Art Dungeon voller Gefahren. Als Waffe hat man sein Schwert und alle Gegner die ich bisher getroffen habe waren nach einen Treffer weg vom Fenster.\n\nOptisch ist es in simplen Schwarz-Weiß gehalten was durch den Schal des Spielers und dem Blut der Gegner dann doch noch etwas an Farbe bekommt. Mir gefällt der Stiel aber ist sicher nicht was für Jeden.\n\nDas Kampsytem ist auch simpel gehalten aber genau das macht den Reiz des Spieles aus. Bewegungstasten, eine Taste zum Springen und eine zum Angreifen. Das war auch schon alles.\n\nDas coole am Kampsystem ist, dass man mit einen click auf Angriff nicht einfach sein Schwert schwingt, man springt quer durch die Luft und teilt den Gegner in zwei oder mehr Stücke. Das man die Angriffe gezielt einsetzen muss wird sichergestellt indem man „Angriffskristalle“ hat (welche sich nach kurzem wieder aufladen) sobald diese Kristalle leer sind ist man total Hilflos und in Lebensgefahr.\n\nWenn man mal ein bisschen reingekommen ist fühlt es sich gut an quer durch den Dungeon zu springen und die Schwarzweise Optik mit frischen Rot etwas zu verschönern.\n\nNebenbei sammelt man auch noch Gold ein, welches man im Shop ausgeben kann und sich somit neue Attacken kaufen kann.\n\nWenn die HP aber mal auf 0 Sinken ist alles wieder weg und man kann von vorne beginnen. \n\nFür mich war das Spiel ein netter Spaß für zwischendurch den ich bestimmt immer wieder mal für ein paar Runden ausgraben werde, aber ich sehe mich nicht wie ich 5h am Stück durch den Dungeon schwinge. Da das Spiel aber relativ günstig ist, finde ich das aber auch nicht so schlimm.\n\nHier sind noch Aufnahmen aus meiner ersten Stunde:\nhttps://www.youtube.com/watch?v=Tr5u1enmkds", "timestamp_created": 1494766390, "timestamp_updated": 1494766390, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31728995": {"recommendationid": "31728995", "author": {"steamid": "76561198090324484", "num_games_owned": 399, "num_reviews": 2, "playtime_forever": 477, "playtime_last_two_weeks": 0, "last_played": 1499499966}, "language": "russian", "review": "Игра очень классная.Саундтрек и сам gameplay завораживают.Такая игра понравится не многим", "timestamp_created": 1494695660, "timestamp_updated": 1494695660, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.562044", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31672531": {"recommendationid": "31672531", "author": {"steamid": "76561198043367667", "num_games_owned": 1025, "num_reviews": 143, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1494697584}, "language": "english", "review": "This game is crazy and intense.", "timestamp_created": 1494450107, "timestamp_updated": 1494450107, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31593225": {"recommendationid": "31593225", "author": {"steamid": "76561198013784317", "num_games_owned": 94, "num_reviews": 8, "playtime_forever": 1016, "playtime_last_two_weeks": 0, "last_played": 1495854535}, "language": "english", "review": "I love this game. I seriously love it. It's easy to play but difficult to master. The funny thing about the game is that the gameplay is so much fun that even when you die and have to start over, it's not a big deal - Because it's just so much fun. \n\nThis game is a STEAL at the current price point because there's tons of replayability, the soundtrack is amazing and it's just fun as balls. Please buy this game so we get more out of this group of awesome people!!", "timestamp_created": 1494118271, "timestamp_updated": 1494118271, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.544927", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31545188": {"recommendationid": "31545188", "author": {"steamid": "76561198031844953", "num_games_owned": 21, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1512028659}, "language": "english", "review": "A fast-paced action-packed adrenaline-marinated retro-styled platformer. Fast to learn but hard to master. Music deserves a notion too, I would place it to early 90's action games.", "timestamp_created": 1493920369, "timestamp_updated": 1493920369, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31545172": {"recommendationid": "31545172", "author": {"steamid": "76561198126121616", "num_games_owned": 93, "num_reviews": 2, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1496350876}, "language": "english", "review": "Riptale is a fast paced rogue-like action game where the emphasis is on quick movement and chaining combos. Fluid and simple controls make the game easy to learn and the fast fighting means it remains an intense experience throughout. The game is not without problems though. \n\nSometimes the enemies can hit you just as you're falling down to new room, and the black and white color palette - while aesthetically strong - can sometimes make it hard for the player to see what part of the scenery is background and what is a stationary snake ready to kill you. Also while the soundtrack is well made, a lack of variation meant that I turn the volume down a little more each time I start playing the game.\n\nUltimately whether you should buy the game or not can be summarized in two questions:\n1) Is the game fun, and\n2) Is it worth the asked price\nI can quite safely say \"yes\" to both questions. In the grand scale many of my issues with the game are nitpicks, and despite sometimes being ruthlessly difficult the game never feels truly obnoxiously annoying. Plus everytime you strike an enemy down the sword makes a pleasing slashing sound, the game stops for a moment and you see the enemy get cut  in half with all the pixelated blood spraying around. And really that alone is quite enough for me.", "timestamp_created": 1493920310, "timestamp_updated": 1493920403, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31533530": {"recommendationid": "31533530", "author": {"steamid": "76561198035718532", "num_games_owned": 120, "num_reviews": 22, "playtime_forever": 261, "playtime_last_two_weeks": 0, "last_played": 1494034309}, "language": "english", "review": "This is a really cool minimal hack-and-slash roguelite. The combat is probably the most satisfying of any game ever, which is great. My complaints about the game don't even begin to overshadow how fun this is. For $5, it's a must buy.\n\nHowever, I have some complaints with the game, and I think my biggest complaint is that there's no sense of area progression. Areas are randomized as far as I can tell, so your first level could be any of the game's levels. The red and white theme also makes sure that all of the levels really blend together. I played for over an hour and at all times I could never really tell you which level I was on or how long my run had been. None of the areas ever say \"Level 2\" or anything, so there's no way to know how long your run has even lasted. The fact that there's no sense of progression really hurts this game in my opinion.\n\nThe artstyle is a bit difficult to get past for me. Although it definitely looks cool, restricting the whole palette to three colors gives serious limitations which hinder the game's enjoyment. Having different areas be different colors would be a great way to differentiate them, which would solve some of the progression issue. However, I'm sure the developer is married to the style they created, so the most I can ask is to PLEASE make non-interactive scenery pieces a light gray rather than a white. It would be so much easier to interpret everything going on on screen if there was at least a little bit of differentiation between the important objects and the scenery.\n\nThere's a few other improvements I'd really like to see patched in. First of all, the D-pad doesn't work on controllers, which I'm sure would be simple to code in. Secondly, the antialiasing on the homing attack looks INCREDIBLY out of place compared to the rest of the tricolor graphics. There's also no way to see your health unless you get hurt, which I think is a mistake. I understand that this game is trying to stay minimal, but you can even see your gold at all time. Your gold count only matters when you're in a shop, but health matters *always*. So, that would be a good improvement.\n\nThe mechanic of switching out your gems is cool, but there's a few ways it could be made better. First of all, there's no way to rearrange your gems unless you're in a shop. This seems like something that would give the player more choices without affecting balance, so I'd really like to see it added. Next, there isn't much of an explanation as to what each gem does. I'd love to see a menu when you press select that lets you rearrange your gem and see a more detailed description of their mechanics. I admire the simplicity of \"show, don't tell\", but I honestly can't tell what some of the gems do compared to normal gems, even after playing with them for a while.\n\nI really hope the developer(s) keep working to improve this game. The combat is so cathardic that I'll probably play this all the time, and I'd love to have some improvements to the rest of the game to top it all off!", "timestamp_created": 1493859177, "timestamp_updated": 1493859177, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31506455": {"recommendationid": "31506455", "author": {"steamid": "76561198089721705", "num_games_owned": 122, "num_reviews": 21, "playtime_forever": 773, "playtime_last_two_weeks": 32, "last_played": 1513869577}, "language": "french", "review": "Le jeux est géniale et vraiment pas chère il vaut sont prix, les musiques sont ultime j'adore !! je passe des bon moments à try :)", "timestamp_created": 1493732968, "timestamp_updated": 1493732968, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31500409": {"recommendationid": "31500409", "author": {"steamid": "76561197970550696", "num_games_owned": 443, "num_reviews": 46, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1494938652}, "language": "spanish", "review": "Riptale es un juego de acción 2D con el objetivo de hacer combates de espada tan sangrientas e impactantes como sea posible. El jugador recoge gemas que le permiten ejecutar diferentes ataques en el orden de su elección.\nTodo esto resulta una combinacion que llenan la pantalla con sangre y tripas.\nUn juego indie con el que pasaras horas disfrutando de su jugabilidad \nEspadazos sangrientos en un 2d en blanco y negro.\nhttps://www.youtube.com/watch?v=7FW5Iwd5OrM", "timestamp_created": 1493702788, "timestamp_updated": 1493702788, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31490423": {"recommendationid": "31490423", "author": {"steamid": "76561198028651970", "num_games_owned": 547, "num_reviews": 83, "playtime_forever": 144, "playtime_last_two_weeks": 0, "last_played": 1493652162}, "language": "english", "review": "Not a bad game by any means, but due to the flaws and not that much variety in gameplay I suggest waiting for 50% discount.\n\n[h1]Video review + gampleay[/h1]\nhttps://www.youtube.com/watch?v=i77oexaJsSs\n\n[h1]About the game[/h1]\n\tIn Riptale you take the role of the swordsman, a dragon hunter of sorts. You go through randomly generated levels and hack/slash through the enemies. Literally. There’s lots of blood and when you strike an enemy, you really go through him. Non-boss enemies die from one hit, but you must plan your attacks carefully, because it’s pretty easy for them to hit you too.\n\n[h1]The Good[/h1]\n-\tHitting enemies feels great. The blood, the slow-down of time at the moment of impact that allows you to start another combo.\n-\tChallenging Difficulty: the game is really hard and unforgiving, although if you mess up - you know it was your fault most of the time\n-\tGood selection of music and sounds. The music can get repetitive after a while, but it never felt annoying. The hit sounds are very satisfying: it’s exactly as you would imagine when you think about something alive that got hit by a sword.\n-\tCustomizable attack combos: you don’t have a traditional attack cooldown. Instead, you have three attacks (gems). Each attack costs one gem, so you can do three rapid attacks at once. Gems replenish over time though, so you can’t combo immediately. The interesting thing is you encounter shops as you progress in the game, and those sell special gems that can alter your attack pattern and make you stronger. This is the main way to change your strategy and playstyle. For example, as you play, you discover that placing some gems in first position makes charging harder, so you put them in second attack position (i.e. your first attack remains normal, but second attack becomes homing, allowing to kill the enemy quickly if he dodged).\n\n[h1]The Bad[/h1]\n-\tCollisions could be better. Occasionally you go through flying enemies without damaging them. \n-\tGems are not recharged when you enter new room. If the game expects to have a fast gameplay, it’s a bit counter-intuitive to have player stand in one place and wait till the gems are refilled. \n-\tAiming controls felt subpar quite a while: the 45-degree directions are fine, but enemies that are located at a different angle from you are frustrating to hit.\n-\tSlow-mo during falls could be useful. From time to time you get into situation when you jump down a platform and collide with a monster below (but there was no way to see it).\n-\tThe levels are randomly generated. Traversing some rooms is not very pleasant due to a huge number of obstacles or maybe randomly placed stuff. The level compositions seems to be a bit broken and the gameplay speed gets hindered because of that.\n\n[h1]Summary[/h1]\nWhat game excels at is the feel when you kill something: once your character cuts an enemy, you know this was for real. The time slows down for a split second and you just know that you’ve delivered a crushing blow of unstoppable force to something. That feeling of speed, action and being in the center of the events is something. Due to the other flaws and pretty simple graphics – I suggest waiting for 50% discount before grabbing the game; It gave me ~2 hours of good gameplay, but I doubt I’d return to it later.\n", "timestamp_created": 1493656328, "timestamp_updated": 1493656328, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.561572", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31488619": {"recommendationid": "31488619", "author": {"steamid": "76561197986357299", "num_games_owned": 117, "num_reviews": 2, "playtime_forever": 488, "playtime_last_two_weeks": 0, "last_played": 1506615456}, "language": "english", "review": "If you love games such as original Ninja Gaidens on NES chances are you'll find Riptale a good bargain.", "timestamp_created": 1493650890, "timestamp_updated": 1493650890, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31473252": {"recommendationid": "31473252", "author": {"steamid": "76561198067184505", "num_games_owned": 123, "num_reviews": 5, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1494964567}, "language": "english", "review": "Very fast and fun gameplay!", "timestamp_created": 1493587730, "timestamp_updated": 1493587730, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496944", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31429986": {"recommendationid": "31429986", "author": {"steamid": "76561198156282999", "num_games_owned": 249, "num_reviews": 7, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1494387993}, "language": "english", "review": "I feel Riptale has nailed down perfectly the old school mantra of \"easy to learn, difficult to master\". The game has a simple yet stylishly realised look and straightforward but engaging and badass mechanics. This is not the kind of game I could play for a marathon session, it is however the kind of game I know I'll find myself craving to play on a fairly regular basis. Any time I want a great way to kill an hour or two my mind is going to jump immediately to this.\n\nI find the combat to be extremely satisfying to the point where I don't know or even care if I'll ever finish the quest. Just being able to dive straight in to the excellent soundtrack trying to pull off the longest combos hits me where it counts in a way that few games ever have.\n\nRiptale is not the greatest game ever made, nor is it trying to be. But what it does try to be, I feel it pulls off impeccably.", "timestamp_created": 1493435162, "timestamp_updated": 1493435656, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31424898": {"recommendationid": "31424898", "author": {"steamid": "76561198093815204", "num_games_owned": 40, "num_reviews": 11, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1493581580}, "language": "english", "review": "A really challenging 2D rogue-like hack and slash game. Once you get the combos rolling it feels pretty satisfying going through the dungeon. The game can be punishing if you don't focus in what you are doing. Somewhat rough around the edges from time to time but still enjoyable.", "timestamp_created": 1493412907, "timestamp_updated": 1493412907, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31422319": {"recommendationid": "31422319", "author": {"steamid": "76561198014108636", "num_games_owned": 88, "num_reviews": 3, "playtime_forever": 133, "playtime_last_two_weeks": 0, "last_played": 1493572538}, "language": "english", "review": "A platformer with an authentic retro feel. Graphics, music, gameplay and even the difficulty reminds me of my childhood days spent playing NES platformers. Nobody holds your hand through the game, but instead you learn from the mistakes. One of the better rogue-like platformers out there imo.", "timestamp_created": 1493404326, "timestamp_updated": 1493404326, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.539789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31419918": {"recommendationid": "31419918", "author": {"steamid": "76561197969697228", "num_games_owned": 585, "num_reviews": 13, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1493062131}, "language": "english", "review": "Pros:\n-Distinct visual style\n-SUPER fast paced\n-Cutting shit in half is super satisfying\n-You feel like a badass when you pull off combos\n-The Combo gem system works really well and makes combat really interesting.\n\nCons:\n-Sometimes, a little too fast\n-Some enemies are difficult to see until it's too late.\n-Double jump would be sweet.\n\nOverall, i'd still recommend it, especially for the price, you can easily have a few hours of fun and feel pretty awesome when you get good.\n\nVideo of gameplay below:\nhttps://www.youtube.com/watch?v=u9ByklzK4Wg", "timestamp_created": 1493397374, "timestamp_updated": 1493397374, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458477", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31416253": {"recommendationid": "31416253", "author": {"steamid": "76561198072568774", "num_games_owned": 207, "num_reviews": 1, "playtime_forever": 1934, "playtime_last_two_weeks": 0, "last_played": 1495264455}, "language": "finnish", "review": "Probably the best indie-game I've played in years.\n\nThe action, music and atmosphere are top-notch. If you have even a slightest passion for action-packed games, definitely check this one out!", "timestamp_created": 1493387012, "timestamp_updated": 1493387012, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31412324": {"recommendationid": "31412324", "author": {"steamid": "76561198097861403", "num_games_owned": 110, "num_reviews": 2, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1495495633}, "language": "english", "review": "For the price this game is fucking lit, very bind of issac, nuclear throne like.", "timestamp_created": 1493372449, "timestamp_updated": 1493372449, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.539789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31406600": {"recommendationid": "31406600", "author": {"steamid": "76561198027993554", "num_games_owned": 423, "num_reviews": 13, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1494291059}, "language": "english", "review": "Pretty fun game. Took a bit getting use to the controls, but after that it was pretty good. Getting a nice chain of combos in the game feels very satisfying, and the art style looks great too.\n\nAlso this game has no relation to Undertale at all, just going to go ahead and say that.", "timestamp_created": 1493346720, "timestamp_updated": 1493346797, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.536508", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31405218": {"recommendationid": "31405218", "author": {"steamid": "76561198019651869", "num_games_owned": 394, "num_reviews": 1, "playtime_forever": 91, "playtime_last_two_weeks": 0, "last_played": 1494428549}, "language": "english", "review": "Neat little surprise, fast pace and fun, havent played it much yet, but so far so good.", "timestamp_created": 1493340666, "timestamp_updated": 1493340666, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31405015": {"recommendationid": "31405015", "author": {"steamid": "76561198154299846", "num_games_owned": 374, "num_reviews": 272, "playtime_forever": 44, "playtime_last_two_weeks": 0, "last_played": 1495205968}, "language": "english", "review": "Do you remember Castlevania? Well this game remindes me of that old school classic. Riptale is a fast paced, fun and keeps you on your toes type game. The game is based around the side scroll era and is monochrome styled game that would go great with SinCITY for the Color palette. However I did get a sour flavor in my mouth when I found out it was controller only and was single life based. But that is just me and have played past it! None the less, I would totally suggest trying it out! Happy Gaming", "timestamp_created": 1493339669, "timestamp_updated": 1494031069, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31403592": {"recommendationid": "31403592", "author": {"steamid": "76561198018677833", "num_games_owned": 315, "num_reviews": 13, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1511147397}, "language": "english", "review": "Good 2D platformer with some roguelite elements and stylish combat that allows you to perform some sick tricks.\nGreat buy for $6.", "timestamp_created": 1493333136, "timestamp_updated": 1493333136, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31401926": {"recommendationid": "31401926", "author": {"steamid": "76561198008768479", "num_games_owned": 429, "num_reviews": 169, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1493299945}, "language": "english", "review": "Is an addictive game, i loved the fact that we can buy and make our combos.\n\nCheck out the gameplay and join the Indie Army! :)\n\nhttps://www.youtube.com/watch?v=Mc-oFG2T4xE", "timestamp_created": 1493326410, "timestamp_updated": 1493326410, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.456365", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31400049": {"recommendationid": "31400049", "author": {"steamid": "76561198093907186", "num_games_owned": 118, "num_reviews": 2, "playtime_forever": 114, "playtime_last_two_weeks": 0, "last_played": 1499214542}, "language": "english", "review": "This game is fast paced and fun, with a great soundtrack. The gameplay is mostly what you would expect, with a satifying combo system. With exciting and fast gameplay, a great soundtrack and a low price, this game is everything you could want in a rougelike action platformer. The only thing you need to be wary of, is that you will have the best experience using a controller. This game was clearly designed with the 360 degree rotation of a control stick, and I couldn't imagine playing it with a keyboard.", "timestamp_created": 1493320292, "timestamp_updated": 1493320292, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.510676", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31399922": {"recommendationid": "31399922", "author": {"steamid": "76561198016139130", "num_games_owned": 307, "num_reviews": 8, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1493377732}, "language": "english", "review": "Do you like games such as binding of isaac and nuclear throne? And also, enjoy your fair share of difficult gameplay, where missing a few hits can mean you're going to end up dying? Then this game might just be it for you.\n\nRiptale is a very simple looking game, however, what it lacks in intricate looks it more than makes up for in hard and punishing but very enjoyable gameplay.\n\n[b]So why is the gameplay hard and punishing? [/b]\nThe game uses a system called \"gems\", you have room for 3 \"gems\" at a time. Everytime you start the game you will have the 3 default gems that are just a normal slash, but throughout the game you'll be able to acquire new gems, for instance by buying them from the store. These gems contain different styles of attacking, however, you still only have 3 hits that recharge very slowly, so if you miss an attack you're boned. However, whenever you do kill something the time will slow down for a little bit giving you just enough time to figure out your next move.\n\n[b]So what about the aesthetics? [/b]\nThe game looks very simple yes, but I don't think I would've enjoyed the game much more with more colours, the black and white scheme with the occasional red streaks really helps with looking through a room, if it were a bit more complex this might have interfered with the gameplay making everything just a blurry mess of colours.\n\n[b]So what about the progression?[/b]\nThe game is of the genre most known as \"rogue-like\" this means that you enter a (usually) randomly generated level in which you must keep advancing rooms (or screens) to move on with the game. So far I've noticed that levels are ordered by an area for instance \"Fungi Caverns\" and after you have progressed through the area by traveling through rooms you go to a next area, after 3 areas total you will have to fight a boss. Unfortunately I've not yet beaten a boss so, I do not know what happens after one.\n\n[b]What about the technical details?[/b]\nThe game is locked to 60 fps, and launches in a small window, the only way to increase the size of the window is by going into full screen which will just enlarge everything.\nThere's a master sound option and an individual slider for sound effects.\nYou can also remap the keys used in the game.\n\n[b]So, would you recommend this game?[/b]\nIf the topics I addressed in this post have you interested I'd say give it a go, and don't forget if you do not enjoy the game you can always use steam refunds if you've not played for more than 2 hours, so, I would give this game a go, as you might be surprised to how fun this game can be.\n\n[b]You've been pretty positive so far surely there's some downsides?[/b]\nYes, the game has its fair share of bugs and weird interactions, but so far nothing I've encountered has truly ruined my gameplay in anyway, also the random generation could be looked at a little better as at one point I've had it randomly generate 3 stores in a row on consecutive screens.\n\nIf you would like to find out more check out My Perspective at: https://youtu.be/s7zHbSw0Q9c", "timestamp_created": 1493319827, "timestamp_updated": 1493387091, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.554795", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31398947": {"recommendationid": "31398947", "author": {"steamid": "76561198045595134", "num_games_owned": 1916, "num_reviews": 63, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1492897611}, "language": "german", "review": "Riptale ist ein Spiel, welches einfach aussieht, im Kern aber echt schwer sein kann, und ich empfehle dringend, es mit einem Controller zu spielen. \n\nDas Kampfsystem basiert darauf, aus möglichst wenigen Angriffen das beste zu machen. Man hat sogenannte Gems, die stellen da, wie oft man angreifen darf. 3 Gems bedeuten also, dass man drei Mal hintereinander angreifen darf. Mit dem Analogstick bewegt man sich normal, bestimmt aber auch, in welche Richtung man mit dem nächsten Angriff stürmt/dasht. So kann man also auch erst nach oben, dann nach rechts und anschließend direkt nach unten angreifen und damit die Gegner in der Umgebung erledigen. Dazu gibt es dann auch Münzen, mit denen man sich bei versteckten Händlern Gegenstände kaufen kann, die einem verschiedene Boni geben. Stirbt man, fängt man wieder von vorne an, jedoch nicht unbedingt auf der ersten Ebene.\n\nDazu gibt es auch verschiedene Gegnertypen, wie andere Ninjas, die entweder auf einer Ebene bleiben und nur dort angreifen, sowie weitere, die auch nach oben dashen und den Charakter verfolgen. Schlagen, fliegende Drachenköpfe und noch einige weitere Gegner erwarten einen dort ebenfalls, es wird also nicht so schnell langweilig.\n\nDie Grafik ist wie man sie halt auf den Bildern sieht, eigentlich ist es gar nicht mein Stil, aber das rote Blut erinnert mich sehr an Sin City, die Filme fand ich wiederum gut. Manchmal ist es aber auch schwer, die Gegner direkt zu erkennen, das kann aber auch gewollt sein. Der Fenstermodus ist für mich persönlich viel zu klein, ich konnte da kaum etwas erkennen, also kann ich nur empfehlen, das Spiel im Fullscreen zu spielen.\n\nZum Sound kann ich nur sagen, dass mir die Hintergrundmusik sehr schnell auf den Zeiger ging, sodass ich diese schnell ausgeschaltet habe, zum Glück kann man ja auch seine eigenen Musik dazu hören. Die weitere Soundkulisse hört sich dagegen gut an, und durch das Geräusch einer Klinge, die durch ein Hinderniss schneidet, bekommt man auch audiotechnisch Feedback für gelandete Treffer.\n\nIch kann das Spiel jedenfalls weiter empfehlen, besonders, wenn man mal etwas für zwischendurch sucht, das aber auch etwas fordert und mitunter auch schnelle Reaktionen ab verlangt.", "timestamp_created": 1493316842, "timestamp_updated": 1493316842, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31398776": {"recommendationid": "31398776", "author": {"steamid": "76561198025691757", "num_games_owned": 12, "num_reviews": 1, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1493327221}, "language": "english", "review": "Fast-paced, challenging, fun!", "timestamp_created": 1493316312, "timestamp_updated": 1493316312, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31398372": {"recommendationid": "31398372", "author": {"steamid": "76561198170795925", "num_games_owned": 339, "num_reviews": 36, "playtime_forever": 282, "playtime_last_two_weeks": 0, "last_played": 1501161723}, "language": "turkish", "review": "https://www.youtube.com/watch?v=N2DAOi97PQs&t=697s\n\nOyun 2 boyutlu bir platform aksiyon macera oyunu.\nGerçekten menü müziğini o kadar sevdim ki bu incelemeyi yazarken arkada açıp dinlemeye başladım :D \nOyun içi bölüm müzikleri de gayet güzel olsa da benim favorim menü müziği oldu.\nÖncelikle şunu söyleyeyim oyunumuz biraz zor. Ama oynadıkça hırs yapıp başından kalkmak istemiyorsunuz :D\nOyunda farklı bir saldırı stilimiz var ve marketlerden daha fazla saldırı türleri alabiliyoruz. (ölene kadar geçerli ) \nBölgelerde bazen rastladığımız anıt gibi yerlerde ise farklı özellikler kazanabiliyoruz. ( ölene kadar geçerli ) \n2 saat civarı oynadım ve menü de gördüğüm pet sistemi hakkında bir bilgim yok malesef :(  \nİlk bossa kadar geldim 3-4 kere fakat kesemediğim için boss fight sonrası neler olduğu hakkında bir  fikrim yok malesef :D \nOyun fiyatı da 10 lira ve gayet de ucuz bence bir denemenizi tavsiye ederim gerçekten saatlerinizi verebilirsiniz parasının da karşılığını verir diye düşünüyorum :)", "timestamp_created": 1493315226, "timestamp_updated": 1493315506, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31398326": {"recommendationid": "31398326", "author": {"steamid": "76561197981289067", "num_games_owned": 304, "num_reviews": 2, "playtime_forever": 78, "playtime_last_two_weeks": 0, "last_played": 1493459337}, "language": "english", "review": "Exactly what it shows in the trailer.\n\n* Fast\n* Precise\n* Hard\n* Satisfying.\n* 360 movement with controller.", "timestamp_created": 1493315073, "timestamp_updated": 1493315073, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.535171", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31398239": {"recommendationid": "31398239", "author": {"steamid": "76561198001725715", "num_games_owned": 1133, "num_reviews": 15, "playtime_forever": 254, "playtime_last_two_weeks": 0, "last_played": 1493337210}, "language": "english", "review": "Great fun action heavy Rogue Like game.  Fantastic music and the graphics are very stylish.  Nice level of challenge and customisation, I like that there is a bit more focus on skill than sheer RNG of drops like other rogue lites, definately worth checking out in my opinion.", "timestamp_created": 1493314823, "timestamp_updated": 1493314823, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31397369": {"recommendationid": "31397369", "author": {"steamid": "76561197988212186", "num_games_owned": 430, "num_reviews": 3, "playtime_forever": 76, "playtime_last_two_weeks": 0, "last_played": 1512334914}, "language": "english", "review": "If you're looking for a game where pressing the attack button [i]definitely[/i] makes it more effective, here it is.", "timestamp_created": 1493312228, "timestamp_updated": 1493312228, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.606122", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31396963": {"recommendationid": "31396963", "author": {"steamid": "76561197967742101", "num_games_owned": 477, "num_reviews": 8, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1494928267}, "language": "danish", "review": "Det her er et simpel men rigtig fedt spil. Man løber rundt og smadre monstre og andre ting i dungeons som skifter hver gang man dør. Det der gør det svært, er at ens attacks koster en gem og man har kun 3 i starten, så man er nød til at planlægge og tænk fremad. Der er mulighed for at find stentavler som giver en buff eller Debuff. Der er også mulighed for at samle penge sammen og købe nye gems som giver nye angreb (min ynglings er homing) så man kan lave nogle fede Comboer.\n\nSpillet er svært og man skal forvent at dø mange gange men, det er fedt, når man får lavet nogle fede comboer.\n\nHar oplevet 2 gange spillet crashed og man skal enten spille på full screen eller meget lille vindue (håber de fikser det).\n", "timestamp_created": 1493311168, "timestamp_updated": 1493311168, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31396784": {"recommendationid": "31396784", "author": {"steamid": "76561198023946001", "num_games_owned": 345, "num_reviews": 59, "playtime_forever": 752, "playtime_last_two_weeks": 0, "last_played": 1499462485}, "language": "english", "review": "[h1]Riptale is Undertale, but only genocide route.[/h1]\n[b]Jokes aside, this game does what old games were famous of, fast paced combat, upbeat and fast music that encourages you to push the tempo to the limit, simple, but nice visuals and a skeleton in a shop that makes awful puns.[/b]\n[i]Can't say that this game is for everyone, but if you love slicing, and dicing through hapless dragons, drakes and other reptiles I strongly reccomend it[/i]", "timestamp_created": 1493310700, "timestamp_updated": 1493310700, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.527091", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "31396585": {"recommendationid": "31396585", "author": {"steamid": "76561197976708119", "num_games_owned": 224, "num_reviews": 2, "playtime_forever": 110, "playtime_last_two_weeks": 0, "last_played": 1493316328}, "language": "english", "review": "This is exactly what it promises to be: Fast-paced, indie, oldschool, retro 2D-action. If you are looking for a fast-paced, indie, oldschool, retro 2D-action, then Riptale is your game. It is well executed and made with love & passion.\n\nI haven't clocked much on Steam (yet), but I managed to play it on beta, so I'm familiar with it and immediately bought it when it was released.\n\nFor a price of a small pint, it's well worth the money and good fun for several hours.", "timestamp_created": 1493310157, "timestamp_updated": 1493310158, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.633465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31396429": {"recommendationid": "31396429", "author": {"steamid": "76561198006575550", "num_games_owned": 663, "num_reviews": 190, "playtime_forever": 79, "playtime_last_two_weeks": 0, "last_played": 1496888207}, "language": "english", "review": "Really surprised by this one, I discounted based on it's simple look but I was dead wrong. It's a precise roguelite with combat modifiers that you need to buy. I found it to be very enjoyable once I got the hang of it, you get into a slicing & dicing rhythm.\n\nFurther thoughts,\nhttps://www.youtube.com/watch?v=BcXzcj1ClSY", "timestamp_created": 1493309711, "timestamp_updated": 1493309711, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.573561", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "31396252": {"recommendationid": "31396252", "author": {"steamid": "76561198073558863", "num_games_owned": 286, "num_reviews": 56, "playtime_forever": 729, "playtime_last_two_weeks": 0, "last_played": 1495055336}, "language": "spanish", "review": "El resumen es: Magnifico y a buen precio, Compralo\n\nAhora bien, hay matices, el juego es rápido divertido y con una buena música acompañando, son partidas rápidas y es medianamente difícil, pero mientras te acostumbras lo haces mas fácil y cada vez mas divertido, el control está pulidísimo y responde perfectamente, además, lo mueve hasta una Notebook.\n\nTodo esto, no significa que sea perfecto, hay algunos fallos que considero importantes, y que no parecen estar en la mira de los developers, esto es mas en cuanto al engine del juego, es algo molesto no poder ajustar la escala de la resolución en modo ventana, y los fondos está un poco vacíos, dejando el escenario algo soso, pero si lo que quieres es pasar un buen rato moviéndote sin parar, cómpralo, sin mas, te lo pasarás bien.\n\nOs animo también a dejar feedback en el discus del juego\nhttp://steamcommunity.com/app/616000/discussions/\n\nVideo: youtu.be/BvZgW-b4Qrs\n", "timestamp_created": 1493309249, "timestamp_updated": 1493309249, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.600000", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}}
