{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 186, "total_negative": 8, "total_reviews": 194}, "reviews": {"38642224": {"recommendationid": "38642224", "author": {"steamid": "76561197972680235", "num_games_owned": 469, "num_reviews": 15, "playtime_forever": 101, "playtime_last_two_weeks": 101, "last_played": 1514153756}, "language": "english", "review": "Better than I expected.", "timestamp_created": 1514166120, "timestamp_updated": 1514166120, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36018382": {"recommendationid": "36018382", "author": {"steamid": "76561198261726995", "num_games_owned": 30, "num_reviews": 9, "playtime_forever": 183, "playtime_last_two_weeks": 61, "last_played": 1513444030}, "language": "russian", "review": "Бляtь, это шикарно, разрабы сделали из галаги рогалик, найс", "timestamp_created": 1509037168, "timestamp_updated": 1512897263, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.468278", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35830138": {"recommendationid": "35830138", "author": {"steamid": "76561198044562004", "num_games_owned": 172, "num_reviews": 11, "playtime_forever": 1400, "playtime_last_two_weeks": 26, "last_played": 1513786801}, "language": "german", "review": "Good", "timestamp_created": 1508376216, "timestamp_updated": 1508376216, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35487993": {"recommendationid": "35487993", "author": {"steamid": "76561197996124728", "num_games_owned": 935, "num_reviews": 25, "playtime_forever": 815, "playtime_last_two_weeks": 0, "last_played": 1507674187}, "language": "english", "review": "[h1]Starward Rogue[/h1]\n\nAfter spending more time in Starward Rogue. I have 30% of the game unlocked.  I wanted to modify my review to be a bit better reflection of the game. If you want the super short review: The game is very good, even at full price. If you want the short 'comparison' review : the game is like The Binding of Issac, or Enter the Gungeon in spirit and replay-ability. Starward Rogue and those other two games I would consider the best top-down rogue games currently available on steam. For a side scroller: Rogue Legacy is good.\n\nSo now a further examination of this game:\n\n[h1]Gameplay and Fun[/h1]\n[b]10/10[/b]\nLets face it, this is why you play a game like this. This is going to be affected by the quality of the levels, enemy variation, 'responsiveness' and controls. The developers have done a lot to improve upon the genre. Secret rooms are not as much of a guessing game , [spoiler] they are glowing tiles you shoot with a missile rather than cracks in walls, or something even more obtuse like in Gungeon. [/spoiler] . there's plenty of different characters to pick from out of the gate. they are different, and fun. One very esoteric (and challenging) bot controls time. The game only progresses when you move. Really interesting feature.\n\n[h1]Roguelite-ness[/h1]\n[b]8/10[/b]\nThis is its own category, because it merits discussion. Is the level generation algorithm good? Well offhand it looks like a modified BSP tree, and it works well. the levels balance well. They generate quickly, more quickly than BOI did. The item synergies feel good, and the path to progression being a combination of leveling, shopping, hunting and luck seems to be a nice mix. I havent had many 'broken' runs. Small modifications to the level, such as teleporters at the ends of leaves in levels to get around are nice additions, and make the game less tedius when you are in a run. \n\nI will say that the very jarring increase in difficulty on level 5 even in normal mode is pretty surprising. Why did I take off 2 points? \n\nFirstly I wanted to see more thematic variation between levels. This is something BOI and Gungeon do well. The levels ARE different, but not [b]very[/b] different. This could be improved.\n\nSecondly, because of the intersection of sound and procedural generation. I'll explain more in the next section.\n\n[h1]Music and Sound[/h1]\n[b]6/10[/b]\nIn most roguelite games this is the most overlooked thing, and it is here as well. Firstly, the sound is adequate, and the music is adequate. Its not 'bad'. Its just a lot of missed opportunities. The music track does not change thematically much from room to room. Exceptions are the silence in sacrifice rooms, and a few other notable things. Otherwise the track just seems to sort of play. The music was offputting at first -it felt like a 90s rave dance track. Over time its grown on me, and I'd even say its fitting of a mirthful bot-game. Some ways it could be better? How about change the instruments when health is low? What about changing the instrumentation based on the room enemies? Like a big powerful monster is a low booming synth, lots of little bots are like arpeggiators. By picking the 'robot' genre you have so much possibility to tightly couple the music and sounds you hear to what the player sees and experiences. Missed opportunity for greatness here, but not categorically 'bad' either. Its barely above average, hence 6/10\n\n[h1]Programming and Stability[/h1]\n[b]5/10[/b]\nOk I am a programmer, so I can probably weigh in on some of this. Firstly a TON of options are exposed in the settings and menus and thats just awesome. Hats off. There are some issues with UI scaling at large resolutions that needs to be configurable, and also issues with very wide monitors as well. the second part is more forgiveable.\n\nThings like collision detection, and overall physics seem to be 'ok'.\n\nWhen it runs the game performs well, and you can see you usually are getting 100s of FPS. So that's good.\n\nThe low score however is due to frequent crashes, which is unfortunately unacceptable. Not sure what is the right move there.\n\n[h1]Art[/h1]\n[b]7/10[/b]\nThe art is good, but not 'amazing'. The bots look cool, the usage of 'energy' projectiles was smart, because the game gets a glow-y tech-y vibe. Befitting of a bullet hell game.\n\nI do feel like the projecticles coudl benefit from more animation. Sometimes the projecticles looks like a lot of very static lifeless decals. What if the glow pulsated? what if the projecticle spins as it comes to you? some Do but a lot of them look rough. On the other hand the projecticle 'pathing' is awesome, and they make very interesting fun patterns.\n\nThe ship is neat, and I like that you can see through the floor. It does take a little time to learn which tiles are traps. There's a spike trap that I did not 'percieve' as a trap until I had already been hurt by it. Again. Animation could fix this. what if the spikes popped up? Its moving so i know its dangerous.\n\nOverall the art looks good, but the game needed more animations to convey its ideas.\n\n[h1]Overall[/h1]\n(each score out of 10)\n[table]\n    [tr]\n        [th]Gameplay and Fun[/th]\n        [th]10[/th]\n    [/tr]\n    [tr]\n        [td]Roguelite-ness[/td]\n        [td]8[/td]\n    [/tr]\n    [tr]\n        [td]Music and Sound[/td]\n        [td]6[/td]\n    [/tr]\n    [tr]\n        [td]Programming and Stability[/td]\n        [td]5[/td]\n    [/tr]\n        [tr]\n        [td]Art[/td]\n        [td]7[/td]\n    [/tr]\n[/table]\n\nAverage: [b]7.2[/b]\nThe game is WORTH the money at full price, and is VERY fun. its a shame this game has not achieved the popularity of other titles in the genere. If you see it on sale, its a good use of money of course as well.", "timestamp_created": 1507186012, "timestamp_updated": 1507399857, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.529098", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35413251": {"recommendationid": "35413251", "author": {"steamid": "76561197980079561", "num_games_owned": 248, "num_reviews": 4, "playtime_forever": 1211, "playtime_last_two_weeks": 0, "last_played": 1507763452}, "language": "english", "review": "My only suggestion/complaint after 7 hours of play (currently). When there are the same colors on screen. It can be hard to tell. Which is your own and the enemy's bullets. Sometimes the color of the back ground of the room. Can contribute to this. It can also sometimes blends in with bullets. However this is more of a perfect random chance sort of thing.\n\nThis is the first time. I've seen a game tell you what drops are in rooms. For example if get resource drops and don't collect them. Then later on then use said resources. It'll show you icons on the mini map for thoses resources until you are maxed. There are also teleport pads at the end of dead ends. I like how the gam respects your time.\n\nI have run into items that appear to be wild cards. I couldn't find a place online. That had them all listed with explanations. I couldn't find a wiki of everything like with other games. The reason I'm mentioning this is because I ran into a room with 9 of them.", "timestamp_created": 1506945722, "timestamp_updated": 1506945722, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35390567": {"recommendationid": "35390567", "author": {"steamid": "76561198286200379", "num_games_owned": 1514, "num_reviews": 1443, "playtime_forever": 173, "playtime_last_two_weeks": 0, "last_played": 1506871714}, "language": "brazilian", "review": "Legalzin vale a pena", "timestamp_created": 1506879273, "timestamp_updated": 1506879273, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35040526": {"recommendationid": "35040526", "author": {"steamid": "76561198173899526", "num_games_owned": 292, "num_reviews": 21, "playtime_forever": 1390, "playtime_last_two_weeks": 0, "last_played": 1505725389}, "language": "english", "review": "Starward Rogue's truly an excellent game.\n\nYou might want to add \"- wars\" in your research while looking for gameplay on Youtube, though, else all you're getting is Star Wars : Rogue trailers.\n\nIt's a really polished gem, that wonderfully mixes up the rogue-like genre, that everybody seems to know and unconditionally love (Thanks, Isaac ?), and the niche-targetting, fantastic but unfriendly Bullet hell genre (get outta here, Isaac.)\n\nMechs are usually a turn-off for me, but there's clearly enough variety and vivid colors to make me love the artistic direction. I've got to mention the soundtrack, though. I guess it's some kind of ambient trance or something (I'm not very good with names), and even though it felt weird in the beginning, it actually fits the action quite well. Alas, there are very few tracks, which to me is the only downside of this game.\n\nGameplay-wise, it's really refined. The game has an excellent progression curve (even though you'd better get familiar with danmakus if you weren't in the first place.) There's lots of enemies, which all come with cool, inventive patterns, and the rogue-likey character customization gets pretty relevant here. No doubt the devs were shmup addicts who wanted to give the genre some fresh air by getting rid of scoring and linear progression and adding lots of new features, and the result is lovely.\n\nFinally, the bosses really are badasses, and the fights are accordingly rewarding. Getting to the end of the game is going to be tons of pain, so be prepared. Regular not-so-hardcore players should be able to get to the end of floor 5, though, and I think for 12$, Starward Rogue's definitely worth the shot. Just don't inflict that to your family and friends if you're the yeller type, of course. :)", "timestamp_created": 1505718830, "timestamp_updated": 1505718830, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.600983", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34251781": {"recommendationid": "34251781", "author": {"steamid": "76561198036241243", "num_games_owned": 836, "num_reviews": 4, "playtime_forever": 390, "playtime_last_two_weeks": 0, "last_played": 1502784170}, "language": "english", "review": "After a few extreme fails I finally changed the difficulty to \"easy\" and had a great time.\n\nThe rogue powerup objects were easier to choose between, I usually have a hell of a time trying to compare marginal items etc. \n\nThe \"dungeon\" was not too expansive, there was a bit of back and forth, but I think I eventually completed the 5-level run in maybe 1.5 hours (was over the moon).\n\nThe Easy setting simplifies the attack patterns, lets you think and makes this a really good intro into the roguelike mindset. I will enjoy getting to know the items, ramping this up gradually, and powering up my player hopefully!", "timestamp_created": 1502786406, "timestamp_updated": 1502786406, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33841618": {"recommendationid": "33841618", "author": {"steamid": "76561198028127856", "num_games_owned": 135, "num_reviews": 21, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1501031357}, "language": "english", "review": "I picked this up on sale, based on the review that said it was \"better than Binding of Isaac\", my favorite roguelike, and because I am a sucker for space themes and mechs stomping around shooting everything.\n\nIt's clear from the trailer and pics that this is a bullet-hell shooter, but I wasn't prepared for just how fast it played. I died 3 or 4 times on the first level and only once had any idea what killed me. On my last attempt I had wandered into a mini-boss room without any warning (although now I know what that icon on the map on the overly cluttered hud meant) and was killed from behind by a projectile when the boss, apparently, teleported across the room.\n\nIf there had been an option to turn the game speed down by about 200%, as in AI War, I would have given this another shot. As it stands, I don't have anywhere near the reaction time needed for this and found the way the camera shifts around the mech vaguely nauseating.\n\nThough if you want punishing difficulty, extremely twitch based gameplay and like bullet hell shooters, this is probably right up your alley.", "timestamp_created": 1501190218, "timestamp_updated": 1501197191, "voted_up": false, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.431944", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33662037": {"recommendationid": "33662037", "author": {"steamid": "76561198018477976", "num_games_owned": 328, "num_reviews": 4, "playtime_forever": 1282, "playtime_last_two_weeks": 0, "last_played": 1501553711}, "language": "english", "review": "The best $3 I've ever spent on Steam", "timestamp_created": 1500509403, "timestamp_updated": 1500509403, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.498964", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33113696": {"recommendationid": "33113696", "author": {"steamid": "76561198029101373", "num_games_owned": 43, "num_reviews": 10, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1498966042}, "language": "english", "review": "Why do people keep on making roguelites with scarce health?\nRoguelites are fun as long as they do ANYTHING BUT THAT.\nThere's a perfectly good reason why this is bad.\n\nSay that the player has 10 health, gains 1 health every 4 rooms, but loses 1 health every 3 rooms.\nWill the player be thinking \"Wow, that was a tough fight, but I made it!\" at any point?\nNo, because everything is so weak that it's rarely damaging the player at all, let alone single-handedly life-threatening.\nEverything will seem like a pushover.\nAnd yet despite this, the player will eventually lose because although they get hit rarely, they get healed even more rarely.\n\nSo, a long game with scarce health can seem too easy yet be too hard at the same time; and if it isn't too hard, then it will seem way too easy. If the game seems adequately challenging, then the player will lose in only a few minutes.\nThis is the absolute worst way to balance a game's difficulty, and I do not believe there is a game in existence that is better for having done this, yet thousands have.\n\nCould this easily be fixed?\nYes, just make everything more lethal, but make shields way better.\nSay that the player has 10 health and 10 shield, but gets hit an average of 8 times per room.\nWill the game feel challenging at first? Yes, they'll often be losing a good chunk of their total health pool.\nWill the game continue to feel challenging? Yes, because obviously the maximum number of times they'll get hit in a single room will be higher if the average is higher, so it's entirely possible for a single room to kill a player outright; whereas if the player rarely gets hit more than once in a room, it's unlikely that there'll be a room that hits them enough to take them from full health to zero.\nBut health shouldn't be pure shields, because otherwise the only rooms that matter are ones that are likely to kill the player outright. If health is 50% shields, then to matter in any way, a room must be at over 50% as lethal as a room that kills the player outright; and that seems perfectly reasonable.\n\nCurrently, health is 9% shields, so a room that over 9% as lethal as a room that kills the player outright will end up doing lasting  damage.", "timestamp_created": 1498968265, "timestamp_updated": 1498968265, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.314174", "comment_count": "17", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33060185": {"recommendationid": "33060185", "author": {"steamid": "76561198025190884", "num_games_owned": 245, "num_reviews": 4, "playtime_forever": 104, "playtime_last_two_weeks": 19, "last_played": 1514075446}, "language": "english", "review": "This game is a lot of fun. It feels a lot like Binding Of Isaac (Which is not a bad thing.) with the addition of fun space designs and less poop, which is fine with me. The varying character types can also make the game very interesting. It can be a little hard to parse what is going on onscreen, but for the most part it is clear. I would definitely recommend it.", "timestamp_created": 1498865318, "timestamp_updated": 1498865318, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31941211": {"recommendationid": "31941211", "author": {"steamid": "76561198025461832", "num_games_owned": 497, "num_reviews": 125, "playtime_forever": 27, "playtime_last_two_weeks": 0, "last_played": 1495659207}, "language": "spanish", "review": "Es increíblemente feo y el interfaz es pequeñísimo y no parece haber manera de agrandarlo (juego desde el sofá).\n\nEl gameplay no está mal, los patrones de balas son interesantes, pero entre el interfaz y los terríblemente bajos valores de produccion no creo que lo vaya a jugar mucho.", "timestamp_created": 1495659588, "timestamp_updated": 1495659588, "voted_up": false, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.508125", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31881804": {"recommendationid": "31881804", "author": {"steamid": "76561198057772494", "num_games_owned": 59, "num_reviews": 6, "playtime_forever": 630, "playtime_last_two_weeks": 0, "last_played": 1496428877}, "language": "english", "review": "Starward Rogue!\nWhere should I start? Well the game has some unique mechanics, and you really feel like you're progressing each minute. The graphics are not that bad, and the game in generall is just fun to play. The combat and gunshots all over your screen is probably the best part of the game, and the music just fits with all of that. The music also fits the \"space\" theme. Another key point is that the game has some great boss fights, and you always feel awarded when you finish a new boss!\n \nPros: \n+ Epic Music\n+ The graphics just fits in terms of theme and combat. In my opinion, it looks really pretty, and cool. \n+ There are different \"classes\" to choose from. \n+ The achievements in this game looks cool, and are probably a challenge to gather. \n+ The game has functions where you can sprint, but also slow down. Makes it easier to dodge bullets, but also to get around the map quickly. \n+ Each bosss have different attack patterns, which gives a nice variation to the game. However, you can get used to them. Still very challenging though. There are also different diffuculties that you can choose from to make it even harder. I personally find \"easy\" rather challenging :^)\n+ I always feel like I'm progressing, and the game is just super fun once you get items. \n+ The game works greatly with a mouse and a keyboard :)\n+ A very good feauture of the game, is that it has a lvling system, which can help you out if you're having bad RNG. \n\nCons: \n- The graphics might not be for everyone. \n\nOverall I think this game is great, if you like \"space\" themed roguelikes, and the game nice to play. The most important thing about this game is that it is super FUN!", "timestamp_created": 1495369800, "timestamp_updated": 1495369800, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.506433", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30732689": {"recommendationid": "30732689", "author": {"steamid": "76561198013076071", "num_games_owned": 153, "num_reviews": 18, "playtime_forever": 849, "playtime_last_two_weeks": 0, "last_played": 1506978508}, "language": "english", "review": "Good action, tons of items and powerups, but easy to understand.", "timestamp_created": 1490464526, "timestamp_updated": 1490464526, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30236400": {"recommendationid": "30236400", "author": {"steamid": "76561197971645460", "num_games_owned": 194, "num_reviews": 80, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1503193713}, "language": "english", "review": "There came a time a while back when I burned out on The Binding of Isaac and started looking around for a similar game to fill the void, to make up for the fun I used to have with that game.  After long consideration and playing a LOT of mediocre games (and some very few great ones, such as Deathstate), if I were to have to pick just one game to take Isaac's place, it would be the vastly-underrated Starward Rogue, which combines bullet hell shmups and a sci-fi setting with Isaac-like trappings to great effect.\n\nThere are lots of games that try to mimic the formula Isaac pioneered, that of a roguelite with random item drops that you clear room by procedurally-generated room (with occasional shops, secret rooms, and minibosses).  Starward Rogue sets itself apart as one of the good ones by its respect for the player's time.  Put simply, Starward Rogue likes you, and wants you to have fun with your time.  In places, it even surpasses its inspirations.\n\nToo often, lesser Isaac-likes perhaps inadvertently focus on the brutal item RNG that makes Isaac a pain at times.  Item pools in these games are full of neutral or actively bad picks, leading to frustration when you don't get items conducive to a winning run.  Conversely, the good picks synergize so well that a win is basically completely assured when you get the right roll of the dice.  Player skill serves only to increasingly turn what would have been losing runs into merely boring slogs.  Starward Rogue's item pool, however, is much more tempered.  It's full of meaningful choices between good items, with nothing actively bad outside of a selection of optional, secret items designed for challenge runs.  I'm not even sure if \"bad\" is the right way to describe these items, since they all change the game quite dramatically upon pickup, often giving an entirely different experience.  The vast majority of items are passive upgrades, but you also have a good selection of primary weapons, energy weapons, missile launchers, one-time consumables, and one-at-a-time passive attachments to choose from.  It cannot be overstated how much this goes toward ensuring that every single run is enjoyable and feels empowering, giving you choices while retaining the RNG in a way that ensures the game's longevity.  You're never stuck feeling ripped off when an upgrade or weapon appears.\n\nWhereas Isaac will routinely and literally lock you out of the fun by not giving you keys to open treasure rooms, Starward Rogue bears no such grudges.  You get a choice of powerups with every level up, simply by killing enemies and finding XP drops.  Not leveling fast enough?  You can purchase XP at shops for a small fee, no matter their other stock.  And even though keycards are a thing in this game, and there are plenty of locked doors, it never feels like you're being stonewalled out of the actual experience of the game by these doors, because there are also plenty of items and shops unlocked out in the open for you.  This leads to a very nice balance where the player is still carefully considering what to spend keycards on, but is never entirely blocked from enjoying the thrill of finding cool new items and stores.\n\nStarward Rogue is not coy about telling you what you need to know.  Item descriptions are well-written and concise, conveying the necessary information to make good choices without any real trial and error.  The map (along with the colors of door frames, and tooltips when you stand next to locked doors) tells you what rooms are beyond the doors of your current room, preventing you from walking blind into a miniboss or spending precious keycards only to find out it's not a shop you wanted.  In most games like this, you have a tab open in a web browser so you can look up item descriptions and what certain rooms do, even as a veteran player.  Not so, here.  This is an incredibly considerate set of design choices, again contributing to the overall feel that the player is choosing their path and directing their run to a certain extent.\n\nThe game's variable difficulty is also much appreciated.  This is not a game that wants to shut anyone out, providing Easy and Very Easy difficulties to allow inexperienced players to gain skill gradually.  On the flipside, Normal, Hard, and Misery difficulties provide a level of challenge fit for any danmaku nerd with a string of 1CCs around their belt.  At time of writing, Misery's description reads that it is in the process of development, but the difficulty is selectable (and brutal).  This may be a potential oversight.\n\nWhereas many Isaac-lites provide a sizeable roster of characters that are largely the same and do not change the overall playstyle of the game, Starward Rogue's roster is small at 7 characters, but highly varied in style.  While weapons, attachments, and powerups are customizable, several of these mechs have built-in properties that change the way the game is played fairly dramatically.  Redshift is by far the coolest of these, in my opinion, turning the game into Superhot (where time only moves when you move or shoot).  But there's also the Humble mech, with money-powered weapons, or the Indigo mech, which uses barrier mines and magnetic missiles.\n\nWorth mentioning are two big quality of life features that reflect the overall design philosophy of respect for the player: the dash and the teleport pads.  Every mech has the ability to run MUCH faster by holding down a button (LT on an Xbox controller by default), which is not only useful in combat to outrun enemies and bullets from time to time, but also extremely great as a time saver when backtracking through cleared rooms.  Teleport pads are also included throughout each floor, networked together.  So, for example, if you're a few rooms before the boss and realize you want to check out the inventory of that shop you found earlier again, you don't have to run all the way there and back again.  You can just teleport around in a big loop until you get to where you need to be, very quickly.  Together, these features completely eliminate tedious backtracking, leading to a much better pace.\n\nFinally, we come to the core gameplay, and what's here is a treat.  At its heart, the game is a bullet hell shoot-em-up with roguelite RPG elements.  Enemies and bosses fire large, beautiful patterns that must be dodged in tight spaces, often with minimal player movement.  There are hazards in the rooms themselves, such as lasers, spikes (shards of glass? it's hard to tell), and mines, that must also be avoided while fighting.  For veterans of either danmaku STGs or Isaac-likes, Starward Rogue provides a very welcome twist on those genres.  Enemies have good amounts of health to let you enjoy shooting them and dodging their patterns, without feeling like bullet sponges.  It should be said that this game avoids many of the common pitfalls of Isaac-likes, by drawing its controls and game feel directly from twin-stick shooters.  So, no pulling a trigger button and messing up your aim every time you fire, and your shots are chunky enough that you don't need to be pinpoint accurate for the most part.  This is a carefully-tuned game on all counts, and they've absolutely nailed the game feel.\n\nThe soundtrack is excellent if you enjoy EDM, though it bears mentioning that there are only like, 3 tracks, maybe 4.  They really bump, but they might get repetitive to some players.  The graphical style is crisp and clean, with nice bright bullets that make shooting and dodging intuitive.  If I have one complaint here, it's that there's not much animation to any of the models.  Boss intros in particular are kind of hilariously lackluster, just a still sprite that zooms in toward the camera for a second and then you're in the fight, serving to undercut the tension of the coming battle.  But, you can't have it all, I suppose.  It's such a carefully-balanced and fun game, I can't help but forgive it its few flaws.  \n\nSTRONGLY recommended!", "timestamp_created": 1488270970, "timestamp_updated": 1488322105, "voted_up": true, "votes_up": 29, "votes_funny": 1, "weighted_vote_score": "0.753715", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30034160": {"recommendationid": "30034160", "author": {"steamid": "76561197987077975", "num_games_owned": 286, "num_reviews": 8, "playtime_forever": 193, "playtime_last_two_weeks": 0, "last_played": 1496374464}, "language": "english", "review": "Pretty decent roguelike. Absolutely LOVE the mech that stops all time when it stands still.", "timestamp_created": 1487509200, "timestamp_updated": 1487509200, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29884815": {"recommendationid": "29884815", "author": {"steamid": "76561198093363183", "num_games_owned": 459, "num_reviews": 178, "playtime_forever": 132, "playtime_last_two_weeks": 0, "last_played": 1502086253}, "language": "english", "review": "Controls are fine and everything and it has nice bullet patterns, but I just don't find the game engaging and fun.  Sound effects are just kinda meh.  Primary gun sounds like something from the old NES days.", "timestamp_created": 1486940026, "timestamp_updated": 1486940026, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.498448", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29051132": {"recommendationid": "29051132", "author": {"steamid": "76561198147612184", "num_games_owned": 189, "num_reviews": 35, "playtime_forever": 16794, "playtime_last_two_weeks": 1311, "last_played": 1514231566}, "language": "english", "review": "Starward Rogue is a top down shooter roguelike similar to Binding of Isaac.\n\n[h1]THE PROS[/h1]\n\n- difficult, but fair\n- rooms are handcrafted, so deaths are never RNG's fault\n- decent amount of items, mostly stat upgrades or similar\n- variety of bosses, most have 2+ patterns\n- dodging feels great\n- enemy bullet speed is slow enough to dodge, making more precise patterns more possible\n- 5 difficulties to play\n- MOST characters are balanced\n- very replayable\n- save and quit feature\n- developers are active within the community\n- etc\n\n[h1]THE CONS[/h1]\n\n- Humble is a VERY broken character, the right click ( energy weapon ) depletes boss health way too fast\n- runs are LONG (1+hours)\n- some bosses have too much health ( such as the dark [whatever it's called] )\n- I have found numerous bugs ( though the game is polished, trust me )\n\n[h1]OVERALL[/h1]\n\nI can see myself playing this for a good chunk of time! very fun even if there's a few cons!\n\n9.3/10\n\nEDIT: the update ruined the game, review will be negative until this game is fixed\n\nEDIT 2: the game has been fixed it looks like!", "timestamp_created": 1483674280, "timestamp_updated": 1484084198, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.541020", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28961335": {"recommendationid": "28961335", "author": {"steamid": "76561198066685954", "num_games_owned": 71, "num_reviews": 9, "playtime_forever": 710, "playtime_last_two_weeks": 0, "last_played": 1504707798}, "language": "brazilian", "review": "eu recomendo", "timestamp_created": 1483403714, "timestamp_updated": 1483403714, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28910160": {"recommendationid": "28910160", "author": {"steamid": "76561198087062700", "num_games_owned": 123, "num_reviews": 17, "playtime_forever": 723, "playtime_last_two_weeks": 0, "last_played": 1511024361}, "language": "english", "review": "This is the type of game I enjoy. Multiple weapons, multiple ways to proceed, oceans of baddies, enough weird bullets to fill a screen but also a way to navigate them; there's quite a bit to like here. \n\nFor play, you have 5 main areas to try to make your way through, and you have different starter options to choose from. Want a flame thrower type weapon to start with? It has you covered. Like precision with your morning coffee? You're set, too. Each begins with a specific weapon set and some ability differences, and they also begin with a different variation of your special weapon types. \n\nSomething I also like here is not being limited when it comes to bullets, at least on your main weapon. i personally like to keep firing, just like the enemies do, and this allows me to do so. Additionally, you have special items like missiles, tactical nukes, and lasers that also make the grade. \n\nThe coloration is nice to watch as well, and it makes for an interesting play-through experience. It took me a little while to find something I wanted like this, and I'm personally glad I picked this up.", "timestamp_created": 1483292071, "timestamp_updated": 1483292071, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500402", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28881083": {"recommendationid": "28881083", "author": {"steamid": "76561198079093735", "num_games_owned": 2, "num_reviews": 46, "playtime_forever": 573, "playtime_last_two_weeks": 0, "last_played": 1483042837}, "language": "english", "review": "Solid Rogue-Like SHUMP.", "timestamp_created": 1483216227, "timestamp_updated": 1483216227, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.445774", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27660536": {"recommendationid": "27660536", "author": {"steamid": "76561198284369612", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 823, "playtime_last_two_weeks": 0, "last_played": 1480164667}, "language": "schinese", "review": "游戏素质非常不错，是一款地牢类游戏。\n    \n       我一向不喜欢玩地牢类游戏的，因为这类游戏有一个非常让人恶心的问题——严重看脸。但我如此喜欢《Starward Rogue》此游戏的原因就是它不是很靠运气，无论是成就中的完美击败boss（不允许用任何特殊武器，只能平A并不可损血），还是各种武器的限制，都表明了其需要一定的操作而不是完全看脸拿牛逼装备。而且very easy难度下也能拿到成就哦。\n\n优点：1.画面好，比较精致。\n          2.身为地牢游戏不是很靠运气（高难度下除外）。\n          3.弹幕非常炫酷，敌人弹幕种类多，变着花样来搞你，躲得非常爽，贼带感。\n          4.游戏里的武器装备和状态装备多样化，每次拿到牛逼装备以为自己无敌的时候，总会被莫名其妙搞[spoiler]（very easy难              度下你就真无敌了）[/spoiler]。\n          5.人物种类多，各有特色。[spoiler]（最后一个人物帅炸了好吗！时间掌控者，只要你不动，一切都会静止。不过也有机会在游戏中拿到一样效果的装备，刷成就标配）[/spoiler]\n\n\n缺点：音乐单一，不带感。\n\n\n我从不喜欢地牢类游戏，但此游戏除外。", "timestamp_created": 1480166715, "timestamp_updated": 1480166715, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27516592": {"recommendationid": "27516592", "author": {"steamid": "76561198071839521", "num_games_owned": 1576, "num_reviews": 11, "playtime_forever": 503, "playtime_last_two_weeks": 0, "last_played": 1495916834}, "language": "english", "review": "Underrated Hidden Gem. Very addictive , great game mechanisms and design. Stands out from most similar games.\nHighly Recomended", "timestamp_created": 1480098333, "timestamp_updated": 1480098333, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523316", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27309474": {"recommendationid": "27309474", "author": {"steamid": "76561198011548001", "num_games_owned": 252, "num_reviews": 34, "playtime_forever": 98, "playtime_last_two_weeks": 0, "last_played": 1480018834}, "language": "koreana", "review": "Easy 모드로 파이널 보스 한번 잡고 쓰는 평가\n\n\n장점\n독특한 탄막\n5단계 난이도 조절\n\n단점\n개성이 부족한 무기와 특성들\n\n\n추천 주기엔 애매하지만 중립이 없으므로 추천", "timestamp_created": 1480019568, "timestamp_updated": 1480019568, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26986370": {"recommendationid": "26986370", "author": {"steamid": "76561198263110717", "num_games_owned": 142, "num_reviews": 8, "playtime_forever": 236, "playtime_last_two_weeks": 0, "last_played": 1510349556}, "language": "english", "review": "It's like Binding of Isaac bullet hell in space... sorta. I really like this game. There's so many items to collect and buy, and some fun bosses. There's even an option to play the game like Superhot, where time only passes when you move.", "timestamp_created": 1479953176, "timestamp_updated": 1479953176, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26932440": {"recommendationid": "26932440", "author": {"steamid": "76561198002627327", "num_games_owned": 702, "num_reviews": 28, "playtime_forever": 233, "playtime_last_two_weeks": 6, "last_played": 1513838398}, "language": "english", "review": "A criminally overlooked masterpiece. Starward Rogue is an icredibly well-made rogue-lite bullet-hell in the vein of Binding of Isaac. Only with robots.", "timestamp_created": 1479941723, "timestamp_updated": 1479941723, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.532840", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26900104": {"recommendationid": "26900104", "author": {"steamid": "76561198071366461", "num_games_owned": 304, "num_reviews": 13, "playtime_forever": 883, "playtime_last_two_weeks": 0, "last_played": 1479937300}, "language": "spanish", "review": "Si gustas de juegos rapidos, donde cada partida no es igual a la anterior, y por lo mismo, un nuevo desafío, deja de buscar que aquí encontrarás un tesoro.\n-Excelente mecánicas: Desde el diseño de cada personaje jugable hasta cada enemigo. Brinda un toque único a cada partida.\n-Buena Música: ¿Que mejor que esquivar balas y matar robots diabólicos con una buena banda sonora?\n-Desafío constante: Aquí me quiero detener, ya que el juego me recordó a los primeros juegos japoneses de naves, donde esquivar balas, disparar y no morir de epilepsia eran un logro poco común.\n-Un bullet hell digno, nada más que agregar\n\nContras:\n-El Hud y el Gui a veces se hacen un poco tediosos\n-Si no tienes tolerancia a la frustración, o perder un buen run ... :(\n-Drops de fps en pantallas de carga", "timestamp_created": 1479937144, "timestamp_updated": 1479937188, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26737611": {"recommendationid": "26737611", "author": {"steamid": "76561198291652285", "num_games_owned": 60, "num_reviews": 2, "playtime_forever": 643, "playtime_last_two_weeks": 0, "last_played": 1509297538}, "language": "english", "review": "This game is AWESOME. Really infuriating, but awesome.\n\nPros: \n+ cool graphics\n+ cool music\n+ good gameplay\n+ cool story line\n+ good voice acting\n+ You're a disembodied space dragon head in a robot suit and you get to run around a giant space station sticking out of the side of a star and kill things with missile launchers\n\nCons:\n- Too hard!!!\n- Too many different enemies\n- Enemies have weird names\n- wish the music had more variety\n- Where'd Rodney go?\n- No ending!\n- Some minibosses are way too overpowered\n- No alternate gamemodes", "timestamp_created": 1479763238, "timestamp_updated": 1479763238, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523316", "comment_count": "6", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26726262": {"recommendationid": "26726262", "author": {"steamid": "76561198147488050", "num_games_owned": 552, "num_reviews": 213, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1479709516}, "language": "schinese", "review": "打折入的然后我选择退货，可能是因为玩过以撒所以觉得这作品不如以撒有趣，加上作为一个弹幕游戏随机起来就是无死角弹幕？？？太看脸加上英文道具看得很累，模式跟以撒是差不多的，可能也有喜欢的人吧，但是我就是不喜欢这个画面和操作，轻轻点都走的滑方向键难以微操。。。", "timestamp_created": 1479705420, "timestamp_updated": 1479709781, "voted_up": false, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.399785", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26675307": {"recommendationid": "26675307", "author": {"steamid": "76561198002416419", "num_games_owned": 109, "num_reviews": 13, "playtime_forever": 168, "playtime_last_two_weeks": 0, "last_played": 1489076036}, "language": "english", "review": "I havent played alot, but it is pretty fun so far and about what you would expect for a rouge-like twin-stick shooter. In their description it says rouge lite which implies, to me at least, after deaths you can improve your charachter or there are permanent buffs to be found that last through your multitude of deaths. This doesn't seem to be the case. The only lite part I can see is the difficulty levels which if you throw on easy or super easy you can progress through the game without too many difficulties. \n\nThere are a ton of different perks and other things you can buy with health or money which is pretty cool, and the bosses I have fought so far were fun.  There doesn't seam to be much of a story that I have found, but gameplay is good and it works pretty well with both a controller or keyboard and mouse. If you are using a controller I would suggest to use a weapon that doesn't require precise aiming unless you grew up playing games on controllers.", "timestamp_created": 1479489104, "timestamp_updated": 1479489104, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26622192": {"recommendationid": "26622192", "author": {"steamid": "76561198018568143", "num_games_owned": 616, "num_reviews": 52, "playtime_forever": 810, "playtime_last_two_weeks": 0, "last_played": 1489962532}, "language": "french", "review": "Ce jeu est un excellent action-roguelike/bullet-hell, voire roguelike tactique avec un des méchas disponibles ^^ Vraiment intéressant, avec une bonne rejouabilité et des styles de jeu très différent selon le mécha.", "timestamp_created": 1479249247, "timestamp_updated": 1479249247, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.548429", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26621247": {"recommendationid": "26621247", "author": {"steamid": "76561198128554739", "num_games_owned": 248, "num_reviews": 53, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1479162156}, "language": "russian", "review": "Геймплей айзека только на порядок зубодробительнее, сложнее и в сайфи сеттинге.\nЛично мне - нифига не понравилось, неоновщина, дерганность геймплея, флэшевость анимации этакая.", "timestamp_created": 1479244479, "timestamp_updated": 1479244479, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.381280", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26564901": {"recommendationid": "26564901", "author": {"steamid": "76561197972849454", "num_games_owned": 342, "num_reviews": 3, "playtime_forever": 2810, "playtime_last_two_weeks": 0, "last_played": 1481857121}, "language": "english", "review": "I have little tolerance for rouge like games because I hate losing everything I’ve worked to get. However, the designers of this game struck a very good balance between that and giving you a fair chance.  When you die, it sucks but you don’t feel like you were screwed.\n\nThe more I play the more nice touches I notice:\n[list]\n[*]You can exit the game and come back to your exact location if you are in the middle of a run and need a break.\n[*]Directional door and item graphics pop up on the edge of the screen when you’ve cleared a room.\n[*]If you are low on health and left some in another room, you can see which room has it on the mini-map.\n[*]Display scaling…a game designer that accommodates a player’s desire for how large to make items on a screen should be rewarded.\n[/list]\n\nThis ‘not normal for me’ game is excellent. The price for admission was worth the price and I’m glad I purchased it.", "timestamp_created": 1478977173, "timestamp_updated": 1478977173, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.630650", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26193459": {"recommendationid": "26193459", "author": {"steamid": "76561198007513026", "num_games_owned": 534, "num_reviews": 209, "playtime_forever": 826, "playtime_last_two_weeks": 0, "last_played": 1477712089}, "language": "english", "review": "Fun rogue-like bullet hell shooter. \n\nIt took me a bit of time to figure out what was going on since I'm not great at this type of game. But once I started figuring things out it turned out to be a lot of fun. Lots of variety, good graphics. Well worth the modest price.\n\nUpdate - I've given up on the game, it got to be too repetitive. Also, I really disliked the levels with lasers and other traps that you have to pick your way through. They take far too much time and don't fit with the game style. Still worth playing but a bit of a disappointment. With more variety they could have had an Binding of Isaac competitor.", "timestamp_created": 1477281502, "timestamp_updated": 1477712235, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525031", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25604446": {"recommendationid": "25604446", "author": {"steamid": "76561197993639644", "num_games_owned": 684, "num_reviews": 24, "playtime_forever": 2556, "playtime_last_two_weeks": 17, "last_played": 1513812189}, "language": "english", "review": "Genuinely wasn't sure about this game despite Arcen's other games (almost) universally being amazing and really wanting to see the story of the Last Hydral continue.\n\nI am completely and utterly a convert, this game is joyous, I didn't like Binding of Isaac that much, Bullethell shooters look eh- to me but this game really sucked me in, just enough items and mech choices to make every run feel unique, varied achievements that let you challenge yourself with each run and interesting bosses that at first are deadly but soon patterns can be recognised that makes them merely quite hard, to say nothing of going for perfect clears of them!\n\nAccept my apologies Arcen for not buying it at full price!", "timestamp_created": 1474385269, "timestamp_updated": 1474385269, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25345532": {"recommendationid": "25345532", "author": {"steamid": "76561197996567848", "num_games_owned": 159, "num_reviews": 2, "playtime_forever": 188, "playtime_last_two_weeks": 0, "last_played": 1472925589}, "language": "english", "review": "Excellent all around! The roguelike and shmup elements are tight and full-bodied unto themselves, and they harmonize more neatly than I had dreamed was possible. There's no shortage of content and the developers go above and beyond on community and modding support (modding is accessible from the main menu and you can start runs in developer mode), so I expect this will be a favourite of mine for a long time.", "timestamp_created": 1472994789, "timestamp_updated": 1472994789, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503597", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25178194": {"recommendationid": "25178194", "author": {"steamid": "76561198315542825", "num_games_owned": 102, "num_reviews": 4, "playtime_forever": 672, "playtime_last_two_weeks": 0, "last_played": 1484921734}, "language": "schinese", "review": "你有很多种无敌的方法，但是每当你觉得自己要无敌了，你就挂了……\n\n带着玩东方的心态去玩不容易挂，而且 excited 。", "timestamp_created": 1472290851, "timestamp_updated": 1472290851, "voted_up": true, "votes_up": 2, "votes_funny": 4, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25171923": {"recommendationid": "25171923", "author": {"steamid": "76561197988110201", "num_games_owned": 1972, "num_reviews": 14, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1473268846}, "language": "english", "review": "Arcen finally show what they're capable of producing when they're not trying to stuff several hundred disparate and conflicting systems into one package. Visual and sound design fit together perfectly and even the usual Arcen font actually feels at home, for once. Some brilliantly fun bullet patterns to dodge, too.", "timestamp_created": 1472257836, "timestamp_updated": 1472257836, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503597", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25037971": {"recommendationid": "25037971", "author": {"steamid": "76561198016392886", "num_games_owned": 166, "num_reviews": 3, "playtime_forever": 8260, "playtime_last_two_weeks": 0, "last_played": 1510968497}, "language": "english", "review": "Think Nuclear Throne or Binding of Isaac with more emphasis on dodging bullets and less on aiming.\n\nPros:\nBullet hell roguelike!\nInteresting enemies\nDiverse playstyles possible\nWell executed gameplay\n\nCons:\nPlot conveyed poorly (This doesn't really interfere, as there is very little plot) \nSome balance issues\n\n", "timestamp_created": 1471718344, "timestamp_updated": 1471718344, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.530772", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24861862": {"recommendationid": "24861862", "author": {"steamid": "76561198167390552", "num_games_owned": 95, "num_reviews": 20, "playtime_forever": 2057, "playtime_last_two_weeks": 52, "last_played": 1513812685}, "language": "english", "review": "Is it just me, or are most of Arcen's games about making the robots pay?", "timestamp_created": 1471041520, "timestamp_updated": 1471041520, "voted_up": true, "votes_up": 3, "votes_funny": 5, "weighted_vote_score": "0.508135", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24793388": {"recommendationid": "24793388", "author": {"steamid": "76561198020728468", "num_games_owned": 243, "num_reviews": 54, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1497821801}, "language": "english", "review": "First, I tried to like this game. Then I tried to hate it. Then I turned to meta-arguments to justify either liking or hating it and that didn't resolve anything either. On one hand, I've given far lesser games a pass in earlier reviews. I just can't bring myself to shoot this one down. On the other hand, with so many lovingly positive reviews they can surely stand to have a downvote or two. These arguments don't even relate to the game itself. What's a man to do?\n\nThe game isn't good enough to call good, it's functional, acceptable. It's probably best described as Binding Of Isaac's younger, less interesting brother. You shoot through large numbers of enemies with a limited amount of health, acquiring upgrades as you go. Oh and there was a recent military coup in Turkey, did you hear? What else is new.\n\nVerdict: If you like BOI but really wished it was in space and had less interesting music, this is the game for you.", "timestamp_created": 1470748643, "timestamp_updated": 1470831118, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501418", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24765805": {"recommendationid": "24765805", "author": {"steamid": "76561198089128143", "num_games_owned": 123, "num_reviews": 4, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1470610637}, "language": "english", "review": "It's not the greatest game in the world or even the best game made my Arcen, but it still holds up pretty well and is a decently challenging bullet hell rogue-like. Good variety of items, enemies and bosses, not to mention the roster of selectable mechs. I got it for 6€ on sale and I don't regret it, Arcen always make games with something unique added to a typical formula.\n\nAlso, I'm not a fan of electronic/techno music but I found the soundtrack surprisingly good. Wish there was more of it :)", "timestamp_created": 1470600681, "timestamp_updated": 1470600681, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.503597", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24764302": {"recommendationid": "24764302", "author": {"steamid": "76561198095131542", "num_games_owned": 618, "num_reviews": 4, "playtime_forever": 2816, "playtime_last_two_weeks": 0, "last_played": 1485701927}, "language": "english", "review": "Another excellent game by Arcen.", "timestamp_created": 1470594870, "timestamp_updated": 1470594870, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24756059": {"recommendationid": "24756059", "author": {"steamid": "76561197983672075", "num_games_owned": 597, "num_reviews": 58, "playtime_forever": 1435, "playtime_last_two_weeks": 0, "last_played": 1500257534}, "language": "english", "review": "The best parts of [i]The Binding of Isaac[/i], Twin Stick Shooter, and a Bullet Hell/SHMUP game in one game.\n\nThere's about 5 difficulties IIRC. You can choose one of seven mechs to be. There's a \"standard\" mech that is average all around. One with a flamethrower as its main weapon. (A very fun mech especially if you get the flame trail sprint item) Others have varried weapons and stats. One of them is pretty different though: The mech \"Redshift\" is sort of like the Bard in [i]Crypt of the Necrodancer[/i] because, interestingly, time only moves when [i]you[/i] do something. So you can stop moving and shooting and take a look around. The downside is this mechs very low HP (3) which means you need to make the best out of your time control power to weave through bullets and down enemies. This mech is good for practice because you can go through the motions mostly at your own pace building muscle memory, and if you get hit then it's even more devastating.\n\nHowever you play, expect to die alot before you learn enemy patterns. This is what I'd call a good arcade style game. Each time you level up you get to pick passive perks, and you clear rooms of foes you gather credits and loot gear. There are, randomly, shops of multiple varieties to buy stuff from. There's quite a bit of gear, and what you find / buy can change your play style a fair amount.\n\nI'm enjoying it.", "timestamp_created": 1470559230, "timestamp_updated": 1470560150, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.667668", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24685090": {"recommendationid": "24685090", "author": {"steamid": "76561198023403230", "num_games_owned": 498, "num_reviews": 8, "playtime_forever": 395, "playtime_last_two_weeks": 0, "last_played": 1486158240}, "language": "english", "review": "This is one of those underlooked gems I often see from very talented indie devs.\n\nImagine Binding of Isaac mixed with TouHou. If that sounds even the least bit fun to you, you will have a ball with this game.", "timestamp_created": 1470209742, "timestamp_updated": 1470209742, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.635188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24004530": {"recommendationid": "24004530", "author": {"steamid": "76561198307181910", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 1500, "playtime_last_two_weeks": 0, "last_played": 1468548475}, "language": "english", "review": "Very good game!", "timestamp_created": 1467431205, "timestamp_updated": 1467431205, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23876639": {"recommendationid": "23876639", "author": {"steamid": "76561198053805775", "num_games_owned": 345, "num_reviews": 21, "playtime_forever": 1634, "playtime_last_two_weeks": 0, "last_played": 1506329819}, "language": "english", "review": "[table]\n    [tr]\n        [th][b]PROS[/b][/th]\n        [th][b]CONS[/b][/th]\n    [/tr]\n    [tr]\n        [td]\n+ Responsive controls (with a 'no-momentum' option and the option to intentionally move slower)\n+ Challenging and addicting gameplay\n+ Interesting boss mechanics\n+ Great post-launch support\n        [/td]\n        [td]\n- Almost non-existent plot with little to no execution\n- Unappealing graphics (as with all 2d games from Arcen)\n- [strike]Room connections sometimes force tedious backtracking[/strike] [i](addressed via \"backtracking teleporters\" as of 06.08.2016)[/i]\n- Difficulty progression needs a little work\n- Poor presentation of 'unlockables'\n- Meaningless icons in the main menu\n        [/td]\n    [/tr]\n[/table]", "timestamp_created": 1467068751, "timestamp_updated": 1470505129, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.562816", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23631099": {"recommendationid": "23631099", "author": {"steamid": "76561198025764978", "num_games_owned": 205, "num_reviews": 10, "playtime_forever": 1000, "playtime_last_two_weeks": 0, "last_played": 1501204029}, "language": "english", "review": "I'd give this game a neutral rating if I could. All in all it is a fun experience but also has some issues. Buy at reduced price, maybe:\n\n[u]Pros, Neutrals and Cons[/u]\n\n+ creative and diverse room designs\n+ lots of different weapons, items and upgrades\n+ reactive and precise controls\n+ you get to make some interesting risk-reward decisions\n+ well balanced RNG most of the time\n+ exploring\n\n~ okay visual aesthetics\n~ it's a time shredder\n\n- becomes a chore to play after a while\n- generic music\n- terrible sound design (weapons feel either puny or enervating, enemy sounds mix into horrendous cacophony)\n- uninspired bullet patterns\n- lame mini bosses (mostly they just make you run in circles really fast)\n- your mech happens to become obscenely over- or underpowered from time to time\n- challenges you get to pick up at the start of a level aren't always possible or worth it to complete\n- many \"meh\" items you probably won't use", "timestamp_created": 1466251379, "timestamp_updated": 1466251696, "voted_up": false, "votes_up": 22, "votes_funny": 1, "weighted_vote_score": "0.571450", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23498309": {"recommendationid": "23498309", "author": {"steamid": "76561198012942245", "num_games_owned": 245, "num_reviews": 16, "playtime_forever": 248, "playtime_last_two_weeks": 0, "last_played": 1471164897}, "language": "english", "review": "Great atmosphere, great soundtrack, great mechanics. The game is a nice combination of The Binding of Isaac and the bullet hell genre.", "timestamp_created": 1465634831, "timestamp_updated": 1465634831, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23399663": {"recommendationid": "23399663", "author": {"steamid": "76561198057478999", "num_games_owned": 112, "num_reviews": 14, "playtime_forever": 2174, "playtime_last_two_weeks": 0, "last_played": 1493728427}, "language": "russian", "review": "Предвзято отношусь к такого рода играм, но эта очень порадовала.\nКупил со скидкой 50%, но, думаю, не поскупился бы и на всю цену.\n\nГеймплей вкратце таков: есть локация, разделенная на комнаты. В каждой комнате свои какие-то предметы, враги, и прочее. Нужно в каждой локации убить главного босса, и тогда вы перейдете на следующую локацию. Локаций всего 5.\n\nНесмотря на кажушуюся просто, игра очень захватывает. Из предметов, которые там встречаются, можно делать неплохие комбинации. Каждое прохождение отличается от другого.\n\nЕдинственный минус - никто нам ничего не собирается объяснять. В самом начале показали очевидные вещи, и все. А остальное придется самому находить и уяснять: как использовать подбираемые предметы, что такое XFACTOR в параметрах оружия, какие эффекты дают те или иные incredibility, что будет если убить хранителя магазина. Никаких вики, даже на английском, нет. \n\nВывод: зашибись, дайте две.", "timestamp_created": 1465131638, "timestamp_updated": 1465486406, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.613991", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23393390": {"recommendationid": "23393390", "author": {"steamid": "76561198003518140", "num_games_owned": 1193, "num_reviews": 138, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1465102302}, "language": "english", "review": "I suck at bullet-hells but I have fun with them as frustrating as they are.  Like all Arcen games this one has some nice outside-the-box design concepts.  I only played for about a half-hour at this point but I can see myself coming back and playing some more as the game is very appealing.   Personally I picked up the game more as a 'Arcen fan' than anything else but for the money it is worth it even if you are not just a fan of the developer.  I am no bullet-hell expert for sure but from my short time with the game so far I would have to say that Starward Rogue is one of the better more interesting ones I have played in a good while.  I personally like the look and feel of it better than games like BoI.", "timestamp_created": 1465102557, "timestamp_updated": 1465102557, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.556253", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23342623": {"recommendationid": "23342623", "author": {"steamid": "76561198081463550", "num_games_owned": 534, "num_reviews": 21, "playtime_forever": 689, "playtime_last_two_weeks": 0, "last_played": 1469109524}, "language": "schinese", "review": "以撒、东方和科幻题材的结合体.丰富的道具和关卡房间种类，超多的boss可以挑战。就一款rogue like平面射击游戏而言，绝对值得推荐！躲子弹的感觉真是太爽了……！\n美中不足在于子弹特效的类型有些单一，道具没有以撒里那样可以产生不同的叠加效果。", "timestamp_created": 1464867667, "timestamp_updated": 1465551833, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.507447", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22919552": {"recommendationid": "22919552", "author": {"steamid": "76561197970541523", "num_games_owned": 555, "num_reviews": 3, "playtime_forever": 759, "playtime_last_two_weeks": 0, "last_played": 1499216994}, "language": "english", "review": "Fun game and an awesome Developer that dupports their games.", "timestamp_created": 1463012581, "timestamp_updated": 1463012581, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.458136", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22859978": {"recommendationid": "22859978", "author": {"steamid": "76561198028118165", "num_games_owned": 503, "num_reviews": 26, "playtime_forever": 431, "playtime_last_two_weeks": 0, "last_played": 1463016549}, "language": "english", "review": "This game is ridiculously good. Extremely cool bullet patterns (a bunch that I haven't even seen before), great enemy design, some unbelievably clever encounters and traps, a ton of fun upgrades with great risk vs reward elements, RNG that is balanced by the base mechanics so that you'll never breeze through if you aren't actually good enough, and excellent music. There are six different characters you can play and each one has vastly different abilities, creating six different ways of approaching the game. I'm having a hard time really telling you why I think this game is so good without spoiling a lot of the surprises, which is another thing I think is great. There are a lot of surprises, and they are surprising. \n\nI don't know what to tell you. There is just something so incredibly satisfying about the idea that I'm delving into this insane bullet hell to save some guy named Rodney. Not my dad Rodney, not my friend Rodney, not my dog Rodney; he's just some guy, and he's at the bottom of the tower, and I'll be damned if I'm not going to dodge ten million bullets to save his ass from whatever he's doing down there. You know? Do you know what I mean? The plot is straight out of God Hand; the game itself is so good, so fundamentally satisfying to play, that it doesn't even need a real story. Some guy named Rodney needs me to play this game? Shit, sounds good to me.\n\nThe entire experience is like Binding of Isaac on steroids, on meth, strapped into a mech made out sentient metal, and then shot into the physical manifestation of fun as it goes supernova. I don't know if I can be any more clear and emphatic about how awesome this game is.", "timestamp_created": 1462700668, "timestamp_updated": 1462700668, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.587191", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22380768": {"recommendationid": "22380768", "author": {"steamid": "76561198018288322", "num_games_owned": 200, "num_reviews": 11, "playtime_forever": 2789, "playtime_last_two_weeks": 0, "last_played": 1463963669}, "language": "english", "review": "\"SHMUP+rougelite+Arcen Games= WOW!\"\nThats about what I thought when I discovered Starward Rouge and I have not been disappointed.\n\nNice 2D graphics (similar to AI War), nice music (though some more tracks would be in order) and first of all really tight gameplay. Days certainly need more hours now.. or less work.\n\nP.S.: Would love to see an addon for the game with a few more mechs and levels.. and maybe more modes like boss rush etc. Certainly wouldn't mind to pay some $$. Keep up the great work Arcen.", "timestamp_created": 1460485648, "timestamp_updated": 1460485648, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22313893": {"recommendationid": "22313893", "author": {"steamid": "76561197968830351", "num_games_owned": 432, "num_reviews": 19, "playtime_forever": 718, "playtime_last_two_weeks": 0, "last_played": 1460187406}, "language": "english", "review": "Enjoyable roguelite game.", "timestamp_created": 1460187643, "timestamp_updated": 1460187643, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497159", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22309037": {"recommendationid": "22309037", "author": {"steamid": "76561197960865718", "num_games_owned": 961, "num_reviews": 6, "playtime_forever": 864, "playtime_last_two_weeks": 0, "last_played": 1512887293}, "language": "english", "review": "It's kind of a bummer that Enter the Gungeon will overshadow Starward Rogue, even-though it's essentially the same at it's very heart. Still, this game deserves to stand shoulder to shoulder with other great roguelikes/lites like The Binding of Isaac, Dungeons of Dredmor, Risk of Rain, Ziggurat, and others to name a few. \n\nIt has a good soundtrack, several choices of mechs to run dungeons, and ample items/weapons with varying effects. Not to mention several difficulty levels for those who are made of suck or those who have nimble fingers and reflexes. Although for me, where it really shined was during  beautifully done (mini) boss battles. Colorful bullet patterns, multi-phases, and a hell of a end game boss fight (though i havent seen the REAL boss boss).\n\nIf you like roguelikes, dungeon crawler-ish games, mechs, or bullet hell-y games, i couldn't recommend this enough.", "timestamp_created": 1460158895, "timestamp_updated": 1460248003, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502841", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22238353": {"recommendationid": "22238353", "author": {"steamid": "76561198059800975", "num_games_owned": 161, "num_reviews": 6, "playtime_forever": 501, "playtime_last_two_weeks": 0, "last_played": 1460388091}, "language": "japanese", "review": "ローグライク弾幕シューティング\nローグライク要素としては持ち込み無しで１度死亡すると最初からという内容です。\nタイムアタックでない限りは部屋を回ってアイテム回収を徹底することによってクリアしやすくなるかも？\n\n個人的にはかなり難易度が高いように思えます・・・(easyですら辛い）\nしかしパターンを覚えればボスでも簡単かもしれません。\n難しいのが好きな方は是非ともオススメです。\n\nAIwarを作っていた会社と聞いて買ってみました。\nというとDLCやMODなど、期待できる要素があると思われます。\n\n簡単なレビューでしたが、とても安く、やり込めるゲームなので是非買ってみてください。\n\n\n追記：難易度ノーマルまではチュートリアルだった・・・（絶望）", "timestamp_created": 1459786000, "timestamp_updated": 1459950213, "voted_up": true, "votes_up": 17, "votes_funny": 5, "weighted_vote_score": "0.538117", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22217378": {"recommendationid": "22217378", "author": {"steamid": "76561198096830680", "num_games_owned": 41, "num_reviews": 19, "playtime_forever": 607, "playtime_last_two_weeks": 0, "last_played": 1500596954}, "language": "english", "review": "Pros:\nTight twin stick shooter controls\n6 classes, all unlocked at the start of the game\n\nNatural:\nMore arcade feel than roguelike feel\nTechno soundtrack\nMore frantic than strategic\n\nCons:\nSoundtrack can get repetitive\nMediocre ascetics and graphics\n\nOverall a great arcade esque shooter", "timestamp_created": 1459686890, "timestamp_updated": 1459710399, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.485134", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22135505": {"recommendationid": "22135505", "author": {"steamid": "76561197993111576", "num_games_owned": 743, "num_reviews": 3, "playtime_forever": 2347, "playtime_last_two_weeks": 0, "last_played": 1510857978}, "language": "english", "review": "Arcen Games does Strange Things. They do Good Things. They do Fun Things.\n\nThey are not a big corporation, and I doubt they ever will be, because they most of all do Unsafe things.\n\nStarward Rogue is, functionally, much like Binding of Isaac; But whereas most games look at Binding of Isaac and say 'Okay, let's basically make it like that', this game took Binding of Isaac far beyond what it should be. The characters are very, very different- One of them even turns the game into a Frozen Synapse-esque strategy, with the action only moving when you do. The controls are crisp and ultra-responsive. Unlike Binding of Isaac, I have never had a moment where I ran into something because the character was moving like they were on a patch of ice- Except for that one game where I picked up the item that specifically makes your sprint movement faster, and slippery. Controls are completely amazing.\n\nThe vast breadth of items and monsters makes the game hugely fun. There are tons of different items, and enemies, and each enemy works in a different way. The roguelike bullet hell is endlessly entertaining, always throwing new challenges at you. Bosses aren't AS varied, but there are twenty of the damn things, each one of which is very unique in its fight style, and insanely fun. The items vary from simple passive boosts to the vast variety of different primary and secondary weapons, which encouage different gameplay styles.\n\nIt's insanely fun. It is definitely worth more than 12 dollars. And Arcen Games needs your help, because they do strange things that don't slot easily into other people's labels. They deserve to be rewarded for doing something that is not only different, but amazing.", "timestamp_created": 1459309118, "timestamp_updated": 1459309118, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.603083", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22117085": {"recommendationid": "22117085", "author": {"steamid": "76561197979851880", "num_games_owned": 281, "num_reviews": 10, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1459224766}, "language": "english", "review": "Starward Rogue is a shoot-em-up/bullethell rogue-lite that is often compared to Binding of Isaac or even Nuclear Throne.  It is fun, fast-paced, graphically well-polished and unique, with a lot of customization options and smooth, fair controls.  A good coffee-break sort of game that is easily played in short bursts, or as long as you like.\n\nYour goal is to clear a dungeon room-to-room, floor-by-floor, using your primary weapon with infinite ammo; your secondary weapon that uses energy that refills every time you (re-)enter a room; your finite supply of missiles; findable modules that give unique passive effects or abilities; 1-shot uber consumables; and your ability to WASD-dance your way between a hail of living, oft-unpredictable bullets.\n\nYou can find or purchase power-ups, health restoration pick-ups, ammo for your missile launcher, new weapons for your primary and secondary slots (which can be a HUGE boon in either case), etc.\n\nYour choice of class at the start of a run can have a huge impact on your run based on their various strengths and weaknesses and starting weapons, but once you start picking up new weapons and power-ups, the character you started with may be a different one entirely from the one you die a painful death as. :D\n\nYou will lose.  A lot.  But this game is fast-paced--you can rest between clearing rooms, though--and fun, and death never really feels unfair.  The wide selection of difficulty levels also ensures you'll always be able to have a good time, as well.\n\nHighly recommended either for casual fun, masochistic self-harm, or anything in-between.", "timestamp_created": 1459221011, "timestamp_updated": 1459221058, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.499465", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22082592": {"recommendationid": "22082592", "author": {"steamid": "76561198139594323", "num_games_owned": 223, "num_reviews": 26, "playtime_forever": 487, "playtime_last_two_weeks": 0, "last_played": 1462705893}, "language": "english", "review": "Good roguelike( i know technicly its a roguelite) dungeoncraweler-bullethellgame", "timestamp_created": 1459078131, "timestamp_updated": 1459078131, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21735887": {"recommendationid": "21735887", "author": {"steamid": "76561198022984861", "num_games_owned": 135, "num_reviews": 11, "playtime_forever": 12, "playtime_last_two_weeks": 0, "last_played": 1457557063}, "language": "english", "review": "(This is a review for only a brief play)\n\nI love high-energy twin-stick shooters but this game just lacks.. something. I can't pin it down, but it is hard to feel attached to the character, or it's attacks.. it's just all.. floaty.", "timestamp_created": 1457557409, "timestamp_updated": 1457557409, "voted_up": false, "votes_up": 9, "votes_funny": 2, "weighted_vote_score": "0.257697", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21538591": {"recommendationid": "21538591", "author": {"steamid": "76561198125313447", "num_games_owned": 243, "num_reviews": 3, "playtime_forever": 422, "playtime_last_two_weeks": 0, "last_played": 1457565164}, "language": "english", "review": "Just started playing but looks great so far, tons of items, xp system, weapon variety, etc.", "timestamp_created": 1456713900, "timestamp_updated": 1456713900, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21516972": {"recommendationid": "21516972", "author": {"steamid": "76561197984661297", "num_games_owned": 659, "num_reviews": 1, "playtime_forever": 998, "playtime_last_two_weeks": 0, "last_played": 1484293167}, "language": "english", "review": "If you're looking for a sci-fi roguelike bullet hell this is it.\n\nEverything is randomly generated complete with random shops and secrets.\n\nThere's 6 different mechs to choose from, each with their little quirks and perks.\n\nYou'll battle your way through levels fighitng bosses at the end of each hoping to make it to the end. There's a nice level up system of 1 of 3 random upgrades each time you level up and there's chances to pick up powerups and different weapns as you play through.\n\nThere's a large enemy variety as well and it'll certainly keep you on your toes as each enemy has different attack patterns and some can be quite daunting to avoid.\n\nThere's also a lot of replayablity as well and you'll find yourself once hooked playing more than you should.\n\nControls are also perfect and customisable, which is certainly welcome and can be played with a controller or keyboard and mouse.", "timestamp_created": 1456640802, "timestamp_updated": 1456640802, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21515840": {"recommendationid": "21515840", "author": {"steamid": "76561198009671381", "num_games_owned": 944, "num_reviews": 199, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1456613736}, "language": "english", "review": "It's a good one.", "timestamp_created": 1456635199, "timestamp_updated": 1456635199, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.485437", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21380554": {"recommendationid": "21380554", "author": {"steamid": "76561198069879270", "num_games_owned": 168, "num_reviews": 10, "playtime_forever": 3274, "playtime_last_two_weeks": 57, "last_played": 1513211735}, "language": "english", "review": "Exellent. With a capital E. The only flaws I can see are these: Story, which has been mentioned before on the forums, and arcen says they're aware of the lack in story and are working on that so it's not a concern. Items. There aren't that many things that switch things up a lot. Yes, there's the incredibilities, but i'm talking about something like mom's knife of brimstone from TBOI. Something less normal than, say typical glass cannon aka risky assassin. Finally, rear-burst turrets. They seem like a cool idea. Turrets that shoot bullets behind you which explode into more bullets sounds neat but they easily snipe with the extremely fast bullets that then explode, thus creating the bane of anyone who took risky assassin, which removes shields and reduces you to 1 health, thus causing anything that hits you instakill you. 1 health + nigh-unavoidible damage = ragequitting. I haven't mentioned any good things about this game yet, which is because everything else is exellent, however i'll go over the best things in this fantastic game here. Updates. Updates and bugfixes come faster than holidays, even more so if you don't count every obscure holiday you can think of(or look up on google). Enemy variety. The enemies aren't typical \"flying thing that shoots bullets\"esque tropes. Laser boomerangs? Check. Slow bullets that shoot fast but short range bullets behind them? Check. Bosses that use intricate bullet patterns to create a maze and then spawn minions that use slow-moving bullets to hinder your movement even more? Check. Difficulty.  The difficulty settings range from \"Literally like 3 minutes of standing still for a boss to kill you\" to \"5 hits with bullet patterns that Touhou would be scared of\". Anyhow, I give Starward Rogue 8.5/10 for an exellent roguelike.", "timestamp_created": 1456121581, "timestamp_updated": 1456121581, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503597", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21371469": {"recommendationid": "21371469", "author": {"steamid": "76561198053911950", "num_games_owned": 107, "num_reviews": 3, "playtime_forever": 2254, "playtime_last_two_weeks": 0, "last_played": 1479156442}, "language": "english", "review": "This is an incredibly fun and well executed game.  I have no idea why the sales are as poor as the publisher says they are, but....  I can't think of another game like it, and I rarely go back to games and play them after I own them....\n\nThis is one.  A solid rogue-like bullet hell.  Difficulty is pretty spot on in normal, and I enjoyed my playthrough thoroughly.", "timestamp_created": 1456082722, "timestamp_updated": 1456082722, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21355203": {"recommendationid": "21355203", "author": {"steamid": "76561197986028630", "num_games_owned": 445, "num_reviews": 3, "playtime_forever": 596, "playtime_last_two_weeks": 0, "last_played": 1484613670}, "language": "english", "review": "Starward Rogue is a very interesting title. For a lover of roguelikes and 2d Snes era action games like Megaman X and U.N. Squadron this game is a must. It offers plenty of variety, although I do wish missle launchers spawned in shops and crates more often, i've only encountered 2 in my 7 hrs of playtime. It is very fast paced and engaging, my brain always feels drained when I inevitably ragequit after getting killed by the last boss again :)\n\nOne of these days i'll kill the SOB and figure out who or what rodney is.", "timestamp_created": 1456026009, "timestamp_updated": 1456026009, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21269547": {"recommendationid": "21269547", "author": {"steamid": "76561198004165872", "num_games_owned": 204, "num_reviews": 2, "playtime_forever": 676, "playtime_last_two_weeks": 0, "last_played": 1506398832}, "language": "english", "review": "As always fantastic game by arcen", "timestamp_created": 1455695995, "timestamp_updated": 1455695995, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21269002": {"recommendationid": "21269002", "author": {"steamid": "76561197999459859", "num_games_owned": 344, "num_reviews": 3, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1457553002}, "language": "english", "review": "I haven't put a lot of time into this game yet, but not for lack of wanting to. Excellent bullet hell. I don't tend to care for this genre, BoI and I don't really see eye to eye, but the controls in this one are crisp and responsive, and I always feel like I can learn something from each death I take. Whether it's \"slow down and stop running over spikes\" to \"maybe next time you shouldn't trade your shield for health\" I never feel like the game cheated to kill me. I just cheated myself. Excellent game, and I hope sales are great so that Arcen can make more good games.", "timestamp_created": 1455692728, "timestamp_updated": 1455692728, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21197920": {"recommendationid": "21197920", "author": {"steamid": "76561197975101001", "num_games_owned": 2193, "num_reviews": 2, "playtime_forever": 3607, "playtime_last_two_weeks": 0, "last_played": 1480299330}, "language": "english", "review": "Awesome bullethell roguelike. Well worth 12$ and supports one of the best small indie dev studios", "timestamp_created": 1455427571, "timestamp_updated": 1455427571, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21175209": {"recommendationid": "21175209", "author": {"steamid": "76561197998765611", "num_games_owned": 344, "num_reviews": 11, "playtime_forever": 1027, "playtime_last_two_weeks": 0, "last_played": 1462606324}, "language": "english", "review": "I'm not usually a fan of these kinds of games, but I saw this on a livestream and thought it was fun, so I bought it.\nAnd omg the game is good, challenging and fun!\nIt's way too hard for me and I die so often, yet I do not get frustrated by it, maybe it's the super awesome, motivating soundtrack?\n\nAnyways, I can only recommend this game!", "timestamp_created": 1455360556, "timestamp_updated": 1455360556, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502864", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21148870": {"recommendationid": "21148870", "author": {"steamid": "76561197995712807", "num_games_owned": 520, "num_reviews": 64, "playtime_forever": 16, "playtime_last_two_weeks": 0, "last_played": 1454372988}, "language": "brazilian", "review": "É realmente Binding of Isaac, mas MUITO mais shump. MUITO MAIS! :D", "timestamp_created": 1455275880, "timestamp_updated": 1455275880, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21121480": {"recommendationid": "21121480", "author": {"steamid": "76561198009343868", "num_games_owned": 801, "num_reviews": 21, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1455175294}, "language": "english", "review": "Give it a few runs and you'll love this game. This is by far the best thing Arcen has put out since AI War", "timestamp_created": 1455175337, "timestamp_updated": 1455175337, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.497536", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21101056": {"recommendationid": "21101056", "author": {"steamid": "76561197987601677", "num_games_owned": 906, "num_reviews": 4, "playtime_forever": 182, "playtime_last_two_weeks": 0, "last_played": 1454431765}, "language": "english", "review": "Very fun game. It is a sci-fi version of Binding of Isaac with a lot more bullets on the screen and player character is leveling up, with each level getting a new perk (one out of three). There are six mechs to choose from, five difficulty levels and five (at first, later it becomes seven) floors to explore with a lot of replaybility.", "timestamp_created": 1455108475, "timestamp_updated": 1455108475, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21064354": {"recommendationid": "21064354", "author": {"steamid": "76561198038456676", "num_games_owned": 144, "num_reviews": 13, "playtime_forever": 580, "playtime_last_two_weeks": 0, "last_played": 1458677551}, "language": "english", "review": "I normally do not like roguelikes, but I had fun so far with Starward Rogue.\nIt feels like an old Arcade game, but it is also quite polished, actually more polished then you would see from the video and the screenshots.\n\nThere are 6 different mechs, a lot of different weapons useables and passive effects and the random generated levels feel almost as good as hand crafted ones.\n\n", "timestamp_created": 1454975205, "timestamp_updated": 1454975205, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21063797": {"recommendationid": "21063797", "author": {"steamid": "76561198006581265", "num_games_owned": 379, "num_reviews": 4, "playtime_forever": 281, "playtime_last_two_weeks": 0, "last_played": 1455593029}, "language": "english", "review": "I'm not a SHMUP player. I'm not an 'action roguelike' player, either. To be honest? I bought this to support Arcen Games. I haven't always loved their games, but I love their brand of innovation, and I hate to see them in dire straits.\n\nSo I figured, \"I bought the game--might as well give the game a try, right?\" After a couple hours of play, it's pretty fun! Even if you suck at these things!\n\nOn 'Normal' difficulty, the pace of play is measured enough that navigating my way through \"bullet heck\" is as dependent on strategy as reflexes. And the variety of powerups is super cool! Every game is different after the first few upgrades. And there's such a variety that I haven't seen the same stuff twice. (To be fair, that's in two hours.)\n\nNow, I've seen enough SHMUPs to know they can be very lush and beautiful productions. Arcen doesn't do \"lush.\" But for those familiar with games like AI War and Last Federation, the graphics and controls are frankly better. Everything's clean and smooth, and it's enjoyable to discover the different variations on enemies. As with the loot, there's a whole, whole lot of enemy variety.\n\nI can't say you're in for a fantastic journey through sound. The score and sound effects are pretty basic. You're probably going to want to play your own music in the background, but I do that with lots of games, so it's fine by me!\n\nI'm playing with an X360 controller, which I imagine is how it's meant to be done.\n\nIn conclusion: I can recommend this as an amusement for casual players, especially if (like me) you're a fan of 'roguelike' genre conventions. It's not too punishing, even on the default difficulty level, and the design is clean and sharp. Why not give it a try?", "timestamp_created": 1454972909, "timestamp_updated": 1454972909, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.555126", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21036910": {"recommendationid": "21036910", "author": {"steamid": "76561198099639387", "num_games_owned": 1220, "num_reviews": 10, "playtime_forever": 4028, "playtime_last_two_weeks": 0, "last_played": 1480209663}, "language": "english", "review": "An addictive top-down shooter, set in a colorful world of robots, lasers and bullets. Fun to play for a short session (it saves on exit and we can continue the run later) or a few hours. I'm not particularly good at action games, so I appreciate the choice of five difficulty levels. I made some successful runs on easy, with different starting mechs (took me  some practice).  Maybe, one day, I will beat the Warden on normal. With six different mechs to try and a variety of enemies and power-ups, a lot of replayability.", "timestamp_created": 1454879668, "timestamp_updated": 1454879877, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21009063": {"recommendationid": "21009063", "author": {"steamid": "76561198051286759", "num_games_owned": 225, "num_reviews": 11, "playtime_forever": 437, "playtime_last_two_weeks": 0, "last_played": 1467064108}, "language": "english", "review": "Awesome fun. Fast, frantic, chaotic gameplay that will keep you on the edge of your seat with the permadeath. I never felt like I had died due to anything other than my own fault. Reminds me of a sci fi version of Nuclear Throne but with slightly more choices available to the player (collecting credits, missiles, xp, buying items, even buying xp).", "timestamp_created": 1454797093, "timestamp_updated": 1454797093, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20994972": {"recommendationid": "20994972", "author": {"steamid": "76561197997159127", "num_games_owned": 271, "num_reviews": 33, "playtime_forever": 755, "playtime_last_two_weeks": 0, "last_played": 1499199388}, "language": "russian", "review": "Я не очень много играл в данмаку, так что не могу объективно судить. Но эта игра весьма понравилась.\n\nПлюсы:\n— разнообразие комнат, врагов, пуль, модификаторов, оружия и т.п.\n— запоминающийся, если не сказать «прилипчивый», саундтрек\n— красивая графика\n— разнообразные боссы и минибоссы\n— уровни генерируются случайно, поэтому каждое прохождение уникально, плюс можно выбирать башку с разными возможностями, что тоже даёт разнообразие геймплея\n— секретные комнаты с ништяками, магазины, где можно за деньги или за здоровье (не чокаясь) купить улучшения или конвертировать деньги в экспу\n— общее буйство красок, взрывов и разрушения\n\nПлюс-минус:\n— есть ещё два этажа после пятого (это хорошо!), но они откроются только после трёх побед над Warden'ом, т.е. после трёхкратного прохождения пяти этажей (это уже не очень, ну да ладно)\n— даётся намёк на наличие сюжета, но кроме монолога в туториале он никак далее не упоминается (минус). Я ещё не проходил дальше пятого этажа, может, там что-то есть (потенциальный плюс).\n\nМинусы:\n— туториал обрывается внезапно, как и прохождение пятого этажа, нет какой-то логической завершённости\n— лично мне начать было трудновато, несколько раз сливался на первом же боссе, пока не выработал умение лавировать между пуль (нажатие Ctrl помогает двигаться медленнее и точнее)\n— немного не хватает фидбэка при попадании в неразрушаемые объекты, при попадании врагов в меня и т.п., некритично, но звуком/графикой можно было бы подчеркнуть\n\nУчитывая цену, увлекательность и разнообразие, настоятельно рекомендую. Кроме того, Arcen Games переживают не лучшие времена, и поддержать обязательно надо, игры они делают замечательные и, что важно лично мне, кроссплатформенные.", "timestamp_created": 1454762601, "timestamp_updated": 1454767646, "voted_up": true, "votes_up": 17, "votes_funny": 2, "weighted_vote_score": "0.726555", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20992249": {"recommendationid": "20992249", "author": {"steamid": "76561197971259230", "num_games_owned": 209, "num_reviews": 6, "playtime_forever": 1373, "playtime_last_two_weeks": 0, "last_played": 1490462916}, "language": "english", "review": "Short version of the review: If you like bullet-hell games that you can replay over and over with different characters and different abilities, with randomly generated floors and items, get this game.\n\nLong version for those of you who want to know exactly what this game has to offer, and whether it excels in areas you want it to, here you go.\n\nThis game is, again, a bullet-hell game that places you in a robot that's going through several different floors on a huge station called the Megalith, which is surprisngly embedded in a sun. You get several different characters to use, all of which vary in stats (stats being your health, shields, damage, stuff like that), weapons, and some even have awesome side effects during the game. After you choose both the character and the difficulty, it drops you into a level. I'm pretty sure this game has the same floor level creation process as the Binding of Isaac. A large amount of pre-made rooms are set up, and then those rooms are randomly plotted around to create the floor that you traverse through. Anywho, the game has a lot of content right now. Lots of different varied enemies, lots of different room designs that make some rooms tricky to deal with, so on and so forth. The only thing this game lacks, in my opinion, is a lack of both MUSIC and ITEMS. The music, while awesome and catchy, does get old after a while. There are, like, 4-6 different loops (not including the boss music) that play during the different floors, and it gets kind of tiring after a while. I would really love to see more music added in the future. The next problem is the lack of items. Now, there is still quite an amount of items in the game. Different primary's, secondaries, attachments, useables, so on and so forth. Shops that offer you health/shield upgrades, and other things like that. But even with all that, there seems to be a lack of them. As I play the game more, I will change this if I notice a difference and there's actually, yknow, a LOT more then I've noticed. But until then, there ya go. It's a game that I would extremely recommend for it's price tag, and it's super fun.", "timestamp_created": 1454754930, "timestamp_updated": 1454754930, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.502511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20981365": {"recommendationid": "20981365", "author": {"steamid": "76561197960571668", "num_games_owned": 414, "num_reviews": 13, "playtime_forever": 239, "playtime_last_two_weeks": 0, "last_played": 1460405274}, "language": "english", "review": "Starward Rogue has a 100% 'true rank' on Steam DB, and a 99% user review score; it's well deserved. I'm tired of rogue-lites, and I don't play shmups very often at all. I am absolutely not the target audience of this game. But it is superb, best of breed, and has kept me hooked.\n\nThe variety of enemies is excellent, inspired by both the very best of bullet hell gameplay and lots of creative enemy types that provide stimulating challenges. The tutorial is good, the difficulty is very adjustable, and the different suit designs allow the player to chose totally different styles of play. The rogue-lite aspects provide you with a sufficiently unique experience each time, and are balanced to offer a consistently entertaining difficulty curve as well.\n\nThe game's length is such that if you have a bad run it isn't a waste of time, but if you're having a good time you get a really good stint of it, and it's very replayable. The graphics are solid, functional and vibrant. The music is, as typical for Arcen games, fairly non-standard but of a high quality. Ultimately, though, Starmade Rogue stands out for its excellent gameplay.", "timestamp_created": 1454714505, "timestamp_updated": 1454714505, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.582464", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20956658": {"recommendationid": "20956658", "author": {"steamid": "76561197989390503", "num_games_owned": 422, "num_reviews": 83, "playtime_forever": 462, "playtime_last_two_weeks": 0, "last_played": 1455395681}, "language": "english", "review": "I'm personally not a huge fan of bullet hell type games, but I can't deny that Starward Rogue is well put together and enjoyable.\n\nYou pick a mech, choose your preferred difficulty, and head into a dungeon. Each mech has various pros and cons that set it apart from the others, and the difficulty choices encompass all types of players, whether you want a casual experience or a gruesome challenge. \n\nDungeons consists of various rooms. Most have enemies in them, which you have to kill before proceeding further, others have some kind of puzzles or obstacles such as lasers that go on and off in a pattern. You also pick up a variety of items and equipment for your mech to improve them for the duration of the run. At the end of the floor there's a boss, which you have to defeat in order to be able to descend to the next floor. Bosses all have unique attack behaviours and are generally very fun to fight. I'd say, this game is very similar to Binding of Isaac, except in a sci-fi setting. \n\nVisuals are very pretty and shiny, despite being very simplistic. At first some stuff can be a tad confusing, like the glass floors overlooking space at first seemed like death drops/impassable places to me and it's not often easy to tell which of the obstacles are destructable and which aren't. Music is all right too. There are some nice upbeat tunes here and there, but I think the music in other Arcen games is way better.\n\nIt's a simple but fun gameplay. Don't expect deep tactics and strategy like in other Arcen games (such as Bionic Dues and The Last Federation), but if you just want to have some fast-paced fun and challenge your reflexes, then the game is well worth getting. It is a welcome change to see an indie dev that changes the formula in each of their games and does something new rather than churning out clones all the time.", "timestamp_created": 1454620576, "timestamp_updated": 1454620576, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503779", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20944100": {"recommendationid": "20944100", "author": {"steamid": "76561197970012480", "num_games_owned": 367, "num_reviews": 1, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1454563725}, "language": "english", "review": "Solid game.  Better than Isaac.", "timestamp_created": 1454558863, "timestamp_updated": 1454558863, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20940252": {"recommendationid": "20940252", "author": {"steamid": "76561197995794982", "num_games_owned": 376, "num_reviews": 1, "playtime_forever": 269, "playtime_last_two_weeks": 0, "last_played": 1454560266}, "language": "english", "review": "Really fun top-down shooter mixed with a bullet-hell. Tough but without feeling unfair. Catchy music, colorful graphics and amusing characters. Pick this up ASAP!", "timestamp_created": 1454538122, "timestamp_updated": 1454538122, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20915373": {"recommendationid": "20915373", "author": {"steamid": "76561198109198210", "num_games_owned": 175, "num_reviews": 3, "playtime_forever": 541, "playtime_last_two_weeks": 0, "last_played": 1481236053}, "language": "english", "review": "Rogue style games have the tendency to become \"work\". Redo the first levels... Either because you die or even worse: You just dont get the right equipment.\n\nIf you like the bullet hell aspekt - this is a a very good rogue like game. It's only 5 levels \"deep\" but with lots of variety. So if you die you just keep playing. No matter that your back at level one.", "timestamp_created": 1454434642, "timestamp_updated": 1454434642, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20912937": {"recommendationid": "20912937", "author": {"steamid": "76561198023726783", "num_games_owned": 495, "num_reviews": 7, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1508130090}, "language": "english", "review": "I've been playing this on a touch-screen Linux laptop, with a touch pad.  To get this to work, I rebound the secondary weapon to capslock, and I use the touch-screen to aim and fire the primary weapon (hold finger to screen = fire).\n\nMy original plan, after playing it for a few minutes, was to wait for the Steam controller to arrive -- the Steam controller that I ordered after playing this for a few minutes.  But, waiting would mean not playing for several days.  So I adopted the control scheme above.\n\nObviously, Redshift is the mech to use if you're uncertain about your control.  But I've played as all of the mechs so far, and beat the game with the treasure hunter.  The White Gloss mech looks boring, but the advantage of so much health is that you can spend it on health-costing upgrades.\n\nIt's a shame that killing shopkeepers is so punishing.  OTOH, it's pretty easy to kill them, and they don't hunt you down afterwards like they do in some similar games.\n\nMore mechs, please.\n\nMy life's goal is to get the \"fit for a Hydral\" achievement.\n\nWhat I'm saying is, this game is good.", "timestamp_created": 1454425568, "timestamp_updated": 1454425568, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20910453": {"recommendationid": "20910453", "author": {"steamid": "76561197994834237", "num_games_owned": 221, "num_reviews": 2, "playtime_forever": 392, "playtime_last_two_weeks": 0, "last_played": 1460206422}, "language": "english", "review": "I've always been a big fan of roguelike games ever since, well, the original Rogue, and have enjoyed seeing elements of that genre spread out into other games in recent years. This game does it well! The obvious big name to compare this to is Binding of Isaac, and this is honestly on the same level in my opinion. The enemy variety is excellent, with creative designs involving strange bullet patterns and AI behaviours. The weapons are interesting too, and quite distinct. There is even a character to play as that changes things into a neat sort of turn based mode where enemies only move when you do. Since Arcen has an amazing history of continuing to update and support their games after release, I can easily imagine this becoming the new standard by which this style of game is measured by. Definitely a worthwhile purchase for anyone who enjoyed BoI or roguelite games in general.", "timestamp_created": 1454414982, "timestamp_updated": 1454414982, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20907642": {"recommendationid": "20907642", "author": {"steamid": "76561198009270704", "num_games_owned": 1109, "num_reviews": 130, "playtime_forever": 497, "playtime_last_two_weeks": 0, "last_played": 1455962786}, "language": "english", "review": "A very competent bullet-hell isaac-like. It has structure to work with, and enough upgrades and variety to make playthroughs feel different.", "timestamp_created": 1454399140, "timestamp_updated": 1454399140, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500591", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20904141": {"recommendationid": "20904141", "author": {"steamid": "76561198002541970", "num_games_owned": 41, "num_reviews": 4, "playtime_forever": 2621, "playtime_last_two_weeks": 0, "last_played": 1507902463}, "language": "english", "review": "Buy this game, love this game, give Arcen your monies. If you like the idea of a high-replayability roguelite full of bullet hell goodness, you'll be addicted to Starward Rogue. There's a difficulty setting for virtually everyone, so as long as you're into games that give you plenty of druglike highs and screaming-wails-of-frustration lows, you'll be able to get far more than your money's worth from this gem. Be you either a casual or hardcore gamer.\n\nArcen are always great about continuing to support their games (as long as they have the power to do so), and with enough love from the players and devs--this game has the potential to get exponentially better than it already is.\n\nOne of the main appeals to me personally is how the theme of the game meshes so well with the gameplay. You can go from feeling like diving off a building as you curse the gods for your RNG while playing The Binding of Isaac, to straight becoming a love-slave at the many ways you'll get owned by the higher difficulties of Starward Rogue.\n\nThe music and theme of the game make you excited to play it and keep playing it, through the best and worst moments. 10/10 highly recommend inhaling this meme", "timestamp_created": 1454376553, "timestamp_updated": 1454376553, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20901329": {"recommendationid": "20901329", "author": {"steamid": "76561197978309906", "num_games_owned": 294, "num_reviews": 21, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1454441448}, "language": "german", "review": "Cooles schnelles Gameplay gepaart mit einem sehr witzigen Sprecher und das ganze gewürzt mit fetztigem Sound und teilwese sehr anspruchsvollen Maps.\nDieses Roguelike ist definitiv einen Blick wert für Leute, die nicht gleich bei jedem Bildschirmtot verzweifeln. Denn sterben ist spätestens in den höheren Ebenen keine Seltenheit mehr.\nFür mich auf jeden Fall sein Geld wert.\n\nEin kurzer Einblick:\nhttps://www.youtube.com/watch?v=ypFejAqFFPM&feature=youtu.be", "timestamp_created": 1454363777, "timestamp_updated": 1454363777, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.502844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20891077": {"recommendationid": "20891077", "author": {"steamid": "76561198025477286", "num_games_owned": 656, "num_reviews": 20, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1455959108}, "language": "english", "review": "I liked the game even thought I do not normally like SHUMPs, just had to set it on \"Very Easy\" to accomodate for my level of experience in this type of games. Progression seems meaningful, the controls are simple and easy to understand, this is a very well done game.", "timestamp_created": 1454324391, "timestamp_updated": 1454324391, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20884316": {"recommendationid": "20884316", "author": {"steamid": "76561197999680919", "num_games_owned": 111, "num_reviews": 1, "playtime_forever": 2535, "playtime_last_two_weeks": 0, "last_played": 1459780192}, "language": "english", "review": "Beautiful, fun, interesting and entertaining to play and to watch. There is a difficulty level for everyone, and a lot to explore. This is what happens if Isaac stepped into a mech and battled aliens. Seriously, great for casual or hardcore play.", "timestamp_created": 1454285591, "timestamp_updated": 1454285591, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20883105": {"recommendationid": "20883105", "author": {"steamid": "76561198035901121", "num_games_owned": 634, "num_reviews": 5, "playtime_forever": 233, "playtime_last_two_weeks": 0, "last_played": 1460236760}, "language": "english", "review": "An awesome mix between rogue-like and bullet-hell, and it comes with great music.", "timestamp_created": 1454280145, "timestamp_updated": 1454280145, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20881080": {"recommendationid": "20881080", "author": {"steamid": "76561197964194748", "num_games_owned": 323, "num_reviews": 1, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1454270440}, "language": "german", "review": "Amazing game, massive amounts of content, and it looks a lot better when you actually play it than the trailer makes it out to be.\n\nWorth buying just for the title screen, and lots of game on offer.", "timestamp_created": 1454273135, "timestamp_updated": 1454273135, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20878681": {"recommendationid": "20878681", "author": {"steamid": "76561197993100157", "num_games_owned": 442, "num_reviews": 3, "playtime_forever": 891, "playtime_last_two_weeks": 0, "last_played": 1501381034}, "language": "english", "review": "This is a great game. If you like skill based challenge with rogue-lite randomness and permadeath then this game is for you.  \n\nI find the challenge to be more skill based than knowledge based and for that it's a welcome change from BoI.  When I die in this game, it's because I screwed up. This is in stark constrast to BoI where I feel that half of my deaths are caused by wrong item choices based on incomplete knowledge of the possible item synergies because I haven't looked them up.  \n\nThe choice of difficulty level is really satisfying. Normal is a fun challenge while hard is an impressive step up in difficulty without feeling like it is impossible one. It's definitely a bullet-hell game on the harder difficulties and trying to manage missing all of the bullet patterns while still hitting the bosses is a rewarding challenge. \n\nEDIT: \nMy only complaints is that not all of the menu options in the game have intuitive controller mappings. For example, in the pause menu, it gives you a mouse like control to select options.  Lame.  But that doesn't take away from the fun you have while playing it.", "timestamp_created": 1454266005, "timestamp_updated": 1454268408, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20878107": {"recommendationid": "20878107", "author": {"steamid": "76561198009596233", "num_games_owned": 232, "num_reviews": 2, "playtime_forever": 2158, "playtime_last_two_weeks": 20, "last_played": 1513653879}, "language": "english", "review": "Buy it..that is all..Thank u", "timestamp_created": 1454264333, "timestamp_updated": 1454264333, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20859303": {"recommendationid": "20859303", "author": {"steamid": "76561198034019975", "num_games_owned": 268, "num_reviews": 15, "playtime_forever": 723, "playtime_last_two_weeks": 0, "last_played": 1471127612}, "language": "english", "review": "I bought this game to throw my money at Arcen. I don't know if my $12 will be enough to pull them back up but what will it hurt? \n\nI played one round so far just to log a bit of gametime but I can say I will be back on it for sure. As everyone else has said, it's like Binding of Isaac and a SHMUP had a baby and called it Starward Rogue. \n\nSo far the thing I like most about it is how the difficulty settings are designed to make the game playable from all skill levels. I did l play on the easiest mode and beat the game on my first try but I am also coming from a decent amount of time in Isaac and other rogue-lites. I will play on a harder level later on to make it a bit more challenging.\n\nSo far my only complaint is that there isn't really a definite sound effect when you get hit. I'm used to Isaac and friends grunting when they get hit by a ball of blood or a certain boss named The Bloat. Other then that I haven't played enough to weigh in on other aspects of the game.\n\nI hope my review and other good review will help them since they are in a financial crisis. I don't want to see another great indie dev go under.", "timestamp_created": 1454193984, "timestamp_updated": 1454193984, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20859247": {"recommendationid": "20859247", "author": {"steamid": "76561198043367667", "num_games_owned": 1025, "num_reviews": 143, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1454262673}, "language": "english", "review": "I'm going to be playing this far too much for far too long.", "timestamp_created": 1454193781, "timestamp_updated": 1454193781, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20858986": {"recommendationid": "20858986", "author": {"steamid": "76561197978324005", "num_games_owned": 607, "num_reviews": 3, "playtime_forever": 62, "playtime_last_two_weeks": 0, "last_played": 1454132713}, "language": "english", "review": "If you like Binding of Isaac then you should check this game out.  It is a very well done twin stick shooter game with RPG elements.", "timestamp_created": 1454192994, "timestamp_updated": 1454192994, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20858458": {"recommendationid": "20858458", "author": {"steamid": "76561198040884867", "num_games_owned": 1255, "num_reviews": 650, "playtime_forever": 2487, "playtime_last_two_weeks": 8, "last_played": 1513467435}, "language": "english", "review": "[b]Out of the hundreds of titles I played in 2016, [i]Starward Rogue[/i] gets my Indie Game of the Year vote for 2016.[/b]\n\n---\n\nEdited 10/4/2016\n\nI'm pushing 40 hours and achievement hunting. Game is pure gold.\n\n---\n\nEdited 2/4/2016\n\nAfter nearly 10 hours of playing, this is on track for one of the best titles I've played this year. Seriously.\n\n---\n\n[b]While Arcen Games business model may be struggling, you wouldn't know it from their latest release - [i]Starward Rogue[/i].[/b] This roguelite is very much in the same vein as the mammoth twin-stick shooter [i]The Binding of Isaac[/i] in the sense that its a top-down shooter with heavy emphasis on upgrades and knowledge of the system (oh, and with a bit of bullet-hell, too). [strike]While[/strike] [i]Starward Rogue[/i][strike] is not without its flaws, it [/strike]certainly gets alot right.\n\n[b]Pros:[/b]\n+Its really [i]fun[/i]. This game will certainly have you coming back for 'one more level'. Very addicting.\n+Both controller support and keyboard/mouse work great.[strike]While the controller support needs some work in the menus (should be patched any day know as per devs), the in-game controls are really tight. Edit: Its even better playing with keyboard+mouse.[/strike]\n+Lots of meaningful upgrades that actually make you think functionally about how you play the game. This is heavily inspired from [i]BoI[/i] I am sure. It's done well.\n+The setting is cool. There is something quite appealing about the odd situation of the ship stuck in a planet/asteroid.\n+Level design is quite well done. Definately has *some* lite puzzle aspect, and strategy as you go about completing a level.\n+Music is great and high energy.\n+Content keeps coming despite low sales and small community. What a great effort and final product.\n\n[b]Cons:[/b]\n-Bugs have largely been squashed. The only 'con' is that I want even more content (yes, they just released a huge huge Humble Bundle content addition - but I want more!!) [strike]There are some minor bugs with sound/getting stuck on doorways. All small stuff. AND any crashes I may have had, I was able to reload and it had autosaved, so its all good.[/strike]\n\n\n[b]This is a must buy.[/b]", "timestamp_created": 1454191254, "timestamp_updated": 1486036789, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.678328", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20857356": {"recommendationid": "20857356", "author": {"steamid": "76561197964146699", "num_games_owned": 339, "num_reviews": 6, "playtime_forever": 702, "playtime_last_two_weeks": 0, "last_played": 1455243805}, "language": "english", "review": "If you like both the action roguelite and bullet hell genres then you should give this game a try. It plays similar to other games in the genre such as the binding of isaac, however be prepared to dodge your way through walls of bullets.\n\n The rooms are well designed, enemies have interesting attack patterns and the bosses are a definite highlight. The game featured 5 different difficulties. I have only tried normal so far, which seems tough but fair.\n\nThis game is really solid and deserves a lot more attention then it has received.", "timestamp_created": 1454187891, "timestamp_updated": 1454187891, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20852816": {"recommendationid": "20852816", "author": {"steamid": "76561198010388676", "num_games_owned": 900, "num_reviews": 1, "playtime_forever": 251, "playtime_last_two_weeks": 0, "last_played": 1454180923}, "language": "english", "review": "I'm not a huge roguelike fan, but I am pretty into this one because it has a different style and setting than most.  The shooting is satisfying as if it were an arcade game, the game doesn't require you to play for long stretches to get to the 'end' (and you can save and quit if you have less time than that), and even though it's short, there are 6 different robots to pick from with five difficulties, so you're not nearly done just by getting to the end.", "timestamp_created": 1454174860, "timestamp_updated": 1454174860, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.551282", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20848265": {"recommendationid": "20848265", "author": {"steamid": "76561197970191411", "num_games_owned": 281, "num_reviews": 5, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1489238286}, "language": "english", "review": "It's not normally a genre I play as I find bulletstorm games too frantic but I gave it a chance because I've enjoyed other Arcen games. It turned out to be a lot of fun. The visuals are simple but effective, sometimes with striking colour patterns and backgrounds. Game play is smooth. There's a good deal of replayability with randomization and you can turn the difficulty up or down to suit what you can handle. The things I didn't like are that some of the UI is a bit fiddly and the possible ship / weapon upgrades aren't explained that well.", "timestamp_created": 1454162317, "timestamp_updated": 1454162317, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20844182": {"recommendationid": "20844182", "author": {"steamid": "76561198025174456", "num_games_owned": 693, "num_reviews": 5, "playtime_forever": 914, "playtime_last_two_weeks": 0, "last_played": 1466626932}, "language": "english", "review": "Like Twin stick shooters? Like Bullet hell? If yes then you'll love this. Its easy to get into, but challenging, has lots of interesting powerups and weapons and some mad bossfights.\n\nI cant wait to see what the modders do with this, but its going to be spectacular.\n\nBuy this game, 10/10", "timestamp_created": 1454148526, "timestamp_updated": 1454148526, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.530201", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20841930": {"recommendationid": "20841930", "author": {"steamid": "76561198113847640", "num_games_owned": 165, "num_reviews": 1, "playtime_forever": 317, "playtime_last_two_weeks": 0, "last_played": 1462756264}, "language": "english", "review": "This is a crazy-addictive roguelite with danmaku elements.  The character loadouts, perks, and loot table are so deep you can't see the bottom.  The gameplay itself is smooth like Ewan McGreggor in a tub of butter; think Housemarque-tier polish and you'll be getting close.\n\nIt's like The Binding of Isaac, but better and in space.\nWhy wouldn't you buy this?", "timestamp_created": 1454138440, "timestamp_updated": 1454138894, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20841187": {"recommendationid": "20841187", "author": {"steamid": "76561197982489226", "num_games_owned": 399, "num_reviews": 4, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1454134115}, "language": "english", "review": "Reminds me of Continuum only singleplayer... bought at full price to support Dev's since I liked AI War so much!\n\nYou should take a look yourself, help Arcen games out! (they need it, monday is DAS BOOT for all!)", "timestamp_created": 1454134407, "timestamp_updated": 1454134407, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20841154": {"recommendationid": "20841154", "author": {"steamid": "76561198007897761", "num_games_owned": 714, "num_reviews": 33, "playtime_forever": 944, "playtime_last_two_weeks": 0, "last_played": 1458508852}, "language": "english", "review": "Fun game.  Isaac-hell with some fun ideas and pretty bullets so you will at least die happy.", "timestamp_created": 1454134243, "timestamp_updated": 1454134243, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20840998": {"recommendationid": "20840998", "author": {"steamid": "76561198025724769", "num_games_owned": 447, "num_reviews": 28, "playtime_forever": 777, "playtime_last_two_weeks": 0, "last_played": 1471762269}, "language": "english", "review": "You are a space hydra controlling one of its disembodied heads inside a mech that is onboard a giant spaceship lodged in the side of a star, blowing things up and dodging neon bullets to a pumping techno soundtrack...\n\nOne of the nice things about the bullet hell angle is that I always feel like it's my own fault when I die. And the amount of variation keeps me wanting to start new runs.", "timestamp_created": 1454133425, "timestamp_updated": 1454133425, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20840336": {"recommendationid": "20840336", "author": {"steamid": "76561198065877448", "num_games_owned": 1469, "num_reviews": 38, "playtime_forever": 589, "playtime_last_two_weeks": 0, "last_played": 1471147767}, "language": "english", "review": "This is Binding of Isaac if Binding of Isaac was fun. Large rooms, enemies with good bullet variety, secrets, multiple mechs unlocked from the start... I've seen people complaining about the soundtrack but personally I like it; it reminds me of Hotline Miami's Pertubator and M|O|O|N tracks (I think I spelled those right), which is definitely a good thing. There are often temporary buffs that only last while a condition is fulfilled, there are optional goals you can find as pickups (e.g. complete level with 0 credits remaining to get 50 credits, 1 key and 40 exp)... I played 3 hours today. It's my first day playing.\n\nI love this game. Screw Binding of Isaac. It's been replaced by this game and its neon mech awesomeness.", "timestamp_created": 1454129614, "timestamp_updated": 1454129614, "voted_up": true, "votes_up": 5, "votes_funny": 3, "weighted_vote_score": "0.517986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20839958": {"recommendationid": "20839958", "author": {"steamid": "76561197973245321", "num_games_owned": 414, "num_reviews": 12, "playtime_forever": 272, "playtime_last_two_weeks": 0, "last_played": 1455586569}, "language": "english", "review": "Another solid game from a solid developer. Thanks Arcen Games!", "timestamp_created": 1454127783, "timestamp_updated": 1454127783, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20839481": {"recommendationid": "20839481", "author": {"steamid": "76561197993326080", "num_games_owned": 1229, "num_reviews": 3, "playtime_forever": 73, "playtime_last_two_weeks": 0, "last_played": 1454126391}, "language": "english", "review": "I'm generally not a fan of twin-stick shooters or twitch gameplay but decided to pick this up. \n\nThe music is great. The graphics get the job done. Controls are responsive and generally you go where you mean to and shoot where you mean to.\n\nSo far I'm enjoying it. It gets a lot more fun once you have a few enhancements. My best run so far was with a weak gun that can shoot through walls. \n\nI don't have a lot of time to game and this is nice for a short burst.\n\n", "timestamp_created": 1454125207, "timestamp_updated": 1454125207, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20838115": {"recommendationid": "20838115", "author": {"steamid": "76561197970530770", "num_games_owned": 962, "num_reviews": 3, "playtime_forever": 139, "playtime_last_two_weeks": 0, "last_played": 1453790162}, "language": "english", "review": "It's like The Binding of Isaac without the gross aesthetic.", "timestamp_created": 1454118416, "timestamp_updated": 1454118416, "voted_up": true, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.474138", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20837525": {"recommendationid": "20837525", "author": {"steamid": "76561198042739139", "num_games_owned": 638, "num_reviews": 4, "playtime_forever": 760, "playtime_last_two_weeks": 0, "last_played": 1480344022}, "language": "english", "review": "A great shooter game with the unique graphical style of Arcen Games. It plays like an arcade game crossed with Risk of Rain. The elements of progression that are included in the game are especially appealing to me personally. Defiantly a game to try.", "timestamp_created": 1454115483, "timestamp_updated": 1454115483, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20836637": {"recommendationid": "20836637", "author": {"steamid": "76561198039817087", "num_games_owned": 1704, "num_reviews": 5, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1454112758}, "language": "english", "review": "I have only played for a short time thus far, but I am already in love with this criminally underrated and under promoted gem. The visuals are crisp and the juxtaposition of the dark (but detailed) backgrounds with the searing bursts of neon fire from enemies just works beautifully. Menus are slick and the developed provides a ton of flavor text, making it absurdly easy to navigate and use the options menu in particular. The in-game UI is unobtrusive and never gets in the way of the action, which becomes important as things turn chaotic. Controls are handled with aplomb and the player has just enough of a sense of weight to feel appropriate for mech fights. The devs even give the option for a weightless and snappy schmup style control feel. Combat itself is frenetic and possesses satisfying depth, rewarding the player with the ability to show off true skill in the midst of the madness. The general mix of exploration, upgrading, and combat are fleshed out and dialed in to provide what I consider to be near perfect pacing, and it is all backed up by the rare soundtrack that I actually turn UP.\n\nIf you like any element of this game, you will have an absolute blast with it. I bought it on sale for a couple dollars off, but I would not hesitate to pay the very reasonable $11.99. There is enough brilliant gameplay here to make it a legitimate no brainer.", "timestamp_created": 1454111593, "timestamp_updated": 1454111593, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20835403": {"recommendationid": "20835403", "author": {"steamid": "76561197984195486", "num_games_owned": 933, "num_reviews": 120, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1454299648}, "language": "english", "review": "Like most of Arcen's offerings, Starward Rogue is a little short on polish. Also like most of Arcen's games, it combines a lot of ideas into a package that ends up being a little bit greater than the sum of its parts. \n\nWhat SR does, is take some of the most superficial aspects of Binding of Isaac (randomized arena style rooms) and mixes it with some bullet-hell sensibilities.  Selectable characters, adjustable difficulty, and some freedom of choice within game to customize your build adds up to a game with quite a lot of replayability, and potentially a lot of challenge. And if you don't want to slog through multiple playthroughs to unlock everything, there is an \"Everything Unlocked\" mode (though trophies and unlocks are disabled while you play in this mode)  Overall, this is a really solid game. \n\nPS: Good luck to all the staff of Arcen.", "timestamp_created": 1454106627, "timestamp_updated": 1460860275, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.506410", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20835182": {"recommendationid": "20835182", "author": {"steamid": "76561198048882992", "num_games_owned": 594, "num_reviews": 4, "playtime_forever": 238, "playtime_last_two_weeks": 0, "last_played": 1454281018}, "language": "english", "review": "I bought this game to support Arcen Games during this difficult time for them. This talented dev team doesn't deserve the unfortunate situation they are in. From what I've played of the game so far it seems like inspired take on the shmup genre similar in vein to the Binding of Isaac. This game is a definite buy if you like that or just want to support the good folks over at Arcen Games.", "timestamp_created": 1454105866, "timestamp_updated": 1454105866, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20835016": {"recommendationid": "20835016", "author": {"steamid": "76561197994131572", "num_games_owned": 819, "num_reviews": 4, "playtime_forever": 3093, "playtime_last_two_weeks": 0, "last_played": 1459345716}, "language": "english", "review": "Starward Rogue is a sci-fi roguelite with bullet hell influences. The game takes a lot of inspiration from Binding of Isaac. The basic structure is the same, although SR adds a lot of its own twists on top of it. It's also much more intense, often having a huge amount of bullets on screen at once.\n\nThere's a large variety of weapons. You can carry one of each type at once, and swap them with ones found in chests and stores. Energy weapons are interesting in that they have a limited amount of ammo, but automatically recharge whenever you change rooms. This is a clever way to encourage using the weapon regularly. There's also an experience system, along with selectable perks. All in all, the game has a good amount of depth, without feeling overwhelming.\n\nYou can pick from six different mechs at the beginning of a run. All of them have different starting loadouts and attributes. One of them starts out with an unique ability, which pauses the time whenever you stand still. This makes the game almost feel like a turn based game. It's pretty hard to use, but it's an interesting alternative way to play the game.\n\nThe camera can be zoomed out further than Steam's screenshots show. Doing this makes the game look a lot less claustrophobic. If you're using a 1080p monitor, the game shows a good amount of distance around you by default. For lower resolution displays, there's an option to zoom out the view. This is very handy, as being able to see the bullets from further away makes them easier to avoid.\n\nThe graphics are quite nice, featuring high resolution 2D graphics. The UI has a simple look to it, making it easy to read.\n\nThe soundtrack features a variety of upbeat electronic music. They're all good songs, and fit the game's atmosphere well.\n\nMost of the game works well with a controller, but the menus were obviously made with a mouse in mind. Some of them require you to move a cursor around with the analog stick, which is a bit clunky.\n\nThere's more options than you usually see in 2D games. I especially enjoyed the option to switch to SHMUP style controls, which removes the friction from your movement. It makes the game feel a lot more responsive and familiar, for those who are used to playing bullet hell games.\n\nI recommend Starward Rogue to anyone who enjoys roguelites or shoot em ups. It's a fun game, with few flaws. It's challenging, yet the difficulty rarely feels cheap. Arcen Games has a reputation for releasing interesting, yet flawed games. However, Starward Rogue is much more polished than their games usually are, so give it a shot.", "timestamp_created": 1454105336, "timestamp_updated": 1454106930, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20834560": {"recommendationid": "20834560", "author": {"steamid": "76561198021988698", "num_games_owned": 83, "num_reviews": 3, "playtime_forever": 271, "playtime_last_two_weeks": 0, "last_played": 1454618791}, "language": "english", "review": "After spending about 2 hours into the game I can tell you that I am:\n* having great fun\n* unable to stop playing\n* looking forward to play more", "timestamp_created": 1454103800, "timestamp_updated": 1454103800, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.502511", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20834268": {"recommendationid": "20834268", "author": {"steamid": "76561197990300926", "num_games_owned": 688, "num_reviews": 2, "playtime_forever": 369, "playtime_last_two_weeks": 0, "last_played": 1456261069}, "language": "english", "review": "Arcen games are typically mental- this is no exception. Within the first minute you learn you are some kind of space dragon with multiple heads on a contract job off to save Rodney.\n\nThe systems here are great, music is perfect for the genre and it is genuinely difficult but rewarding.\n\nFeels like a cross between Warning Forever and BOI.\n\nRecommended.", "timestamp_created": 1454102873, "timestamp_updated": 1454102873, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20832545": {"recommendationid": "20832545", "author": {"steamid": "76561198047116754", "num_games_owned": 75, "num_reviews": 3, "playtime_forever": 256, "playtime_last_two_weeks": 0, "last_played": 1468585115}, "language": "english", "review": "Entertaining \"bullet hell\" game. Could be refered to as \"Isaac in space\", sort of...\n\nNumerous difficulty settings for beginners all the way to bullet god :)\nKeyboard and mouse playability is excellent.\nGraphisms are not 2016-ish (Arcen own style) but the game is very clear for what is most important : bullets and power up !\nVery good techno/dub music, blending with game theme.\n\nTwo lil' downside :\n- Tiles are very thematic but secondary focus can be hard to see in the hellish storm of bullet (teleporters mostly)\n- The intro humour could have been exploited a bit during gameplay : Rodney, where are you ?\n\nSpoiler : Our most cherished Hydra will lose heads... a LOT !", "timestamp_created": 1454096693, "timestamp_updated": 1454096833, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20832018": {"recommendationid": "20832018", "author": {"steamid": "76561198008464493", "num_games_owned": 330, "num_reviews": 5, "playtime_forever": 358, "playtime_last_two_weeks": 0, "last_played": 1454197987}, "language": "english", "review": "This isn't normally the type of game I play, but I bought it anyway to support the devs. I'm actually having a lot more fun than I expected. I started out on normal but got killed multiple times in the first room floor. After I switched to Very Easy, it got a lot more fun. There are lots of different enemy types and each floor has multiple minibosses in addition to a main boss at the end. It's pretty chaotic, but there's also a lot of strategy. There's ammo management over three different weapons: a primary gun with unlimited ammo, an energy weapon that recharges every time you enter a new room, and a missile weapon that you have to find ammo for. Additionally you can collect credits which you can use to buy upgrades in shops and you also gain exp for killing enemies. After you gain enough exp, you gain a level and get to choose from one of three perks at random. There are also shops that let you buy powerful upgrades at the cost of some of your max health. These are pretty cool, and are an interesting risk vs reward system. You'll also find keycards throughout the levels which unlock secret chests and rooms, though there probably won't be enough for everything so you have to pick which you want more. For instance, you might have to choose between unlocking a loot chest or a shop which has defensive items. This isn't my favorite game of theirs, but it is a lot of fun for a couple hours at a time and I definitely see coming back to it again.", "timestamp_created": 1454094993, "timestamp_updated": 1454094993, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500202", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20831725": {"recommendationid": "20831725", "author": {"steamid": "76561197971957874", "num_games_owned": 315, "num_reviews": 1, "playtime_forever": 738, "playtime_last_two_weeks": 0, "last_played": 1462941317}, "language": "english", "review": "It's basically Binding of Isaac, but more of a SHMUP.  It's good.", "timestamp_created": 1454093992, "timestamp_updated": 1454093992, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500202", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20830930": {"recommendationid": "20830930", "author": {"steamid": "76561197967950811", "num_games_owned": 1938, "num_reviews": 46, "playtime_forever": 165, "playtime_last_two_weeks": 0, "last_played": 1455301702}, "language": "english", "review": "This game is great, and deserves your attention.\n\n[h1]Summary of gameplay:[/h1] (the big one, TL;DR at the end of this section.)\n\nThis is a top-down, \"twin-stick\" style game.  Of course, being on PC you can play with mouse and keyboard OR a twin-stick controller like a 360 pad.  It's a rogue'lite'.. meaning, in this case, permadeath and procedurally generated floors.  Similar to games like Isaac, the rooms are hand-crafted but placed in randomized configurations, with randomized enemies, pickups, loot, etc.\n\nYou will be exploring labyrinths of rooms, finding powerups to make you stronger, gaining experience by killing enemies, fighting minibosses, and looking for secret rooms.  Each floor has a final boss that you typically must defeat before proceeding to the next floor.  \n\nI don't know how many room designs were made for this game, but it seems like a lot.  Some are small and square, some are very large, long, or wide.  Some have an optional obstacle course of sorts, with prizes for those skilled enough to attempt them.  The design of the room can really change how you'll fight the enemies within.  Some large enemy that was easy to fight in a big, wide-open room may be much harder if you find him in a room that is divided into narrower corridors, or full of environmental hazards.\n\nYou, and most of your enemies, fire bullets, beams, and other ranged attacks, and the game can be a little bullet-hellish, especially on some of the bosses that I've seen so far, who shoot in very bullet-hell-like patterns. This is what I like most about Starward Rogue.. most enemies fire different types of shots, in different configurations, meaning each one is a unique challenge, especially the bosses and larger enemies.  I've also come across a few very unique and well-designed bosses that break the mold a little bit, and add even more variety.  The enemy variety is top-notch.\n\nThe weapons, consumables, and upgrades that you can get are full of variety, as well.  Aside from the fact that there are several different mechs, with unique starting configurations, that you can play as; as you play, you'll come across chests, shops, boss drops, and other ways of obtaining new and interesting weapons.  Some are objectively better than others, while some are just a matter of preference, playstyle, or the 'right tool for the right job.'\n\nYour main weapons consist of a main gun with infinite ammo, a subweapon that uses a universal ammo simply called \"energy\", and a missile launcher.  The subweapons tend to have the more unique effects (such as the Guardian Blaster, that fires a shotgun of bullets that can destroy enemy fire, as well as harm enemies), though there is plenty of variety to the main guns as well.  Missiles can be used offensively, but are often best saved for destroying obstacles that cannot otherwise be destroyed.\n\nYou can also carry one of many consumables, which each have their own effect that can be used once, and then the item is gone.  There is one slot for passive 'defensive' items.. and you can also find or purchase different robot buddies that will circle around you and do stuff.  On top of all of that, you can find all kinds of upgrade items, and collect as many of those as you like.\n\nAnd that leads me to another strong plus for me. The game is not cryptic about what items do.  You can walk over something to see what it does before you pick it up, and the descriptions are usually pretty clear and straightforward.  It doesn't try to screw you over, force you to trial-and-error, or make you check a wiki to know what you're getting.\n\nI almost forgot perks!  Basically, you gain experience, level up, and pick from one of 3 perks, similar to something like Nuclear Throne.  Simple, but another layer of complexity that may make you play your run differently, or give you more options when combating foes.\n\nTL;DR: There are lots of weapons, enemies, items, room layouts, and just lots of variety in general.  Plays like a twin-stick shooter.  Procedurally generated floors comprised of hand-made rooms, similar to Isaac, with a bit of Geometry Wars and Nuclear Throne thrown in.\n\n[h1]Graphics:[/h1]\n\nYou can see them for yourself by watching the trailers, or looking at the screenshots.  There are some really cool-looking enemies, and each floor has it's own theme to the floors and walls.  The lasers and bullets are shiny and pretty.  You can see what you're doing, tell things apart, etc.  Overall, pretty good graphics, unless you just hate 2D games or something, for some reason.\n\n[h1]Sound and Music[/h1]\n\nHere's the thing about sound effects.. when they're good, you hardly notice them.  When they're bad, you notice.  I haven't really noticed anything bad, so they must be pretty good.  Nothing has really seemed out of place or ugly, to me.  There's a nice little sound effect to let you know when you've cleared a room.  The guns go tatatatatat and pew pew and fwooosh, and the explosions go boom..  What more do you want?\n\nThe music is okay, but it's not really my thing.  After a while, I turned it down a bit and found it more pleasant to have it faintly in the background  Other people will probably love the music, it's just not really what I like.\n\n[h1]Controls and Options[/h1]\nI have played using a 360 pad, and my mouse and keyboard.  Both work good.  I may slightly prefer mouse and keyboard, but the option of using a controller is nice if I want to sit back a bit and relax, or hook up to my TV and play from the bed or sofa.  Everything is rebindable, and the bindings make sense as-is.  I like that with my 360 controller, I can shoot at any angle with the right analog stick, or at 8 compass directions by holding the face buttons (individually, or two at a time for diagonals)\n\nAll aspects of the sound can be adjusted individually in the options menu.. and there are plenty of options for graphics and performance, too.  Fullscreen/window, resolution, refresh rate, scale.. even brightness, contrast, and sharpness! Nice!  And there are toggles to turn off shadows, reflections and such for people with slower computers.  Very good job on options.\n\n[h1]Conclusion[/h1]\nI like this game, if you couldn't tell (duh).  It emulates the Isaac formula a bit, but definitely has its own thing going as well.  The game seems stable and I haven't noticed any bugs (except one time when the game seemed to hang on a black screen when I tried to start a run.  No biggie, at least it didn't ruin a run in progress.)  Nothing seems lazy or half-assed, and I'm struggling to think of any real 'cons' besides not personally caring much for the music, as mentioned.\n\nLike most indie games, it's inexpensive and this is certainly well-worth the price.  And you really have to hand it to Arcen Games for always trying new things, and finding ways to bring twists to old ideas.  Even if their games aren't always the most popular, they have a few hits, and this is totally one of them.  So try Starward Rogue, and tell your friends about it if you like it.  At the time of writing, it's a hidden gem, but I hope to see more people discover it and play it.", "timestamp_created": 1454091427, "timestamp_updated": 1461279128, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.533437", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20830152": {"recommendationid": "20830152", "author": {"steamid": "76561197989527798", "num_games_owned": 737, "num_reviews": 4, "playtime_forever": 397, "playtime_last_two_weeks": 0, "last_played": 1473761419}, "language": "english", "review": "A surpringly solid twin-stick shooter which takes inspiration from the best of the genre but doesn't just blindly follow in their footsteps.\n\nDespite being pretty skeptical about Arcen pulling it off, I've conclued very fast that, fortunately, it is a pretty fun game! You can choose from 6 mechs who have different stats and some of which also start with some weapons or special skills that makes them unique. One of the mechs literally turns the game into SUPERHOT. For the uninitiated, SUPERHOT is a FPS where time flows only when you move so it basically turns from frantic battle for survival into a very chill experience.\n\nEach mech has 4 slots, primary weapon with infinite ammo, secondary energy weapon with limited usage that refills upon entering a new room, limited ammo weapon like a rocket launcher that functions like bombs in Binding of Isaac for breaking stuff/killing enemies in emergency and lastly a consumable slot. Apart from that you can find drops that just upgrade or modify your mech without being restricted to slot.\n\nThe game starts you off at 5 floors in total, each floor is very Isaac-like with shops, miniboss rooms, secret rooms and floor boss. You also gain experience, upon leveling up you can choose a perk like becoming the Keymaster and getting 100 keys, seeing the non-special and later special rooms automatically on map or learning you gottagofast. Yes, game actually has sprint button for traversing long distances AND for use in boss fights. Some of them like the Hunter miniboss will actively chase you at higher-than-normal speed so you gotta put those mech legs to work.\n\nThe enemies use bullet hell patterns but on normal they are mostly avoidable even for someone like me who doesn't play typical bullet hell games like the Touhou series. That is, at least not until you increase the difficulty and/or get to the later floors. The difficulties alter enemy and boss patterns, among other things, which is really cool way to do difficulty tiers in general.\n\nOverall, the game has pretty rad soundtrack even if it can get a bit repetitive during a longer session and solid gameplay with plenty to do on each floor and bosses that don't feel like copypasta of each other.\n\nIt's a good choice of a time-waster whether you've already played all the usual suspects or just getting into the genre. Highly recommended!", "timestamp_created": 1454088800, "timestamp_updated": 1454088800, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.500416", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20828574": {"recommendationid": "20828574", "author": {"steamid": "76561197969634400", "num_games_owned": 440, "num_reviews": 50, "playtime_forever": 845, "playtime_last_two_weeks": 0, "last_played": 1456136231}, "language": "english", "review": "It's \"The Binding of Isaac\" in bullet hell mode. \n\nAnd while it doesn't have the artistic flair of its main influence (the music in this game is particularly awful, specially compared to the beauty of Isaac's soundtrack), it's way more fun.", "timestamp_created": 1454083824, "timestamp_updated": 1454083824, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20826628": {"recommendationid": "20826628", "author": {"steamid": "76561197990062171", "num_games_owned": 239, "num_reviews": 4, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1454125884}, "language": "english", "review": "Fantastic twin-stick shooter, bullet-hell style game, with roguelike level generation.\nCan honestly say that the screenshots and video don't manage to convey how much fun it is to actually play.\n\nThanks Arcen for a great title, and extra thanks for the native linux support!", "timestamp_created": 1454077097, "timestamp_updated": 1454077097, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20825889": {"recommendationid": "20825889", "author": {"steamid": "76561198038409569", "num_games_owned": 216, "num_reviews": 9, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1454121859}, "language": "english", "review": "I really like this game. It has the timeshift machine whereby the enemy only move and shoot when your machine do anything. I only regret that it only took me 4 try to finish the game using that machine. Maybe some discount will make this game worth more.", "timestamp_created": 1454074415, "timestamp_updated": 1454074415, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.502285", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20822915": {"recommendationid": "20822915", "author": {"steamid": "76561197985763038", "num_games_owned": 206, "num_reviews": 13, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1459442969}, "language": "russian", "review": "пожалуй это лучший рогалик на равне с Исааком. причем в разы сложнее как мне показалось", "timestamp_created": 1454062135, "timestamp_updated": 1454062135, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.503186", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20821616": {"recommendationid": "20821616", "author": {"steamid": "76561197970314107", "num_games_owned": 1136, "num_reviews": 409, "playtime_forever": 514, "playtime_last_two_weeks": 0, "last_played": 1503725861}, "language": "english", "review": "I've mentioned this before but I'm glad Arcen Games exists, even if I don't really enjoy most of their games. Every one of their titles tends to venture beyond the normal bounds of game design, mashing such disparate concepts as open worlds, puzzles, and zombies into a single title. Starward Rogue has earned the distinction of their most enjoyable game for me, perhaps because it doesn't go as far afield in design as the rest.\n\nStarward Rogue places you in a head attached to a robot body stomping around the Megalith, a giant construct sticking out of a star. You get to pick one of seven wildly different bodies, from close-combat flame-spewers to a clever thing that freezes time when you're not moving. According to the tutorial you're here to rescue some AI dude, but that never really comes up during runs. Each of those runs is a top-down descent through five randomly-generated levels, featuring rooms of all shapes and sizes and enemy configurations and deadly traps. Armed with your gun, missiles, energy cannon, and whatever upgrades and single-use items you can find, you have to blast your way through tons of enemies, bosses, and minibosses to... win, I suppose. I've beaten it a few times and you just get a stat screen.\n\nIf this all sounds a lot like Binding of Isaac, that's because this is its manic sci-fi cousin. Your enemies are colorful drones and ships that will sling thousands of bullets at you in every arrangement imaginable. Much like the Touhou shmup games, bullets can curve, seek, chain, turn at right angles, form walls or fields or mazes, or perform even more dastardly maneuvers. That means you need to be prepared to do a lot of complex dodging and narrow escapes to survive a run. The health system is luckily quite generous, giving you a pool of health you can easily upgrade and also a shield or two (much harder to upgrade) that recharges for every room, essentially free hits. You also move quite fast and can freely sprint, which is a welcome addition and gives the game a much quicker pace than most.\n\nAside from the coins and keys you'll pick up, there are three classes of weapons, passive upgrades, and consumables to find. Weapons in particular tend to be few and far between but will completely change your style of play. Some guns fire through walls, some spread like flamethrowers, and some only work in melee range. Consumables can have similarly dramatic effects, like summoning temporary helpers and nuking everything in sight. You'll also level up and earn perks, but until level 10 or so those perks won't be very conspicuous, mostly being health or ammo upgrades. Oh, and there are permanent drone buddies you can find that provide some much-needed support, but can be easily confused with your foes.\n\nAnd that brings me to my one real gripe with the game, the art style. Arcen tends to favor very bold, brash color schemes for their games, but too much variety in the palette can make important features hard to single out. Everything in Starward Rogue is brightly colored and detailed, but there's no real theme to the enemies, helpers, or even you. In huge battles everything can start to blend together, even moreso with thousands of glowing bullets flying around. The camera and the pace of your robot help keep it distinctive but I've started skipping the drone familiars because they almost always confuse me and get me killed.\n\nThe art style may be hit or miss, but the rest of the presentation is excellent. Arcen games often have somewhat shoddy menus and interfaces, but the ones here are clear and even a bit polished. All the information you need is readily available and easily navigable. There's also been an impressive amount of post-launch patches which have cleared out a lot of early bugs and jank, and rebalanced whole swathes of the game to provide a more even challenge. They even added in fast-travel around the level to make backtracking and exploring essentially painless.\n\nWhat really keeps me coming back is just how plain ol' fun it is. The raw enjoyment of blasting hundreds of robots as you grow stronger and more unstoppable is in full force here. A pumping soundtrack helps keep you moving at breakneck speed as you look for the next boss to thrash. The difficulty is pretty even-handed as well, offering five different levels and ramping up steadily as you yourself grow stronger. With hundreds of enemies to encounter, tons of items to find, seven classes to master, and plenty of secrets to uncover, Starward Rogue is a worthy competitor in the arena of roguelike shooters.\n\n\n\nDid you enjoy this review? I certainly hope so, and I certainly hope you'll check out more of them at https://goldplatedgames.com/ or on my [url=http://steamcommunity.com/groups/audish#curation]curation page[/url]!", "timestamp_created": 1454055167, "timestamp_updated": 1503726711, "voted_up": true, "votes_up": 86, "votes_funny": 1, "weighted_vote_score": "0.852603", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20821442": {"recommendationid": "20821442", "author": {"steamid": "76561198019271689", "num_games_owned": 654, "num_reviews": 11, "playtime_forever": 130, "playtime_last_two_weeks": 0, "last_played": 1455490364}, "language": "english", "review": "Another hit from Arcen! Totally mod-able. Daily patches with new content and bug fixes (at least so far, it seems). My only quibble is that it seems a little easier to play with a mouse than a trackpad... But that is the case with a majority of games, I'd say. Totally worth getting.", "timestamp_created": 1454054258, "timestamp_updated": 1454054258, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20820686": {"recommendationid": "20820686", "author": {"steamid": "76561197980267638", "num_games_owned": 654, "num_reviews": 6, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1453741170}, "language": "english", "review": "A unique, but somehow perfect combination of bullet hell, rouguelike, and twin stick shooter, with its own unique twists such as a mech that stops time until you move.\n\nAdds in the awesome music and fast-pace gameplay, and the overall package is well worth the reasonable price tag.\n\nAlso, the game runs like a dream on Linux, with 0 issues so far.", "timestamp_created": 1454049947, "timestamp_updated": 1454050245, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20820431": {"recommendationid": "20820431", "author": {"steamid": "76561198194691254", "num_games_owned": 115, "num_reviews": 5, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1463810553}, "language": "english", "review": "this game is absolutely fantastic.\n\nthe bullet patterns are truly beautiful, i've died more than a couple times because i was distracted by some cool unique attack i hadn't seen before. this goes double for bosses, honestly the bosses i've fought so far have been so much more fun than anything in BoI or NT. i always feel frustrated and unfullfilled when i die to a boss in those games, in Starward Rogue I think: \"wow I really want to fight that again immediately\". \n\nthe art in general is really gorgeous and colorful, and it meshes with the gameplay and music perfectly. there's also a real sense of exploration here that you don't get in a lot of games in this genre. each room provides a new challenge to adjust to and while aesthetically there isn't a ton of variation (tho there's certainly more than in BoI), they all feel distinct, which makes navigating a breeze. in addition the different mech suits can drastically alter the game (one even has a feature where time doesn't move unless you do) and the extensive mod support, difficulty options, etc mean tons of customization and replayability. \n\nthe devs are a bit unbelievable in terms of support, within an hour of making a forum post i had a response from the lead dev and by the time i sat down to play next evening, the issue had already been patched out. if i had to pick a flaw, i'd say the UI looks a little small (at least on my computer), but i adjusted quickly. and given the number of bullets on screen, the choice makes total sense. \n\noverall i think this title stands its own with the best action roguelites out there, and does more than enough different to make a unique experience worth checking out even if you already have played/are playing other titles in the genre. 9.5/10", "timestamp_created": 1454048504, "timestamp_updated": 1454049152, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20820381": {"recommendationid": "20820381", "author": {"steamid": "76561198010876048", "num_games_owned": 354, "num_reviews": 14, "playtime_forever": 119, "playtime_last_two_weeks": 0, "last_played": 1454945178}, "language": "english", "review": "If Geometry Wars and Binding of Isaac had a baby...\n\n...it would look like this gem. Throw in lots of interesting bullet hell patterns for bosses and minibosses as well as five different difficulty levels to adjust the game to your skills and you know what to expect.\n\nHighly recommended!", "timestamp_created": 1454048170, "timestamp_updated": 1454048170, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20820345": {"recommendationid": "20820345", "author": {"steamid": "76561198009918681", "num_games_owned": 278, "num_reviews": 7, "playtime_forever": 183, "playtime_last_two_weeks": 0, "last_played": 1485586281}, "language": "english", "review": "I bought this game because it was on my wishlist and I came to know that the devs cannot wait for me to get around to purchasing later.\n\n10/10 would support again (and sooner!).", "timestamp_created": 1454047933, "timestamp_updated": 1454047933, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20820270": {"recommendationid": "20820270", "author": {"steamid": "76561198025212892", "num_games_owned": 174, "num_reviews": 1, "playtime_forever": 420, "playtime_last_two_weeks": 0, "last_played": 1483401468}, "language": "english", "review": "Fantastic game. It is like Binding of Isaac and a SHMUP had a baby. 10/10, would recommend.", "timestamp_created": 1454047395, "timestamp_updated": 1454047395, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20819931": {"recommendationid": "20819931", "author": {"steamid": "76561198123594863", "num_games_owned": 524, "num_reviews": 40, "playtime_forever": 446, "playtime_last_two_weeks": 0, "last_played": 1470472564}, "language": "english", "review": "[b]Starward Rogue[/b] is a rogue-like/twin stick shooter/dungeon crawler hybrid in the vein of a sci-fi reskinned [b]The Binding Of Isaac[/b]. It shares a lot in common with [b]BOI[/b] including multiple starting characters, collectable upgrades, shops, variable boss encounters and randomly generated maps. \nThe action however is much faster paced and strays quite frequently into [i]bullet hell[/i] territory. I'm a big fan of this style of game (also see [b]Cryptark[/b]) and recommend it to anyone looking for some easy drop in drop out fun!\n\nI still don't understand where Rodney fits into all of this!", "timestamp_created": 1454045416, "timestamp_updated": 1454045542, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20818698": {"recommendationid": "20818698", "author": {"steamid": "76561197993185682", "num_games_owned": 661, "num_reviews": 9, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1484123153}, "language": "english", "review": "Great game, just enough depth and difficulty for a roguelite so far, and with multiple characters and options I'll likely be playing it in bursts for quite a while. Definitely worth the cost.", "timestamp_created": 1454039498, "timestamp_updated": 1454039498, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20818001": {"recommendationid": "20818001", "author": {"steamid": "76561197969856830", "num_games_owned": 756, "num_reviews": 8, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1454012721}, "language": "english", "review": "Playing this as an older gamer, I was worried how I would do with a SHMUP roguelike. I'm a turn-based guy these days. But honestly, put this game on Easy or Very Easy and it's a fun challenge for, shall we say, reflex-challenged gamers who still fondly remember 80's arcade SHMUPs. :-) The level design is solid and the enemies are quite creative. You have to manage your ammunition as well as health, and you can't just mash fire buttons and get through. Some thought is required while dodging, you have to constantly plan your next target, attack angle, weapon choice and movement.\n\nIf you're worried that this is a reflex-based game, the more forgiving difficulties don't take away the fun, and it has a challenge for the brain as well as the spine. I didn't expect to really enjoy this, but I do; it's got that roguelike magic \"let's see how far I can get *this* time\" feeling.\n\nGood job Arcen!", "timestamp_created": 1454036058, "timestamp_updated": 1454036058, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.504750", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20817824": {"recommendationid": "20817824", "author": {"steamid": "76561197984646912", "num_games_owned": 324, "num_reviews": 3, "playtime_forever": 752, "playtime_last_two_weeks": 0, "last_played": 1484364399}, "language": "english", "review": "Stop buying endless CoD sequels and try something new.", "timestamp_created": 1454035255, "timestamp_updated": 1454035255, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.499981", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20816447": {"recommendationid": "20816447", "author": {"steamid": "76561198172805782", "num_games_owned": 99, "num_reviews": 20, "playtime_forever": 3042, "playtime_last_two_weeks": 0, "last_played": 1481613838}, "language": "english", "review": "As you can see, I have a decent chunk of time in this game.\n\nI absolutely adore this game; sure it's not the prettiest game, and sure the music is a little grating after several hours, but this game is actually VERY well designed. I love rougelites, but most of them do not offer a ton of varied strategy in approaching a win; generally you don't get many options, and the options you do get are dealing with the items/situations handed to you. This game gives you a ton of options each run. Do I take more damage? I could, but I have such little health! Or, I could forego both and choose to get more credits ($$$) from enemies.\n\nThe devs clearly love this game and are very active on the forum. I asked a question and made a suggestion and it was patched in literally 3 days later. All of the changes since launch have been positive ones, and the game feels well built as is. In an age where games are perpetually in Early Access, having a roguelike/roguelite that is a complete product is also a major bonus.\n\nAnd of course, this game is a LEGITIMATE bullet hell. Trust me. Turn the difficulty settings up if you don't believe me. Some of those boss fights are completely insane D:.", "timestamp_created": 1454028447, "timestamp_updated": 1454028447, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.499504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20815378": {"recommendationid": "20815378", "author": {"steamid": "76561197975881559", "num_games_owned": 277, "num_reviews": 16, "playtime_forever": 912, "playtime_last_two_weeks": 0, "last_played": 1457053029}, "language": "english", "review": "Pros: \nBinding of Isaac but with mechs and less frustrating upgrades and stores\nIt's fun!\n\nCons: \nArt direction is straight out of early 2000s Flash games-nothing about it stands out as unique\nSoundtrack is disappointingly generic\nSome room and obstacle design slows down gameplay more than I'd like", "timestamp_created": 1454023791, "timestamp_updated": 1454023791, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20813205": {"recommendationid": "20813205", "author": {"steamid": "76561198119831914", "num_games_owned": 228, "num_reviews": 1, "playtime_forever": 64, "playtime_last_two_weeks": 0, "last_played": 1454772502}, "language": "english", "review": "This game is awesome. Buy it to support Developer.\nAnd thanks for linux Support.", "timestamp_created": 1454016099, "timestamp_updated": 1454016099, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.482659", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20813169": {"recommendationid": "20813169", "author": {"steamid": "76561197985073430", "num_games_owned": 732, "num_reviews": 23, "playtime_forever": 568, "playtime_last_two_weeks": 0, "last_played": 1454879996}, "language": "english", "review": "Ees great!", "timestamp_created": 1454015981, "timestamp_updated": 1454015981, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496797", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20812429": {"recommendationid": "20812429", "author": {"steamid": "76561198007692969", "num_games_owned": 196, "num_reviews": 12, "playtime_forever": 823, "playtime_last_two_weeks": 0, "last_played": 1470507005}, "language": "english", "review": "Fun 2d shooting game with procedurally generated content. Lots of variety in mechs, difficulty, items and foes. Games take about 60-90 minutes to complete. At first I thought the music was cheesey but now I can't get it out of my head after I stop playing. A bargain at $10.", "timestamp_created": 1454013578, "timestamp_updated": 1454013578, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.498469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20812051": {"recommendationid": "20812051", "author": {"steamid": "76561198008784747", "num_games_owned": 700, "num_reviews": 55, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1454412610}, "language": "english", "review": "Pretty cool game, mix Smash TV with Bionic Dues.", "timestamp_created": 1454012478, "timestamp_updated": 1454012478, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.516293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20808978": {"recommendationid": "20808978", "author": {"steamid": "76561198025078479", "num_games_owned": 423, "num_reviews": 3, "playtime_forever": 2548, "playtime_last_two_weeks": 0, "last_played": 1504940279}, "language": "english", "review": "I am in love with this game right now. It has similar features of binding of isaac and nuclear throne but it has a few features of its own too.\n        -Multiple characters, aka mechs, for a different playstyle on every run\n        -Hundreds of items so each run is different\n        -Bullet hell bosses that make you just want to weep in your beer\n        -An amazing soundtrack to keep you sane through those dodges\n\nThe devs are very active on the forums and tend to get their bugfixes out fairly quickly too.", "timestamp_created": 1454003826, "timestamp_updated": 1454003826, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.524301", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20807928": {"recommendationid": "20807928", "author": {"steamid": "76561198004976430", "num_games_owned": 372, "num_reviews": 1, "playtime_forever": 197, "playtime_last_two_weeks": 0, "last_played": 1454014931}, "language": "english", "review": "Do you like roguelites with a sense of progression?\nDo you really like bullet hells?\nI recommend giving this a shot.  Espcially if you've played Binding of Isaac(BoI) or Nuclear Throne(NT).\n\nIf there is one thing I have to give props for Arcen games beyond all else, it has to be consistently making games that feel unique, even in a genre (shump roguelite) that's been getting more and more attention as of late.\n\nIt focuses more on the bullet hell aspect, which is something that I didn't know that I wanted, but was sorely needed.  It does have the same design beats with keys and missiles that essentially act like bombs that can access secret rooms.  And it has NT's perk system when you level up.  Keep in mind though that for better or worse you can't break a run by getting essentially infinite items like in BoI.\n\nThe level design is fairly well done with the battles usually having some twist to them in terms of obstacles and layout.  The background graphics for the game can look a bit busy though, which means that you won't be able to instantly grasp what needs to be done in the room (like dodging spikes for instance).  However, you can easily see the bullets against the background, which has been a problem with some more colorful shmups.\n\nThe music is appropriately techno and fits with the mecha aesthetic.  Other than the menu (where you control the cursor with the control stick), the game works well on a controller, which is a plus.\n\nThere's also future support coming from the company itself.  And there's an active modding community that's been constantly adding more variety to the base game.  All Arcen has to do is to curate it before the created content gets patched in.\n\nSo it's not a clone.  Starward Rogue has its own take while still cherry picking the best of others in the genre.\n\nA solid 8/10 that scratches an itch I've had for a while and a likely candidate for that part in my game library where I never uninstall.", "timestamp_created": 1454000607, "timestamp_updated": 1454000607, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.526823", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20807346": {"recommendationid": "20807346", "author": {"steamid": "76561197963838817", "num_games_owned": 178, "num_reviews": 20, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1467056272}, "language": "english", "review": "4/5 - splendid (first impressions)", "timestamp_created": 1453998607, "timestamp_updated": 1453998607, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.499481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20806810": {"recommendationid": "20806810", "author": {"steamid": "76561198003198957", "num_games_owned": 207, "num_reviews": 3, "playtime_forever": 1970, "playtime_last_two_weeks": 0, "last_played": 1474230325}, "language": "english", "review": "A rouge-like bullet-hell that plays to the strengths of both. \n\nThis is not your father's rouge-like. \nWith older rouge-likes you have to sacrifice aesthetics for diversity, not so in star-ward rouge.\nWith older rouge-likes you have to explore a hundred rooms to find something interesting, not so in star-ward rouge.\nWith older rouge-likes you have to play dozens of hours to get your head around the basics, not so in star-ward rouge.\nWith older rouge-likes combat was boring, not so in star-ward rouge.\n\nThe core design of star-ward rouge, is that each room is an 'arena' and each level is required to have a set list of rooms. This means that while each level is different you are guaranteed to have an interested run every time. It also prevents you from being starved of interesting items/abilities because a shop keeper has spawned yet.\n\nIn short, if you like bullet-hells this game is for you. If you think games like crawl, but think they could use more accessibility this game is for you.", "timestamp_created": 1453996710, "timestamp_updated": 1453996710, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.500519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20806197": {"recommendationid": "20806197", "author": {"steamid": "76561198277911276", "num_games_owned": 62, "num_reviews": 6, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1499612135}, "language": "english", "review": "support arcen games.", "timestamp_created": 1453994534, "timestamp_updated": 1453994534, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20804995": {"recommendationid": "20804995", "author": {"steamid": "76561197982121255", "num_games_owned": 701, "num_reviews": 33, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1453945401}, "language": "english", "review": "I’ve followed this interesting developer for a few games now, most notably A Valley Without Wind and its sequel: two games that fused, oddly enough, turn-based strategy with Metroidvania-esque platform shooting. Arcen’s latest game Starward Rogue continues the dev’s tradition of fusing disparate genres together, in this case arcade shooters and roguelikes.\n\nI say “disparate”; Starward Rogue isn’t the first game to combine roguelike elements with a shoot ’em up core, but it is the first I recall seeing designed around the principles of Japanese-style arcade shooters, particularly those of the “bullet hell” variety. That means intense, complex bullet patterns that you need to navigate through as well as enemies to defeat, and it makes for an exciting, very interesting take on a genre that all too often coasts along without any real innovation.\n\nStarward Rogue casts you in the role of a severed head in a mech as you attempt to rescue someone called Rodney from the depths of a dungeon called the Megalith. I believe these two elements are a reference to one of Arcen’s other games, but it’s one I’m not familiar with at this time. Fortunately, no real knowledge of whatever the other game it’s referring to is required; it’s simply a bit of fanservice for those who have played the game’s spiritual predecessor. Rodney is an entertaining character in his own right, though my only direct contact with him so far has been in the tutorial sequence.\n\nStarward Rogue‘s gameplay is balanced nicely between exploration and action. Each level of the Megalith is split into discrete rooms, each of which has to be cleared of enemies before you can move on to the next one. Unlike similar games such as The Binding of Isaac, though, Starward Rogue’s rooms are often more than a screen wide and tall, and there are a number of unique designs and layouts that you’ll encounter over the course of the game, which are then combined with various enemy and trap waves — the latter tending to be non-destroyable obstacles or gun turrets that will spew out hot fiery death as you try and take down the enemies, then deactivate when you’ve cleared the room.\n\nLevelling up is a simple process: no stat allocation here, simply pick one of three randomly selected perks. These vary from increased damage to having a full map available from the start of the floor — and even being able to skip the rest of the floor you’re on. Alongside these passive bonuses you get from levelling, you can also equip and upgrade your infinite-ammo main gun, your recharging Energy-based weapon (which recharges when you enter a new room) and your limited-ammo Missile weapon. There are also various other passive upgrades you can collect, and one-shot consumable items that generally have some sort of “smart bomb” effect.\n\nMuch like the aforementioned The Binding of Isaac, Starward Rogue is a game intended to be replayed and rechallenged. There are a number of different mechs with which to play the game, and there’s a checklist of enemies and items you’ve found over the course of all your runs. There are also five difficulty levels to choose from, with Very Easy all but guaranteeing a full clear run unless you are the very worst kind of incompetent moron, and the highest difficulty claiming to offer difficulty on a par with the legendary Touhou series. And on top of that there are a bunch of achievements to earn, too, so it’s very much a game that will keep you busy for a long time if you get it — though it’s accessible enough to be able to pick up every so often for a quick blast even if you’ve left it alone for a while.\n\nI completed a Very Easy run earlier — there’s no shame in starting either a roguelike or a shoot ’em up on the lowest difficulty, and this game is both! — and am already looking forward to giving it another shot soon. If you’re a fan of The Binding of Isaac and its ilk — “roguelites”, to use the popular term — then you could do far worse than give Starward Rogue a look.", "timestamp_created": 1453990200, "timestamp_updated": 1453990211, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.499504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20804540": {"recommendationid": "20804540", "author": {"steamid": "76561197972011136", "num_games_owned": 811, "num_reviews": 329, "playtime_forever": 60, "playtime_last_two_weeks": 0, "last_played": 1455025582}, "language": "french", "review": "Le jeu propose du contenu et map aléatoire.\nUn jeu un peu difficile quand même, et la souris pour viser est trop libre et ne tourne pas sur un axe et souvent l'on ne sait plus où est la souris donc le viseur.", "timestamp_created": 1453988592, "timestamp_updated": 1453988592, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20801649": {"recommendationid": "20801649", "author": {"steamid": "76561197968730214", "num_games_owned": 224, "num_reviews": 7, "playtime_forever": 3522, "playtime_last_two_weeks": 0, "last_played": 1507776139}, "language": "english", "review": "This is a solid, fun twin stick bullet hell shooter.\nIt also includes flexible difficulty mode, an everything unlocked mode and six save slots to mess around with.\nI enjoy it and recommend it.", "timestamp_created": 1453975049, "timestamp_updated": 1453975049, "voted_up": true, "votes_up": 25, "votes_funny": 1, "weighted_vote_score": "0.665388", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20800439": {"recommendationid": "20800439", "author": {"steamid": "76561198004393508", "num_games_owned": 1270, "num_reviews": 30, "playtime_forever": 520, "playtime_last_two_weeks": 0, "last_played": 1470434725}, "language": "english", "review": "Starward Rogue is fun, and worth your time and money.\n\nIt's a cross between Binding of Issac and Touhou, wherein you play as a mech shooting your way through five big levels of this starship, grabbing items and upgrades while you learn to better avoid the bullet hell patterns from the enemies. There's a solid range of difficulty levels, from easy to the forthcoming Misery mode, and I found Normal to be nicely balanced for me, and I'm merely decent at bullet hell games.\n\nThere are six mechs that change the gameplay in small (weapon changes) to huge ways - one mech will stop time unless you move or shoot, turning the game into this weird combination I'd call tactical, turn-based bullet-hell. I haven't seen anything like it, and I adore it - threading the needle to fight the bosses poses some tense questions - dodge or inflict more damage. But I digress: the standard mech is more than fun enough, presenting fast gameplay that caught me in the trap of \"one more level!\"\n\nYour mech is armed with the standard bullet hell style infinite ammo shooter that you can aim with the mouse, a missile launcher, and an energy weapon that varies by mech - the basic mech has a bouncing ball of bullets, while the time-stop one has a machine gun burst.\n\nThere's a huge variety of weapons and items - I found myself a ghostly sword that would erase bullets directly in front of me at regular intervals, and I learned to love it - up until I got sloppy with a third floor boss and died. Whoops!\n\nThe levels are randomly generated pre-made rooms - some are mazes, some are open arenas, some have laser traps and other complications, and they're populated with a huge variety of enemies, each with their own bullet patterns.\n\nNow - flaws. The music is good, but you'll hear the same tracks multiple times while playing.\n\n... That's it. That's all I've got. The game seems balanced so far, I'm having a blast playing it, and the graphics are great. There's a nonobtrusive plot, the tutorial does its work, and I was able to easily put the game into windowed mode.\n\n[b]tl;dr[/b] It's a top-down bullet hell shooter with roguelite elements with a lot of variety that presents some interesting twists on the genres - AND it's fun to play. Check it out!", "timestamp_created": 1453967529, "timestamp_updated": 1453967529, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.501458", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20798571": {"recommendationid": "20798571", "author": {"steamid": "76561198099261814", "num_games_owned": 166, "num_reviews": 3, "playtime_forever": 1105, "playtime_last_two_weeks": 0, "last_played": 1477195760}, "language": "english", "review": "Perfect amount of dub-wub. Too much kills the soul, a little amount can enlarge it.", "timestamp_created": 1453955126, "timestamp_updated": 1453955126, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.499481", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20792776": {"recommendationid": "20792776", "author": {"steamid": "76561197973026808", "num_games_owned": 3097, "num_reviews": 40, "playtime_forever": 323, "playtime_last_two_weeks": 0, "last_played": 1461680958}, "language": "english", "review": "Honestly the graphics turned me off a bit when I first discovered this title, but since it came highly recommended by a befriended shmup'o'holic I decided to give it a try. I'd further like to elevate that this little gem comes with a very reasonable pricetag.\n\nLet's start by saying that Starward Rogue is really overwhelming cool!  The bullet patterns are sheer madness and indicate that whosoever did them really did his homework properly and thus developed a unique approach to something well known and liked.\n\nThe coreplay itself is very fast and fluid, a difficulty setting and different types of armor make it very approachable for beginners and long-term-fans to the genre as well. The vast amount of different weapon, perk and skill combinations make it become a decent overall gaming experience that due to it's clever but simple design comes with tons of replay value. \n\nA great plus is that some of the actual game content is inspired by it's community. On top of that the developers have a very active external forum that includes the most precise and cool changelists I came across so far. Updates seem very frequently and are rolled out quick. \n\n6 Different saveslots, not like Nihon Falcom but still very much appreciated and certainly enough.\n\nComes with MOD support, and even though I got no clue were to get them and what they will do you are able to redeem ingame codes as well.   \n\nTLDR if you like shmups or always wanted to experience first handed how it feels to get your brain melted by dancing through a multi coloured ocean of bullets this is a blindhit, go, buy, enjoy.\n\nLast but not least, thanks to my mate \"Fishsticks\" for giving me a poke into this games direction!", "timestamp_created": 1453927589, "timestamp_updated": 1453986178, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.501939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20791592": {"recommendationid": "20791592", "author": {"steamid": "76561198077452684", "num_games_owned": 84, "num_reviews": 29, "playtime_forever": 586, "playtime_last_two_weeks": 0, "last_played": 1511403979}, "language": "english", "review": "This is basically binding of isaac with schump gameplay which works surprisingly well. Only negative thing I can think of is the game has some clarity issues.", "timestamp_created": 1453923363, "timestamp_updated": 1453923363, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20781508": {"recommendationid": "20781508", "author": {"steamid": "76561197973172334", "num_games_owned": 283, "num_reviews": 48, "playtime_forever": 1035, "playtime_last_two_weeks": 85, "last_played": 1513751856}, "language": "english", "review": "Downloaded Starward Rogue this evening.  Truth be told I was not expecting much....5 hours later I had to force myself to to quit and that is a good thing folks. \n\nI never could get into Binding of Isaac because of the odd theme but I can definitely get into Starwards mech/space theme! \n\nLove the enemy shot patterns as well.  They really give you something to think about.  Starward Rogue is a one of a kind twin stick/bullethell/rouguelite with an excellent soundtrack to boot.  I will definitely be spending some time with this gem.", "timestamp_created": 1453882086, "timestamp_updated": 1453926622, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.603474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20778402": {"recommendationid": "20778402", "author": {"steamid": "76561197965653581", "num_games_owned": 1752, "num_reviews": 23, "playtime_forever": 416, "playtime_last_two_weeks": 0, "last_played": 1453679234}, "language": "english", "review": "Having fun with your game.\n\nSURPRISE, IT'S NOT SHOVELWARE\n\nGet in here people, let's take that jouney, back to hardcore 90's desktop gaming.", "timestamp_created": 1453862367, "timestamp_updated": 1453862367, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20777577": {"recommendationid": "20777577", "author": {"steamid": "76561197995619490", "num_games_owned": 73, "num_reviews": 4, "playtime_forever": 405, "playtime_last_two_weeks": 0, "last_played": 1477194751}, "language": "english", "review": "Amazing Game, Endless hours of gameplay, Huge amounts of diversity and complexity. This game is a must buy. This game has Level ups and perks its just beautiful. The day i see this game get its first negative reveiw is when i go postal.", "timestamp_created": 1453858175, "timestamp_updated": 1453858175, "voted_up": true, "votes_up": 23, "votes_funny": 9, "weighted_vote_score": "0.621408", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20776803": {"recommendationid": "20776803", "author": {"steamid": "76561198258026450", "num_games_owned": 7, "num_reviews": 1, "playtime_forever": 591, "playtime_last_two_weeks": 0, "last_played": 1453947768}, "language": "english", "review": "This is the first review I've ever written on Steam.  I highly recommend this game - great music, good action, interesting variety in mechs / equip / stacking potential, interesting rooms & boss patterns...  If you like shooting things, Nuclear Throne, or good music, this game is totally worth a shot.", "timestamp_created": 1453853939, "timestamp_updated": 1453853939, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20775643": {"recommendationid": "20775643", "author": {"steamid": "76561197984931409", "num_games_owned": 167, "num_reviews": 2, "playtime_forever": 720, "playtime_last_two_weeks": 0, "last_played": 1485560407}, "language": "english", "review": "This game is very enjoyable and full of detail.  The developers support history makes me excited for the future of this game.  (Also what modders come up with).", "timestamp_created": 1453848713, "timestamp_updated": 1453848713, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503610", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20773343": {"recommendationid": "20773343", "author": {"steamid": "76561198037580833", "num_games_owned": 16, "num_reviews": 7, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1480737963}, "language": "english", "review": "Good concept, good game. Levels are interesting and decently complex, and enemies always keep you on your toes.\nI think this game is worth a buy =).", "timestamp_created": 1453839973, "timestamp_updated": 1453839973, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.500023", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20770268": {"recommendationid": "20770268", "author": {"steamid": "76561197973688641", "num_games_owned": 408, "num_reviews": 19, "playtime_forever": 150, "playtime_last_two_weeks": 0, "last_played": 1453912838}, "language": "english", "review": "Probably one of Arcen's most polished and accesible titles (Tidalis would be competition in that regard).  I'm having fun so far, thought the tutorial needed a bit of work but haven't run in to any problems anywhere else.  Made it to final floor first try of normal so now that I know what I'm doing I'm excited to jump back in on Hard.  My largest complaint is that it isn't an AI War expansion pack and I miss when half or more of the company's time was spent perfecting and adding to that gem.", "timestamp_created": 1453830101, "timestamp_updated": 1453830101, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.505196", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20768021": {"recommendationid": "20768021", "author": {"steamid": "76561198024978690", "num_games_owned": 964, "num_reviews": 13, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1454088566}, "language": "english", "review": "Binding of Isaac in space, with mechs and a neat OST.", "timestamp_created": 1453822229, "timestamp_updated": 1453822329, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20765247": {"recommendationid": "20765247", "author": {"steamid": "76561198044832394", "num_games_owned": 674, "num_reviews": 16, "playtime_forever": 615, "playtime_last_two_weeks": 0, "last_played": 1461598529}, "language": "english", "review": "I've never really played shmups, twin-stick shooters or bullet hell games, but I love this.  It's so much fun.  I'm also incredibly bad at this game; I've only got off the first level twice and have died countless times.  Mostly on Very Easy.\n\nI'm having a blast.  Literally.", "timestamp_created": 1453812128, "timestamp_updated": 1453812128, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.525578", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20762430": {"recommendationid": "20762430", "author": {"steamid": "76561197993930568", "num_games_owned": 4459, "num_reviews": 350, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1453799292}, "language": "english", "review": "SciFi-themed isaac-like. Pretty hard. Great sound effects and music. Plays well with mouse or 360 pad (my preferred method for this game).\n\nThe different main characters/ships/suits you can pick are really cool too, especially the one that has time not moving except when you do.\n\nI recommend this game. Arcen are in financial trouble right now and every sale is valuable to them. https://arcengames.com/great-work-on-starward-rogue-team-now-youre-all-laid-off/", "timestamp_created": 1453799370, "timestamp_updated": 1454087606, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.520672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20760870": {"recommendationid": "20760870", "author": {"steamid": "76561197999293669", "num_games_owned": 222, "num_reviews": 4, "playtime_forever": 940, "playtime_last_two_weeks": 0, "last_played": 1454466167}, "language": "english", "review": "Ill keep it short and sweet. Utterly fantastic game. As someone who bounced off of \"The Binding of Issac\" and \"Nuclear Throne\" I fell completely in love with this one.  Difficulty for players of all experiences. Also and completely varied selection of ships that can change the game completely either easier or harder.  Just brilliant. Worth buying at full price.", "timestamp_created": 1453788659, "timestamp_updated": 1453788659, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20758317": {"recommendationid": "20758317", "author": {"steamid": "76561197970278686", "num_games_owned": 321, "num_reviews": 17, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1454047196}, "language": "english", "review": "Fun.  Put a classic SHMUP like Robotron 2084 into space; you face lots and lots of shooty streams.", "timestamp_created": 1453773086, "timestamp_updated": 1453773086, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.561753", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20755387": {"recommendationid": "20755387", "author": {"steamid": "76561198020007485", "num_games_owned": 341, "num_reviews": 18, "playtime_forever": 317, "playtime_last_two_weeks": 24, "last_played": 1513881972}, "language": "english", "review": "Fun little game. lot of replayability. Different bots available on start with varied gameplay.", "timestamp_created": 1453759904, "timestamp_updated": 1453759904, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20743015": {"recommendationid": "20743015", "author": {"steamid": "76561197970153763", "num_games_owned": 566, "num_reviews": 55, "playtime_forever": 832, "playtime_last_two_weeks": 0, "last_played": 1473926265}, "language": "english", "review": "Great game, very relaxed pacing and lots of interesting stuff + good gameplay. I prefer it it to games like Isaac because I hate the controls in those games. Aiming w/the mouse is much better. Also good music/sound.\n\nArcen ftw.", "timestamp_created": 1453709845, "timestamp_updated": 1453709845, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.478261", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20742822": {"recommendationid": "20742822", "author": {"steamid": "76561198108269527", "num_games_owned": 2345, "num_reviews": 74, "playtime_forever": 1490, "playtime_last_two_weeks": 0, "last_played": 1501834859}, "language": "english", "review": "Yet another excellent roguelite 2d shooter. This one has several mechs to choose from with a different playstyle for each mech (truly differentiated playstyles, like a mech that stops time when it is not moving, among others), perks each time you level up that improve your mech, and many upgrades and different weapons that you can pick up on your way through the labyrinth. The shooting mechanics are reminiscent of bullet-hell games, everything else is fairly standard roguelite. Very well done and fun to play.", "timestamp_created": 1453709051, "timestamp_updated": 1453709051, "voted_up": true, "votes_up": 15, "votes_funny": 1, "weighted_vote_score": "0.513474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20739822": {"recommendationid": "20739822", "author": {"steamid": "76561198062548490", "num_games_owned": 183, "num_reviews": 3, "playtime_forever": 426, "playtime_last_two_weeks": 0, "last_played": 1485718906}, "language": "english", "review": "This game reminds me a lot of Binding of Isaac. It is a very challenging game but every time I die I feel like I progressed. The gameplay is very fun and the characters are varied. about a 9/10. Terrific.", "timestamp_created": 1453691880, "timestamp_updated": 1453691880, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.500110", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20728978": {"recommendationid": "20728978", "author": {"steamid": "76561198023784016", "num_games_owned": 314, "num_reviews": 31, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1486193888}, "language": "english", "review": "This game is fun as hell", "timestamp_created": 1453653196, "timestamp_updated": 1453653196, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.482791", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20718668": {"recommendationid": "20718668", "author": {"steamid": "76561197962278826", "num_games_owned": 2117, "num_reviews": 25, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1453616806}, "language": "english", "review": "This is where good bullets go when they die.", "timestamp_created": 1453616860, "timestamp_updated": 1453616860, "voted_up": true, "votes_up": 5, "votes_funny": 10, "weighted_vote_score": "0.485250", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20717733": {"recommendationid": "20717733", "author": {"steamid": "76561197971135177", "num_games_owned": 680, "num_reviews": 15, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1454214248}, "language": "english", "review": "Starward Rogue is right in the sweet spot of difficult enough to keep trying, without being so punishing that I want to quit. The controls are very tight; I never feel like I have to fight with the controls and can just enjoy the game. I continue to enjoy the work that Arcen puts into their games. Starward Rogue was a happy surprise to find this week. \n\nCurrently there are six different suits for your Hydral's head. They all play very differently as they have varying strengths, weaknesses, and weapons. The most unique of which has very low health, and no shields, but enemies only move when you are moving or shooting yourself. It makes for a very different pace, but with such low health there is basically no room for error.\n\nI look forward to see how this game evolves; Arcen has provided a full mod interface right from the get go. It'll be interesting to see what the community and Arcen adds to the game over time.", "timestamp_created": 1453612347, "timestamp_updated": 1453612347, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.559988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20711477": {"recommendationid": "20711477", "author": {"steamid": "76561197972340846", "num_games_owned": 674, "num_reviews": 20, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1453847966}, "language": "english", "review": "This is a wonderful game.  I haven't played too far yet, still trying to beat the first level boss.  But, it's an excellent design, chock full of bullet-hell, shoot 'em up and exploration goodness.  There appears to be a ton of different weapons and power-ups, and the enemy patterns are very unique and challenging.\n\nI'm a slow, old guy who generally sucks at this kind of game, but I love them so much.  This is definitely one I will be playing for a long time.  The controls are precise and work very well with either  mouse/keyboard or controller.\n\nOh, and the music is top notch!  \n\nI think this could easily be my favorite Arcen game.", "timestamp_created": 1453586553, "timestamp_updated": 1453594153, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.692953", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20707533": {"recommendationid": "20707533", "author": {"steamid": "76561198004519892", "num_games_owned": 240, "num_reviews": 27, "playtime_forever": 1677, "playtime_last_two_weeks": 0, "last_played": 1505674023}, "language": "english", "review": "If you like roguelites, Binding of Isaac, Risk of Rain and similar games, GET THIS! This game pulled me in from the first second with it's easy to grasp, easy to get into gameplay. Hard to master, easy to get into. A perfect game. It helps that I'm a bit of a roguelike/SHMUP nut, so this blends genres perfectly. Awesome music keeps you pumped for more.\n\nBullet patterns are creative and easy to see due to contrast, there is no self damage involved and every enemy is distinct and unique. Bosses have multiple phases and difficulty-based bullet patterns. I also absolutely ADORE all the fun little references to Touhou, Dwarf Fortress, Space Invaders and other things you find all over. Tons of fun!\n\nWell done, Arcen+community! Thanks for a great game!", "timestamp_created": 1453575079, "timestamp_updated": 1453575079, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.589169", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20704868": {"recommendationid": "20704868", "author": {"steamid": "76561198064600075", "num_games_owned": 1037, "num_reviews": 24, "playtime_forever": 821, "playtime_last_two_weeks": 0, "last_played": 1486212221}, "language": "german", "review": "Spaßiger 2D-Topdown-Twinstick-Shooter für zwischendurch. Sehr empfehlenswert.", "timestamp_created": 1453567524, "timestamp_updated": 1453582809, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20704808": {"recommendationid": "20704808", "author": {"steamid": "76561198030883717", "num_games_owned": 187, "num_reviews": 1, "playtime_forever": 530, "playtime_last_two_weeks": 0, "last_played": 1455740417}, "language": "german", "review": "Hi,\n\nsoeben auf \"Easy\" durchgespielt mit dem startmech.\n\nfazit: sehr gutes indie game, ähnlich wie binding of isaac. insbesondere sehr guter und passender soundtrack (gibts den iwo zum download?). \n\naber: auch wenn der schwierigkeits grad \"easy\" war, kam es mir als zu einfach vor. außerdem gibt es nur 5 levels - zwar ist der letzte lvl deutlich größer, allerdings hatte ich das gefühl, dass ein run im vergleich zu anderen bekannten indie games (isaac/ftl) eher zu kurz kommt.", "timestamp_created": 1453567353, "timestamp_updated": 1453567353, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20703707": {"recommendationid": "20703707", "author": {"steamid": "76561197987658658", "num_games_owned": 996, "num_reviews": 139, "playtime_forever": 158, "playtime_last_two_weeks": 0, "last_played": 1453971335}, "language": "french", "review": "https://www.youtube.com/watch?v=J_aXmh_iGo4\n\nArcen Games et moi, c'est une histoire qui dure depuis 7 ans.\nça a commencé en 2008 quand j'ai acheté IA Wars, un tower defense /RTS original ou une IA implaccable tente de vous détruire. J'ai accroché au concept et j'ai vécu mes plus belles histoire sur ce jeu, à base de resistance, de victoires et de frustrations.\n\nArcen a continué a sortir des jeux aux concepts variés et originaux, d'un tetris like ( Tidalis)à un jeu de diplomacie galactique ( The last Federation), on ne sait jamais dans quoi on tombe lorsque on achète Arcen, un peu comme une boîte de chocolat.\n\nStarward Rogue vient agrandir cette belle famille : un Sh'mup isaacien.\nDes énnemis qui balancent des projectiles partout sur l'écran (shm'up) mélangé a des \"runs\" courts, du loot, du level, des marchands, des boss, mini-boss et déblocables (isaac)\n\nL'ésthétique est dans la lignée de ce qu'a fait arcen depuis IA Wars (en bien pour moi), la musique idem (le même compositeur depuis le début).\n\nLa difficulté est reglable (de easy a Insane), les robots dispos sont variés dans leur styles (il y en a 6).\nBref, du solide, qui m'a scotché sur l'écran pendant 1h30 d'affilé (fin de mon run), ce qui est signe que le jeu me plait.\n\nDéfauts?Oui \n\n-difficulté de  lisibilité par moment entre nos projectiles et ceux de l'ennemi.\n- Contenu moyen: en 3 h, 22 % du contenu débloqué, je sais pas trop si le reste est aussi rapidement déblocable mais je le signale.\n- salles parfois labirynthique avec peu d'ennemis dedans, c'est pas hyper passionnant...un des soucis de la génération procédurale.\n\nTout est dit, Arcen a un autre projet en cours plus ambitieux et je crois que ce jeu doit permettre de le financer, en partie, du coup j'ai encore moins hésité.\n\nMais au-dela de ça, le concept est agréable, prenant, la musique est excellente, l'esthétique...particulière...mais j'aime. Et la difficulté est au rendez-vous, tout en permettant aux plus nuls de s'n sortir, grâce aux niveaux de difficulté.\n\nMerci Arcen.\n\nEdit: ils continuent a mettre le jeu à jour, nouveaux ennemis, nouveaux objets.\n\nIl manquerait quelques nouvelles musiques en plus.", "timestamp_created": 1453564228, "timestamp_updated": 1455389865, "voted_up": true, "votes_up": 16, "votes_funny": 2, "weighted_vote_score": "0.698312", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20703376": {"recommendationid": "20703376", "author": {"steamid": "76561197970755243", "num_games_owned": 348, "num_reviews": 13, "playtime_forever": 383, "playtime_last_two_weeks": 0, "last_played": 1457789955}, "language": "english", "review": "Nice rogue-lite with serious bullethell sensibilities.", "timestamp_created": 1453563309, "timestamp_updated": 1453563309, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.479042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20701690": {"recommendationid": "20701690", "author": {"steamid": "76561197988662060", "num_games_owned": 558, "num_reviews": 11, "playtime_forever": 123, "playtime_last_two_weeks": 0, "last_played": 1508854315}, "language": "english", "review": "Arcen Game's take on the Binding of Isaac-like genre is pretty damn good! The music's as good as ever, too. Any fan of BoI should check this out, and anyone who didn't like the aesthetic of BoI should pick this up if they are interested in the genre!", "timestamp_created": 1453558462, "timestamp_updated": 1453558462, "voted_up": true, "votes_up": 10, "votes_funny": 1, "weighted_vote_score": "0.520958", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20698841": {"recommendationid": "20698841", "author": {"steamid": "76561197974008645", "num_games_owned": 527, "num_reviews": 61, "playtime_forever": 30, "playtime_last_two_weeks": 0, "last_played": 1453504945}, "language": "english", "review": "Roguelite + Shmup mechanics in a good looking package. It's fun.\nAs someone not very skilled at bullet hell games, I found this rather challenging on normal difficulty.", "timestamp_created": 1453549741, "timestamp_updated": 1453549741, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.540949", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20695399": {"recommendationid": "20695399", "author": {"steamid": "76561198008110769", "num_games_owned": 388, "num_reviews": 5, "playtime_forever": 739, "playtime_last_two_weeks": 0, "last_played": 1513043414}, "language": "english", "review": "Fun Game from what little I've played atm. It has different difficulties to appeal for everyone, I've never played this type of game and easy was well... a tad easy (there's also Very Easy.) Normal so far is pretty challenging but I'm slowly making it further and further with each successive run. Bosses are fun and each one is unique. Depending on how intense you want it you can change the difficulty accordingly, but it does seem each difficulty is a fair amount harder then the previous one (with a total of 5 difficulties atm.)\n\nSo far the game seems like it has a lot of replayability and this would be the perfect type of game to let some hours slip by without you even realizing it or just to do one playthrough, or even just a floor or a room. It's very friendly in that you have plenty of opportunities to jump in and out inbetween combat (I haven't tried doing that in combat yet.)\n\nThe Game starts off with 5 levels but you can unlock two more levels (I haven't done that yet so idk how it's done but from the impression I got you just have to beat the game a couple times.) The Graphics are good and it's easy to distinguish between the background and the neon bullets so that isn't a concern.\n\nStarward Rogue was made by Arcen and all the games I've played by them have been supported well after launch. The Devs are pretty active on their forums (Arcengames.com) so you can stop by their for questions or to chat.  The music was produced by the same person who produces all of Arcens games and it fits extremely well in here imo.\n\nLastly according to some people this feels like a really good Binding of Issac clone (again I haven't played the genre so I haven't played it) so if you like that game you'll probably like this one as a refreshing breather at the minimum.", "timestamp_created": 1453535860, "timestamp_updated": 1453628705, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.547275", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20691587": {"recommendationid": "20691587", "author": {"steamid": "76561197963664525", "num_games_owned": 747, "num_reviews": 89, "playtime_forever": 350, "playtime_last_two_weeks": 0, "last_played": 1473475978}, "language": "english", "review": "First off, let's get this out of the way.\n\nThis is a Binding of Isaac clone. It makes no apologies for it, and neither do I.\n\nThat said, it's an \"excellent\" Binding of Isaac clone. It manages to mesh shoot-em-up tropes really well with the typical loot/dungeon mechanics of that franchise. It never manages to feel like a \"cheap knock off\", and does bring it's own flavor to the roguelike-ish dungeon genre.\n\nRecommended if you like shoot-em-ups, or if you like Binding of Isaac, or both.", "timestamp_created": 1453517055, "timestamp_updated": 1453517055, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.505579", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20688518": {"recommendationid": "20688518", "author": {"steamid": "76561197960677714", "num_games_owned": 1159, "num_reviews": 78, "playtime_forever": 99, "playtime_last_two_weeks": 0, "last_played": 1453681033}, "language": "german", "review": "Starward Rogue ist ein TwinStick-Shooter im Style von \"Binding of Isaac\" würde ich sagen mit dem Zusatz eines Bullethell-Shooter.\nVieles ähnelt sich sehr wie die Shops in denen man Items kaufe kann und Räume in denen Verbesserungen liegen.\nNur das man hier Exp sammelt und auflevelt kommt hier noch dazu.\nMit jedem Level hat man die Möglichkeit ein bestimmtes Randomperk aus dreien auszuwählen wie zb mehr Leben, mehr Missiles, mehr Dmg etc.\n\nMan besitzt eine Primärwaffe mit unendlich Schuss, eine Sekundärwaffe welche Energie abzieht welche sich aber pro Raum immer wieder erneuert und einen Raketenwerfer mit begrenzter Munition die man finden kann.\nAußerdem ist es möglich einen Aufsatz zu finden der dich selber oder deine Waffen verbesser und nen Bonus gibt.\nZuletzt sind da noch die verbrauchbaren Gegenstände welche man findne kann.\nMan kann jeweils einen mitnehmen und diesen auch nur einmal gebrauchen. Der gibt dann einen enormen Vorteil wie zb Dmg und Heilung oder ein schwarzes Loch welches alle Projektile aufsaugt.\n\nApropo Projektile...davon gibt es hier in Starward Rogue jede Menge!\nIn Bullethell-Manier werden hier Geschosse abgefeuert denen es gilt auszuweichen wenn man deren Muster erkennt.\nVorallem bei Bossen gibt es Muster welche man beachten muss um zum richtigen Zeitpunkt am richtigen Platz zu stehen um nicht getroffen zu werden.\nDiese Fusion aus TwinStick-Shooter und Bullethell-Shooter hab ich so noch nie gesehen und bringt frischen Wind ins Genre wie ich finde.\n\nVon der Story her is es halt nichts dolles und meiner Meinung nach auch etwas abgedreht.\nMan ist ein Drachenkopf in einem Roboteranzug (!?!) und schießt in einem riesen Komplex kleine Raumschiffe und große Boss-Raumschiffe ab während man den Projektilen ausweicht.\nGeschafft werden wollen 5 Ebenen um zu seinem Erbauer zu kommen den man aus diesem Megakomplex retten muss.\nJede Ebene besteht aus div. Räumen und einem Bossraum nach dem man weiter zur nächsten Ebene kommt.\nVor jedem Game ist es möglich aus mehreren Robotern auszuwählen...jeder mit eigenen Stärken und Schwächen, anderen Waffen und natürlich anderem Aussehen.\nDann noch den Schwierigkeitsgrad und lets go!\n\nGrafik ist...naja ich sag mal ok.\nFand sie nicht so schön wie bei zb \"Binding of Isaac\" aber es ist ok.\nMan muss sich nur anfangs daran gewöhnen was nun ne Wand ist und die Spikes welche überall rumliegen sind oft schwer zu erkennen im Gefecht.\nDie Bewegungen des Charakters fühlen sich auch ganz ok an aber manchmal hat man das Gefühl dat die Steuerung etwas sehr empfindlich ist.\nAlles in allem ein gutes Spiel für einen guten Preis.", "timestamp_created": 1453504406, "timestamp_updated": 1453504406, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.496338", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20687888": {"recommendationid": "20687888", "author": {"steamid": "76561198048628640", "num_games_owned": 200, "num_reviews": 54, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1465697095}, "language": "english", "review": "I am not one of the fancy beta-testers.  I bought this game with my own money within minutes of looking at the store page.\n\nI haven't put a ton of time into it yet, but it seems like it will be a good game.  Smooth gameplay, fun combat, intuitive controls (I play with a gamepad).\n\nI've been waiting for a game like this for a long time, and I knew when I saw this on Steam releasing in 1 hour I had to buy it.  Impulse decision, but totally worth it.  For the price of a moderately expensive McDonald's meal you can buy this game, and it won't make you fat and will keep you entertained for hours.\n\nEnjoy the distinct drop in calorie intake. :D\n\n9/10\n\n(may edit this in the future after I've put more time in)", "timestamp_created": 1453502018, "timestamp_updated": 1453502044, "voted_up": true, "votes_up": 5, "votes_funny": 5, "weighted_vote_score": "0.455584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20684883": {"recommendationid": "20684883", "author": {"steamid": "76561198023699445", "num_games_owned": 350, "num_reviews": 14, "playtime_forever": 45, "playtime_last_two_weeks": 0, "last_played": 1454093770}, "language": "english", "review": "Long term fan of Arcen games, I see yet another game from them ! Joy !\n\nBasically, as always, some kind of mix between multiple genre that should be doomed to failure, but somehow... works. It's just fun on some kind of level that I lack the words to explain. It's like magic. Here the games takes elements from bullet hell / top-down rogue-likes mostly. Unlike a lot of the \"competition\", it's a finished game from the start, with unlockables, different playstyles, different difficulty levels and fully moddable... and works on something else than windows. Also Arcen has a history of solving and maintaining games for years with high reactivity, and / or adding new \"simple\" free features, or rework the entire game with cheap DLCs.\n\nWhat else to ask from a dev team ?\n", "timestamp_created": 1453492044, "timestamp_updated": 1453492044, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.507657", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
