{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 170, "total_negative": 11, "total_reviews": 181}, "reviews": {"38677591": {"recommendationid": "38677591", "author": {"steamid": "76561198153045246", "num_games_owned": 154, "num_reviews": 40, "playtime_forever": 6, "playtime_last_two_weeks": 6, "last_played": 1514246275}, "language": "english", "review": "Have a genuine SNES controller hooked through USB.\nIn my mid 30s and love Metroid series.  \nCan't even get past the control configuration screen.\nDown is up, up is down, never seen that before... who made this?\nMost confusing screen I've ever seen, in my ENTIRE life and I'm about to be 36.\nCan't recommend this even on sale unless you already have the steam controller it recommends and I don't know anyone who has one of those.  I don't even know how to use one of those new fangled things.\n\nHave been CompTIA cert since '99.  I have built my own PC as recent as 3+ years ago, still using it nary an issue.\nHave configured dozens of other games since I built this - ALL - every LAST one WORKS FINE.\n\nCan't seem to disable joystick in program to let JoytoKey forward it either.  Everything is so setup for the sheeple that the guys that know how to configure things obviously get hung out to dry.\n\nCan't recommend, can't even beat the configuration menu level.  Sure the game is way beyond my ability & I'm in the 98th percentile.", "timestamp_created": 1514247089, "timestamp_updated": 1514247183, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.476190", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38623139": {"recommendationid": "38623139", "author": {"steamid": "76561198059171343", "num_games_owned": 525, "num_reviews": 26, "playtime_forever": 25, "playtime_last_two_weeks": 25, "last_played": 1514123279}, "language": "english", "review": "Fantastic 32-bit artstyle. \nSolid metroidvania gameplay. \n\nIf you are a fan of the genre, there really is no reason to pass this one up. \nIf you've never played a metroidvania style game, this isn't a bad place to start. \n\n", "timestamp_created": 1514123697, "timestamp_updated": 1514123697, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38577617": {"recommendationid": "38577617", "author": {"steamid": "76561197981328872", "num_games_owned": 435, "num_reviews": 37, "playtime_forever": 104, "playtime_last_two_weeks": 104, "last_played": 1514034752}, "language": "english", "review": "Rogue-like and Metroidvania simply DO NOT mix. I really should have paid more attention to the hidden \"Rogue-like\" tag and the game's description before buying. Lesson learned.", "timestamp_created": 1514035156, "timestamp_updated": 1514035156, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38563809": {"recommendationid": "38563809", "author": {"steamid": "76561198044014245", "num_games_owned": 348, "num_reviews": 21, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1507170024}, "language": "english", "review": "Combines two seemingly at-odds genres into something that plays well and makes sense mechanically. Has a pretty nice OST too.", "timestamp_created": 1514010710, "timestamp_updated": 1514010710, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508197", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38431766": {"recommendationid": "38431766", "author": {"steamid": "76561198021487173", "num_games_owned": 280, "num_reviews": 5, "playtime_forever": 1469, "playtime_last_two_weeks": 900, "last_played": 1513700177}, "language": "english", "review": "A Robot Named Fight is a game very inspired by Metroid, and to anyone who has played or enjoyed axiom verge gameplay, I would say this game is right up your alley. The game feel itself is almost note for note \"Super Metroid\", which isn’t a bad thing at all [why fix what isnt broken]\nThe story for a robot named fight is pretty unique and interesting, featuring a decent amount of enemy variety with unique behaviors, a modest assortment of bosses, and a soundtrack with a few hit pieces, and others that are enough to get the job done.\n\nThe layouts and powerups place within each level are procedurally generated, Resulting is a large variety of possible unique playthroughs. One of my favorite experiences with the game is in discovering how all the powerups are going to synergize and work together in any given run.\nThe procedural generation also impacts how much backtracking you may or may not be doing in a run, and how many powerups will be tucked away until the last stretch of a game if you go for that 100% collection rate.\n\nThe game is designed around being able to be replayed multiple times and be enjoyable. A large portion of powerups have to be unlocked, and completing certain achievements in the game gives you a slight chance to start with a powerup or two at the start of any new run. [also randomized] So each new run you end up playing becomes more and more diverse as you unlock content.\n\nAll in all, it boils down to this: If you enjoy Metroid, rougelike platformers, or metroidvania’s, you’ll want to pick this game up. The dev recently released free content patch to the game at the start of december, adding a variety of new items and content to the game, and seems intent on continuing to add to his game moving forward [although there isn’t any mention of this on the store page], but the game is certainly a complete package as is, that may very well become worth even more as time marches forward.\n\n\n", "timestamp_created": 1513695410, "timestamp_updated": 1513695410, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38261421": {"recommendationid": "38261421", "author": {"steamid": "76561198089721705", "num_games_owned": 123, "num_reviews": 21, "playtime_forever": 345, "playtime_last_two_weeks": 66, "last_played": 1513647489}, "language": "french", "review": "Quand Samus s'absente c'est la fin du monde, non serieusement un bon Metroïd/Roguer-like sympathique avec une variété d'objet cacher à trouver, des bons boss à affronter, une ambiance glauque asse sympathique, et les OST sont pas mal aussi. J'apprécie bien se jeux :)", "timestamp_created": 1513099544, "timestamp_updated": 1513099544, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38161745": {"recommendationid": "38161745", "author": {"steamid": "76561198094348487", "num_games_owned": 599, "num_reviews": 1, "playtime_forever": 1945, "playtime_last_two_weeks": 0, "last_played": 1512775925}, "language": "english", "review": "There are many games that use the Metroidvania formula, but most of them don't use the Metroid gameplay.  A Robot Named Fight not only uses the Metroidvania formula, but it also plays just like Super Metroid with Rougelike elements as well.  If you've ever played Super Metroid, then it would be instantly familiar to you how the gameplay is.  \n\nThe rougelike elements that are present are randomly generated maps, randomly placed power-ups, shops that grant upgrades, and perma-death.  Everytime you die you start over from the beginning, which makes dying pretty devastating whenever it happens.  There are unlockables that can be acquired whenever you earn achievements, which makes earning them even more worthwhile.  Once you start unlocking them, then you will most likely see them in a future run.  For example, later playthroughs can have special rooms that will revive you if you can reach and use them before dying.  \n\nThere are many traverse upgrades that you will find to further progress into the game.  There are several variations of each traverse upgrade that perform the same function, but perform differently.  For example, some areas are inaccessable due to the fact that your character can't jump high enough.  You may either get a double jump, or get a high jump in that run to progress further.\n\nPermanent power-ups can be found throughout the whole map, which are similar to stat upgrades like in The Binding of Isaac.  You will need to shoot different parts of the terrain to uncover them, just like in Metroid.  There are also different allies that you will come across that can help you with upgrades and items if you provide them the scrap they need to make it.  The allies act as the shops of the game.\n\nThe game can last around between 45 minutes to 1 hour in each playthrough, or even shorter depending on how fast you can get through the game.  The game can also be played in local co-op where a friend can control an orb that can fire at enemies for you.  For $10 it's an easy recommendation to anyone who loves to play Super Metroid, and anyone that loves Metroidvania games in general.", "timestamp_created": 1512764160, "timestamp_updated": 1513204398, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.572089", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38128202": {"recommendationid": "38128202", "author": {"steamid": "76561197970788776", "num_games_owned": 365, "num_reviews": 6, "playtime_forever": 3270, "playtime_last_two_weeks": 0, "last_played": 1512709301}, "language": "english", "review": "The lovechild of Super Metroid and Binding of Isaac.\n", "timestamp_created": 1512651772, "timestamp_updated": 1512651772, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38067964": {"recommendationid": "38067964", "author": {"steamid": "76561197984733975", "num_games_owned": 352, "num_reviews": 1, "playtime_forever": 736, "playtime_last_two_weeks": 0, "last_played": 1512865199}, "language": "english", "review": "Simply put, one of the best metroidvania style game available on Steam, roguelike or not.", "timestamp_created": 1512432212, "timestamp_updated": 1512432212, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37905794": {"recommendationid": "37905794", "author": {"steamid": "76561197970399529", "num_games_owned": 2849, "num_reviews": 3, "playtime_forever": 704, "playtime_last_two_weeks": 0, "last_played": 1511744797}, "language": "english", "review": "An absolutely true Metroid Roguelite experience!\n\nA map is generated with 4 areas, start, hub, and two other areas.  Kill the boss of each area get a sigificant upgrade item, picking up any minor powerups along away, then go to the end and kill the big meat monster.  \n\nI've already beaten the game 5 times, out of 15 or 20 or so, and I have yet to get all the power up items, since not all items will show up in every run, and every enviromental hazzard will show up everytime either.  Each run should take you no longer than 80 minutes to complete or die horribly on, so each play though never over stays its welcome like so many other roguelites I've played in the past.\n\nVery Hightly recommended!", "timestamp_created": 1511891544, "timestamp_updated": 1511891544, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.526593", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37823907": {"recommendationid": "37823907", "author": {"steamid": "76561198070704803", "num_games_owned": 182, "num_reviews": 2, "playtime_forever": 1444, "playtime_last_two_weeks": 0, "last_played": 1511676491}, "language": "english", "review": "A Robot Named Fight does very well what few other games do, mixing 2 genres as different as metroidvania (set maps, power up gating, sense of progression) and roguelite (random selection of weapons, map layouts and bosses each run). Think a progression system like the one of Binding of isaac on a metroidvania for short\nAt launch you can feel the potential, as the general game was good but it needed more polish, balance and variation between runs (wich was the weakest part). Still some variation and replayability was found on the unlocking system, that adds more items/powerups as you beat different bosses or areas (and the game itself), or find certain ones on a run, that are added to the pool for future runs. After couple updates and fixes the quality went up and a first batch of the needed variation was introduced,wich improves greatly the game.\nThe developer is a single guy, wich mades even more amazing the accomplishment of creating a system that balances both the randomness of the gating system for level progression and the randomness of the items you get, as you never find on a situation where you find yourself unable to finish a run because you didnt got an item needed to unlock a part of the map. \nThere is still room for imporvement on the variation side and some general balance but the dev is commited and already stated that he will continue to work and update the game.\nA Robot Named FIght, despite the silly name, is a diamond that started rough but is being polished to really shine, and with the current content is very worth the asking price and your time", "timestamp_created": 1511816446, "timestamp_updated": 1511816601, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.575330", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37599862": {"recommendationid": "37599862", "author": {"steamid": "76561197985468329", "num_games_owned": 322, "num_reviews": 4, "playtime_forever": 2189, "playtime_last_two_weeks": 0, "last_played": 1512969938}, "language": "english", "review": "This game is pretty damn amazing. Metroid style games are among my most favorite to just sit and play for hours, though they tend to have a relatively limited amount of replay value. \n\nThis game one the other hand? It just keeps on giving. A beautiful art style that brings back fond memories of Super Metroid and an expanding item pool that makes it feel like you're never quite done with the game, there's just not a lot for me to not love. Each run feels like a new game that I'd love to spend hours on exploring, though perhaps it doesn't quite give you enough reason to go back to the various sections and explore them anew.\n\nThis game is being given plenty of work after the release though, with new design schemes rolling out recently that keeps every run having the same general layout, rebalances to the upgrades, new room designs... I don't think I'm ever going to play this game to exhaustion in quite a while.", "timestamp_created": 1511655106, "timestamp_updated": 1511655106, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37594855": {"recommendationid": "37594855", "author": {"steamid": "76561198000046490", "num_games_owned": 437, "num_reviews": 1, "playtime_forever": 392, "playtime_last_two_weeks": 0, "last_played": 1511652486}, "language": "english", "review": "Controls nearly exactly like Super Metroid but with procedurally generated levels for extended replayablilty?  Yes please.", "timestamp_created": 1511651248, "timestamp_updated": 1511651248, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503067", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37570535": {"recommendationid": "37570535", "author": {"steamid": "76561198098125619", "num_games_owned": 68, "num_reviews": 3, "playtime_forever": 674, "playtime_last_two_weeks": 0, "last_played": 1511107476}, "language": "english", "review": "This game is awesome,\na rouge-like combine with a metrovania\ni cannot even describe how good this game is, for me, this is a hidden gem.\nThe controls remind me of metroid fusion (i love that game btw),\nwhen i die, i just excited to see how is going to be the next run,\nreally awesome game", "timestamp_created": 1511636888, "timestamp_updated": 1511636888, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503067", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37550724": {"recommendationid": "37550724", "author": {"steamid": "76561198026492249", "num_games_owned": 106, "num_reviews": 3, "playtime_forever": 1656, "playtime_last_two_weeks": 0, "last_played": 1512856523}, "language": "english", "review": "One of the coolest Metroidvanias I have ever played. The replayability of this game is way awesome!", "timestamp_created": 1511627722, "timestamp_updated": 1511627722, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37495444": {"recommendationid": "37495444", "author": {"steamid": "76561198049868824", "num_games_owned": 622, "num_reviews": 3, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1511290975}, "language": "french", "review": "Un jeu sympa qui reprend le gameplay de super metroid tout en y ajoutant l'aspect rogue lite.\nLes cessions de jeu dure environ une heure et on recommence avec plaisir.", "timestamp_created": 1511604826, "timestamp_updated": 1511604826, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37431698": {"recommendationid": "37431698", "author": {"steamid": "76561198072819484", "num_games_owned": 130, "num_reviews": 3, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1511564406}, "language": "english", "review": "The game simply isn't fun. The enemies are dull and so is the level design, probably because it's randomly generated. Why is it randomly generated? There's no outstanding reason for the game to be that way. I believe the developers made it rouge like and randomly generated to create the illusion that the game is longer than it actually is because it locks upgrades away from you until you die. This isn't a fun gameplay mechanic and if they had instead made better level design with save stations the game would have heavily benefited from that. Overall, boring gameplay and bland level design. Not recommended.", "timestamp_created": 1511564709, "timestamp_updated": 1511564709, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.468593", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37264958": {"recommendationid": "37264958", "author": {"steamid": "76561198021487675", "num_games_owned": 78, "num_reviews": 2, "playtime_forever": 690, "playtime_last_two_weeks": 0, "last_played": 1511499197}, "language": "english", "review": "Addicting, fun, random. Trying to beat the clock for some achievements is more fun than you would expect.", "timestamp_created": 1511499140, "timestamp_updated": 1511499140, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36877504": {"recommendationid": "36877504", "author": {"steamid": "76561197967238472", "num_games_owned": 188, "num_reviews": 13, "playtime_forever": 665, "playtime_last_two_weeks": 0, "last_played": 1511398205}, "language": "english", "review": "Do you like Super Metroid? Do you like Rogue-lite elements such as randomized maps and unlocking new upgrades with every run like Binding of Isaac? Then you'll love this. It's not even that punishing since enemies can drop health and be respawned by re-entering a room, and you unlock limited-use (and technically optional) respawn machines in case you still screw up and won't lose your whole run, if you chose to use them.\n\nNow if only Nintendo would learn that THIS is the style of Metroid we want, not that Prime or Other M shit...lol", "timestamp_created": 1511398373, "timestamp_updated": 1511398373, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.524293", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36847668": {"recommendationid": "36847668", "author": {"steamid": "76561198036965949", "num_games_owned": 1888, "num_reviews": 52, "playtime_forever": 297, "playtime_last_two_weeks": 0, "last_played": 1511500548}, "language": "french", "review": "Pour le moment je passe un très très bon moment même si je trouve que c'est pas toujours très équilibré. En fait ça va dépendre beaucoup de la chanche déd items que vous allez avoir.\n\nJe vais continuer à jouer et je reviens quand je l'aurais fini pour donner mes impressions finales", "timestamp_created": 1511391711, "timestamp_updated": 1511391711, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36638970": {"recommendationid": "36638970", "author": {"steamid": "76561198006575550", "num_games_owned": 663, "num_reviews": 190, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1504791038}, "language": "english", "review": "Full review: https://www.youtube.com/watch?v=t6eb2mNu2DY\n\nThis is a solid game that I really enjoy playing. It has fantastic old school game play that is mixed with some newer concepts like procedural map generation. A good mix between roguelike and metroidvania. I also love killing the fleshy monsters, they're disgusting. Some minor problems like the repetitive default gun sound and some confusing death rooms didn't bother me enough to stop playing. Just realize that if you get to an area and it looks like you can't get past then you didn't get the required item yet.", "timestamp_created": 1511152715, "timestamp_updated": 1511152715, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.526593", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36499526": {"recommendationid": "36499526", "author": {"steamid": "76561198070369444", "num_games_owned": 121, "num_reviews": 11, "playtime_forever": 221, "playtime_last_two_weeks": 0, "last_played": 1510157098}, "language": "english", "review": "This is not a Metroidvania, it's the very own Super Metroid.\n\nThis game kicks lots of ass. Robots, body horror, cool powerups, sick bosses and BADASSery everywhere.\n\nThe only bad thing is that the jumping sucks a bit.\n\n8/10", "timestamp_created": 1510606710, "timestamp_updated": 1510606710, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.571403", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36427158": {"recommendationid": "36427158", "author": {"steamid": "76561198297550962", "num_games_owned": 23, "num_reviews": 3, "playtime_forever": 613, "playtime_last_two_weeks": 0, "last_played": 1510343114}, "language": "english", "review": "As a first impression a wonderful loveletter to 16-bit action platformers. \nA procedurally generated metroid game is what childhood dreams were made of. I love the artstyle and the tone. Unfortunately the game falls a bit short in the gameplay and procedural generation. Some of my thoughts for improvement.\n\nPositive\n+ The visuals and music go well together and really brings some nostalgia. \n+ Artstyle is spot on. Monster design is great and creepy. Nice effects and lighting.\n+ Mood\n+ Story, simple, cheesy but effective\n+ You unlock more items for future playthorughs.\n+ Lots of upgrades\n\nNeutral\n+- Jumps are a bit to floaty.\n+- Areas can be a bit to cramped.\n+- Music wasn't varied enough and got old after a while.\n\nNegative\n- Stiff controls, That is - the character is too slow and unresponsive at the start. \nBoth the movementspeed and rate of fire. A rouge like game should be smooth and when you die you should want to start another round. The sluggish beginning really takes that away. I get that the developers wanted to give a sense of progression but it's just to slow and really takes away from the gameplay expereince. The first minutes of shooting blobs of flesh is really tedious.\n- The Invincibilityframes are to few.\nEven after getting more speed and control over your character a few enemies close together can be your demise. You get stunned when hit and can't react before you get hit again. It feels really unfair and frustrating. A small change that would make a huge quality of life difference.\n- Projectile speed should be faster than movementspeed.\n-  I liked that you could get different items to solve the same problem. Double jump, super jump or maybe even just a dash. The procedural generation could improve in certain aspects though. I found myself getting way to many gun/beam upgrades. Wish didn't bring much variety. Hav having atleast 3 mobility items in a playthorugh could be a good cap.\n- Bossbattle design \nIt's difficult to make good bosses. But I don't think that this is the games problem. Its the other points above that keep the bossfights from feeling fun and engaging. A more fluid movement system would do wonders in creating more fluid and dynamic bossfights even with the current patterns and animation.\n\nI really love the idea of the game and certain elements are steller. The effects, animation, artstyle. Certain parts of the procedural generation. But in the end I found the controls and gameplay to frustrating to keep coming back for more. And can sadly not recommend the game.\n\nPSS: Hoping a few patches comes along adding a few other gamemodes that can mix up the start of the game and smoothen out some of the control issues I had.", "timestamp_created": 1510346879, "timestamp_updated": 1510346879, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.499294", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "36400270": {"recommendationid": "36400270", "author": {"steamid": "76561198012027144", "num_games_owned": 474, "num_reviews": 20, "playtime_forever": 472, "playtime_last_two_weeks": 0, "last_played": 1511456955}, "language": "english", "review": "Amazing metroidvania a love letter to super metroid, and I'm not a fan of the procedurally generated style but it work very well hear, you still get one use save points,", "timestamp_created": 1510244874, "timestamp_updated": 1510244874, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.471807", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36386368": {"recommendationid": "36386368", "author": {"steamid": "76561197995449338", "num_games_owned": 567, "num_reviews": 1, "playtime_forever": 475, "playtime_last_two_weeks": 0, "last_played": 1505855031}, "language": "english", "review": "A Robot Named Fight tries to be Super Metroid with roguelike elements, but fails to be either. Metroid is built on its huge, interconnected, explorable map. This game's map generation, though, is severely lacking. It's structured fairly linearly, requiring you to visit each separate area in strict sequence. The open-ended exploration consists mostly of tiny offshoots of the main path through the world. The controls and abilities in the game pale to Super Metroid, as well. Most upgrades you find consist of small, piecemeal boosts like \"slightly faster firing speed\" or \"slightly more shot damage\". While there are many types of weapons and abilites you won't find in a Metroid title, none of them are all that fun to use, and there's a lot of function overlap in the upgrade pool. Also, a good portion the upgrades within a given map are just glorified money to buy upgrades from randomly placed shops in the map. Given the roguelike nature of the game, speedrunning, a staple Metroid tradition, is all but impossible. The game also does its best to completely prevent sequence-breaking, another favorite Metroid tradition. All in all, it's not a good Metroid title, considering how much it tries to be like one.\n\nA lot of this game's weaknesses are a result of its roguelike elements. Sadly, those elements don't make up for those weaknesses. Map generation follows such a strict set of rules that there's little variety between runs, meaning the main strength of a roguelike is completely lost on this game. The world has the same general structure, with the same area types, every playthrough. You go right, through the city, down into the cave, left through the factory, down into a destroyed city, then all the way back up to the final boss. The weapons lack variety, as well. Most main weapons are just a slightly different projectile. The sub-weapons widely vary in use and function, but there's usually little reason to use them as opposed to the main beam, as it often gets upgraded so much there's no reason to not use it. Despite being a roguelite, A Robot Named Fight has so little variety that each run feels largely the same.\n\nTo top it all off, the game is pretty easy. In the time it took me to get the real ending, which requires six or seven successful runs, I only had three or four failed runs. The game even gets easier as you play it, as many of the unlockable abilities are outright better than the pool you start out with. Most bosses are pretty simple, requiring a minimum effort to dodge and succesfully damage. None of them require specific abilities to defeat, either, meaning \"spam bullets until it dies\" is the strategy for all of them.\n\nA Robot Named Fight is not a good Metroid clone, it's not a good roguelite, and it doesn't bring anything new or unique to the table. Given the large library of Metroid clones availabe for the PC, currently or in the near future, this game is not worth picking up. You're better off looking up some Super Metroid romhacks and playing those.", "timestamp_created": 1510188400, "timestamp_updated": 1510188400, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.500964", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36327852": {"recommendationid": "36327852", "author": {"steamid": "76561198026571935", "num_games_owned": 285, "num_reviews": 9, "playtime_forever": 357, "playtime_last_two_weeks": 0, "last_played": 1510980879}, "language": "english", "review": "1 hour in.  So far so good.", "timestamp_created": 1509994512, "timestamp_updated": 1509994512, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.468750", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36314038": {"recommendationid": "36314038", "author": {"steamid": "76561198423620741", "num_games_owned": 18, "num_reviews": 4, "playtime_forever": 1010, "playtime_last_two_weeks": 0, "last_played": 1508618793}, "language": "english", "review": "Literally Super Metroid rouguelike.", "timestamp_created": 1509940057, "timestamp_updated": 1509940057, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.571403", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36089321": {"recommendationid": "36089321", "author": {"steamid": "76561198018097461", "num_games_owned": 526, "num_reviews": 3, "playtime_forever": 4024, "playtime_last_two_weeks": 0, "last_played": 1508977016}, "language": "english", "review": "Great game. WARNING: Very addicive.", "timestamp_created": 1509222132, "timestamp_updated": 1509222132, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.443182", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36006235": {"recommendationid": "36006235", "author": {"steamid": "76561198416486940", "num_games_owned": 13, "num_reviews": 1, "playtime_forever": 1748, "playtime_last_two_weeks": 81, "last_played": 1513421310}, "language": "french", "review": "Génial ce jeu ! mais dommage qui à pas plus de zone, de boss et d'items \nMais excellent jeu, on a beaucoup de difficulter si on a pas les items qu'on aimerai avoir", "timestamp_created": 1509002921, "timestamp_updated": 1509002921, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35957116": {"recommendationid": "35957116", "author": {"steamid": "76561198032962170", "num_games_owned": 141, "num_reviews": 12, "playtime_forever": 8533, "playtime_last_two_weeks": 0, "last_played": 1512863667}, "language": "english", "review": "This game is a compelling fusion of the classic metroidvania shooter and rogue-like difficulty with a fantasticly dark theme. It is still in a beta-ish \"rough edges\" state, but the developer has been very involved with the steam community while consistently pushing updates to fix small bugs and tweak the gameplay, often in direct accordance with community feedback.", "timestamp_created": 1508808332, "timestamp_updated": 1508808332, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.521141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35954180": {"recommendationid": "35954180", "author": {"steamid": "76561198321385080", "num_games_owned": 86, "num_reviews": 47, "playtime_forever": 437, "playtime_last_two_weeks": 0, "last_played": 1508690912}, "language": "english", "review": "quite good this game. In fact i enjoy it! Good roguevania that looks like a super metroid clone with permadeath. How Cool!", "timestamp_created": 1508794825, "timestamp_updated": 1508794825, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492502", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35946148": {"recommendationid": "35946148", "author": {"steamid": "76561197993770192", "num_games_owned": 1155, "num_reviews": 3, "playtime_forever": 2010, "playtime_last_two_weeks": 1, "last_played": 1513178926}, "language": "english", "review": "An amazing mix between Isaac and Metroid, didn't think procedural generation would work so well on a Metroid map!", "timestamp_created": 1508769449, "timestamp_updated": 1508769449, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.495569", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "35829930": {"recommendationid": "35829930", "author": {"steamid": "76561198004565481", "num_games_owned": 422, "num_reviews": 5, "playtime_forever": 836, "playtime_last_two_weeks": 0, "last_played": 1505383719}, "language": "english", "review": "This is quite a fun little game.  It is heavily inspired by Super Metroid and looks and feels like it.  However there is a lot of random generation of items, locations, and enemy locations that make each run different. With different unlocks, there is a bit of replayability which is nice.  Each run is approximately an hour or less so I enjoyed playing this for short bursts.  Recommended for fans of Super Metroid and The Binding of Isaac.", "timestamp_created": 1508375079, "timestamp_updated": 1508375079, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495569", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35765456": {"recommendationid": "35765456", "author": {"steamid": "76561197976765236", "num_games_owned": 115, "num_reviews": 4, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1508415539}, "language": "english", "review": "first look: pretty close to the Metroid formula (interconnected map, backtracking, lots of items which unlock new gameplay and paths...   AND Roguelite elements (after death you restart the game from scratch in a new map, having the chance to get new items which you've unlocked in previous runs). \n\ndefinitely worth a look for fans of the Genre, it's fun", "timestamp_created": 1508130898, "timestamp_updated": 1508130898, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.495569", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35760921": {"recommendationid": "35760921", "author": {"steamid": "76561198272220191", "num_games_owned": 151, "num_reviews": 4, "playtime_forever": 9885, "playtime_last_two_weeks": 1217, "last_played": 1514358320}, "language": "japanese", "review": "こんなに面白い探索型横スクロールアクションをはじめてやりました。メトロイドがいかに愛されているか分かった作品です。\nこのゲームはオススメです。ぜひ買ってください。\n　", "timestamp_created": 1508110653, "timestamp_updated": 1508110653, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35736629": {"recommendationid": "35736629", "author": {"steamid": "76561198067529443", "num_games_owned": 78, "num_reviews": 15, "playtime_forever": 1121, "playtime_last_two_weeks": 0, "last_played": 1511909109}, "language": "english", "review": "good", "timestamp_created": 1508041318, "timestamp_updated": 1508041318, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.465528", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35706822": {"recommendationid": "35706822", "author": {"steamid": "76561198057126921", "num_games_owned": 116, "num_reviews": 4, "playtime_forever": 1205, "playtime_last_two_weeks": 71, "last_played": 1513899236}, "language": "english", "review": "An OK roguelike and an OK metroidvania together produce a fantastic game. It may not have the replayability of something like the Binding of Isaac or Enter the Gungeon, but it has enough content for many playthroughs. The game takes a lot from Super Metroid, and barely tries hiding it. The main character is does the somersault jump and a good portion of the items (Charge Beam, Varia Suit, etc.) are straight up expies of items from Metroid. The exploration is very good, considering the fact that is randomly generated. One thing i'm not sure is good or bad is the fact that your minimap marks vaguely where every item is, including the ones hidden in walls. Overall, it's a fun game with a good degree of replayability, and I'd recommend it if you are a Metroid fan, or a fan of metroidvanias in general, but it is a better metroidvania than roguelike.", "timestamp_created": 1507950748, "timestamp_updated": 1507950748, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.495569", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35629113": {"recommendationid": "35629113", "author": {"steamid": "76561198012963741", "num_games_owned": 237, "num_reviews": 23, "playtime_forever": 1511, "playtime_last_two_weeks": 0, "last_played": 1511130798}, "language": "english", "review": "There are only five questions you need to ask yourself:\n\n1. Do I like Super Metroid?\n2. Do I like the Binding of Isaac?\n5. Do I have an extra $10?\n\nIf the answer to all 5 of these questions is \"yes\" then you should buy and enjoy this game.", "timestamp_created": 1507684308, "timestamp_updated": 1507684308, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.520296", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35621089": {"recommendationid": "35621089", "author": {"steamid": "76561198299718188", "num_games_owned": 312, "num_reviews": 30, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1507405931}, "language": "english", "review": "I gave this a solid try but I ended up hating the game. \n\nA Robot Named Fight is a Metroidvania, heavily inspired by Metroid and then watered down by roguelike gameplay and bad game design. I wanted to like this, I really, really gave this game a solid try, but the randomness of it tied into its bad game design and finally, horrible difficulty spikes made me walk away.\n\nA Named Fight has you as a lone robotic hero standing against an invasion of meat monsters on your robot world. The plot seemed pretty interesting at the beginning, but it never seemed to be fleshed out. This has the makings of a great game but it never managed to even be a good game. A Robot Named Fight is a painfully disappointing experience that left me wanting to pull out my old copy of Super Metroid.\n\nThe character design, movement and even a few of the weapons are Metroid like. The rest of the game… ugh.. the rest of the game is a randomized shit show. Some runs you will find yourself getting almost no power-ups and then walking into a boss fight that you are in no way prepared for.\n\nNow, I don’t mean you just randomly walk into the room. I mean that the game steers you into said boss fight encounter because you have no other places to go. There might not just be any other paths or the paths that are available are blocked, needing power-ups you haven’t received yet to pass them. This happened several times for me and it was always maddeningly frustrating. Especially after spending 10-20 minutes to find the boss. I would inevitably die and it wasn’t fun, it wasn’t a learning experience, it was just cheap and frustrating.\n\nThe boss fights themselves are just horribly implemented and done. Many enemies have hard to see tells if any at all before unleashing powerful and often times one shot kill attacks. That is just wrong. Others create so many smaller enemies that the screen is practically filled with them all moving around making dodging an impossibility.  Others, are just pushovers… Getting this random grab bag of bosses with no rhyme, reason or regard to player progression is just bad game design and game-breaking as a player.\n\nRoguelike games are supposed to test player skill in the face of adversity. Good ones raise the difficulty appropriately the further you make it. Each death is clean and there is always something to learn about how you died. The biggest problem is, the games dependency on the player getting useful weapons, health power-ups and other useful items. A Robot Named Fight isn’t beatable without them, but they often times don’t every show up.\n\nThe character control isn’t tight enough. The plot had potential, but fizzled out. The randomization is broken. Buying items in the hidden shops is a horrible experience thanks to the total lack of explanation of what you are buying and what it’s for.  Not to mention the near impossibility of getting the needed currencies to buy things. etc…etc…etc…. There is a lot more wrong with this game but at this point, I feel like I am beating a dead horse.\n\nA Robot Named Fight has the makings of a great game, but as is, I hate it. I can’t honestly see this mess getting any better. Maybe, maybe if the developer turned this into a proper linear platformer instead of a randomized game this would be a better experience, sadly I doubt that is going to happen.\n\nhttp://nardio.net/2017/10/10/robot-named-fight-review/\n", "timestamp_created": 1507652939, "timestamp_updated": 1507652939, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.433534", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35560684": {"recommendationid": "35560684", "author": {"steamid": "76561198065860631", "num_games_owned": 218, "num_reviews": 24, "playtime_forever": 191, "playtime_last_two_weeks": 0, "last_played": 1507429945}, "language": "english", "review": "A lovingly crafted hybrid of Super Metroid and Dark Void, it takes the visual themes and atmosphere of Dark Void, and the gameplay of Super Metroid.  Controls are good, with a movement similar to Samus' floaty jump in Super Metroid.  the game is best played with an Xbox Controller.  The difference between this game, and other Metroid \"clones\" is that this game has much more replay value, due to the fact that it is randomly generated every time you start a new game, in a way much similar to Issac or Gungeon.  The difference here, is it incorperates the fun aspects of Super Metroid backtracking, placing doors that require different weapons, which you must go out of your way to find before you can further progress.  The fact the game is able to randomly do this without accidently locking upgrades behind doors you can't open yet is astoudning, but even more so, is the fact that this game, despite being randomly generated, always has good level layout.  It feels like someone sat down with this game and taught it complex, and most importantly, good level design.  The game also has multiple versions of the same upgrades, some that take ammo and some that are primary weapon upgrades.  This makes each playthrough feel more varied and fresh, giving you different variations of the same basic weaponry and equipment.  Arachnomorph takes the place of the Morph Ball in Metroid, but on another playthrough you may get the \"Power Slide\" ability instead, which allows you to slide under small passage ways in a similar fashion.  This game feels incredibley polished and nice.  It's a great experience, and it blends sections of it's random level so well, I wouldn't know it was randomly generated the first time I played if I hadn't read about the game before I purchased it.  The smooth visual transition is particularly impressive, and the different areas are unique and interesting to look at.  It's a very good game, and my only complaints are the lack or more than one real song on its soundtrack (Which is almost like a remix of the Brinstar theme from Super Metroid) and the lack of variety in boss battles.  The Boss battles are fun, but not very difficult.  Having bosses themselves being randomly generated from different boss \"parts\" would be interesting, or at least giving them weak spots.  As of right now all the bosses are just bullet sponges, and adding weak spots would spice things up.  Randomly generated bosses would be amazing, but difficult to do, making it's lack of implementation understandable, but the bosses still need more variety and unique gimmicks for them.  There is particularly few bosses as well, making the lack of uniqueness particularly unforgivable.  These issues are very small, however, when compared to the overall quality of the game.  Very good, very worth your time and money.\n\n85/100 Score - Must play for fans of the Metroidvania genre, esecially those looking for a high replay value experience.", "timestamp_created": 1507430980, "timestamp_updated": 1507430980, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.491172", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35496803": {"recommendationid": "35496803", "author": {"steamid": "76561198049806292", "num_games_owned": 175, "num_reviews": 8, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1507214513}, "language": "english", "review": "Have yet to spend much time with it due to time constraints, but thus far it looks like a very polished metroid-esque game. I particularly enjoy the music- and the game as whole is a step above others in the genre. It's obvious that if you long for the days of the SNES, this is a game to play. The cutscenes are very fun, and harkin back to the days of the original XCom on floppy disk.\n\nNote: This game is best played with a controller.", "timestamp_created": 1507214769, "timestamp_updated": 1507214769, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35485800": {"recommendationid": "35485800", "author": {"steamid": "76561198044563176", "num_games_owned": 41, "num_reviews": 9, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1507263216}, "language": "english", "review": "Part Metroidvania, part all-around fun. A Robot Named Fight provides a complete collection of qualities that make it more than worth its price tag. While some minor grievances deter it from being a truly recommendable piece, the replayability and variety of its structure provide hours of treasure-hunting escapades. I really can't figure out what I enjoy more: the exploration or the action, as both play a heavy role in the game's performance-based highlights. I only wish it wasn't so determinant on its luck-based extremities to pad itself to more than an hour a playthrough. Even so, it's worth recommending more than it is not.\n\nPros:\n+ Abundant replayability\n+ Excellent performance rate\n+ Combines the best of action and exploration\n\nCons:\n- Unimpressive soundtrack\n- Somewhat lacking in content\n- Too heavily influenced by luck\n\nThe full review can be found at https://www.keengamer.com/article/17175_a-robot-named-fight-review", "timestamp_created": 1507175809, "timestamp_updated": 1507175809, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.433895", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35475769": {"recommendationid": "35475769", "author": {"steamid": "76561198037315974", "num_games_owned": 138, "num_reviews": 7, "playtime_forever": 1506, "playtime_last_two_weeks": 0, "last_played": 1507166202}, "language": "english", "review": "An excellent psuedo metroid game. The roguelike elements make it especially satisfying when you reach the Megabeast. A bit of replayability. Basically, im into it.\n\nNow who would win in a fight Samus at full power or 50 robots named fight? Hmmm....", "timestamp_created": 1507135332, "timestamp_updated": 1507135332, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35474919": {"recommendationid": "35474919", "author": {"steamid": "76561198004619146", "num_games_owned": 1056, "num_reviews": 5, "playtime_forever": 478, "playtime_last_two_weeks": 0, "last_played": 1507351304}, "language": "english", "review": "With something like Super Metroid Randomized, it was inevitable that someone would make a rogue-lite metroidvania game. I've done runs that seem to not give enough health power-ups or odd placements of new equipment, but I've still had fun with the game. I highly recommend it to people who've wanted a metroidvania game similar to what the Binding of Isaac offers.", "timestamp_created": 1507132937, "timestamp_updated": 1507132937, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35438712": {"recommendationid": "35438712", "author": {"steamid": "76561198024907760", "num_games_owned": 58, "num_reviews": 2, "playtime_forever": 1963, "playtime_last_two_weeks": 548, "last_played": 1512938420}, "language": "english", "review": "Hmm I guess I will have to give this one a review. Already played for about ten hours. Yes this game feels and handles like Super Metroid from snes,But that is the point. This is a game designed for people who did not get enough of the Super Metroid and wanted more. You get one life unless you reach saves Which makes each life you have pretty valuable.\n\nIF u do die and have to restart. you restart all over and the map is scattered all over again. The upgrades are fun to play with and handling is pretty good. All in all I would have to give this game a thumbs up and worth more than the few bucks it costs anyways. It might not be the longest game if you are really fluent at sidescrollers. I myself have not even beaten it yet but it has left an impact on me and I do want keep playing it even tho I have died and restarted many times so far. \n\nI will rate this an 8/10", "timestamp_created": 1507016872, "timestamp_updated": 1507016872, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.493348", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35423216": {"recommendationid": "35423216", "author": {"steamid": "76561198012067184", "num_games_owned": 250, "num_reviews": 3, "playtime_forever": 1561, "playtime_last_two_weeks": 122, "last_played": 1512942549}, "language": "english", "review": "A Robot Named Fight seems to take a lot of cues from classic metroid games, but manages to put enough of a spin on them to help it stand out on its own, especially with it's Binding of Isaac-esque unlocking and progression system.  However like most roguelikes, your run's success can be dependant on how merciful the RNG is on you just as much as your own skill. There are times where you are in immediate danger the moment you enter a room, and damage is hard to avoid at times, but the developers are hard at work at not only solving these issues, but are also still working on new content.\n\nAs it stands, the game is fun, and incentivises repeated runs to unlock new weapons and equipment, and also bonuses for future runs. I do hope to see new things added to this game in the future, as there is a lot of potential to be had here. And while a lot of these items seem to synergize with eachother quite well, it's up to the RNG to not leave you with a bunch of items that don't combine well at all.\n\nAll in all, A Robot Named Fight is a very solid game, and quite enjoyable if you enjoy action games.", "timestamp_created": 1506962790, "timestamp_updated": 1506962790, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.496404", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35375208": {"recommendationid": "35375208", "author": {"steamid": "76561197989933111", "num_games_owned": 257, "num_reviews": 18, "playtime_forever": 275, "playtime_last_two_weeks": 0, "last_played": 1511575220}, "language": "english", "review": "Fun gameplay ✓\nGood sound design ✓\nNostalgia ✓\n9/10", "timestamp_created": 1506851941, "timestamp_updated": 1506851941, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.515025", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35353916": {"recommendationid": "35353916", "author": {"steamid": "76561198154382466", "num_games_owned": 296, "num_reviews": 1, "playtime_forever": 986, "playtime_last_two_weeks": 159, "last_played": 1513457639}, "language": "english", "review": "When I stumbled upon this gem of a game, I could not believe how fortunate/miserable I would be for the next couple of days. Now when I say miserable, I mean it in the best sense of the word. This game is brutal and I am a much better gamer for it!!! I have never played a game that made me feel so nostalgic, and yet utterly baffled by the sheer amount of randomness this game provides. I could not get enough it! And I am not a huge rogue/rogue-light fan (besides Rogue Legacy;has never been my favorite genre), yet this game drove me deeper and deeper into the bowels of this meat-opolis! \n\nI believe that I can say with pretty much 100% certainity that this will go down in history as not only a masterpiece of gaming, but also a catalyst for more developers to find creative ways to create more Metroidvania rogues! Matt Binter you are a freaking genius with one hell of a messed up mind to create all of those meat creatures that will assuredly give me nightmares for a long time! Love the updates and hope this review helps more people to take a chance on a game that will not dissapoint in the slightest! Long Live Tutorial Smith!!!", "timestamp_created": 1506804788, "timestamp_updated": 1506804788, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.542517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35331110": {"recommendationid": "35331110", "author": {"steamid": "76561198025902156", "num_games_owned": 366, "num_reviews": 51, "playtime_forever": 428, "playtime_last_two_weeks": 0, "last_played": 1506417742}, "language": "english", "review": "There’s no way to ignore Metroid’s influence on A Robot Named FIGHT! I try to judge a game on its own qualities, but it’s impossible not to notice the similarities. Fight feels and plays exactly like Samus in Super Metroid. You spin like Samus when you jump forward, you aim up and down like Samus, you crouch like Samus. This isn’t a bad thing because Samus felt great in Super Metroid, and Fight feels great here. However, problems arise when the game seeks to not only emulate the feel but the structure as well of games like Super Metroid.\n\nTo the game’s credit, it does generate a properly built interconnected world. It is, by the end of a run, a complete Metroid map. Sure, each room is of a pre-built format, but it serves the form for this game. The premise is that you, a lone robot on a planet of robots, must fight the “meat.” Enemies are dynamically designed, if a bit ugly to look at, and the combat is snappy. All enemies look like big flappy flesh monsters, with a few exceptions. You’ll come across an area boss occasionally, all of which are fun to fight. I do like how the game handles “saves”. A save station functions basically as an extra life. If you die, you’ll respawn back at the save station. This is a smart way to give the player a second chance, especially in the context of a game with a lot of space to cover.\n\nBeing designed like a Metroid game, the world map becomes large and sprawling. Runs can be too long and lost too quickly to feel satisfying. You can be in a run for well over half an hour and not be too far in before it’s all over in an instant. Sure, that’s the idea of a rogue-like, but runs more often than not felt like sunk time. Occasionally, you’ll unlock a new permanent upgrade. Dying always feels super disappointing, because you know you’re going to have to do the same things every time: find a gate, get one of a few upgrades, use on said gate, fight a boss, drop into a new area, etc. This is a caveat from the random generation. Upgrades are consistently the same for the sections, so it becomes repetitive and unexciting. You always collect the same subset of weapons and upgrades in the first section: missiles, charge beam, flamethrower, etc. It felt like I was just playing the same game over and over again, but without a normal save slot.\n\nIf the appeal of a rogue-like is often adapting and learning what’s coming next, the game becomes too rote to succeed at this. If the appeal of a rogue-like is often replayability, the game is too predictable to succeed at this. If the appeal of a Metroidvania is often slowly building a strong character over a campaign, the upgrades feel too inconsequential to succeed at this. If the appeal of a Metroidvania is exploring a fascinating alien world, the game’s maps are too predictable to succeed at this. The structure of Metroidvania becomes frustrating within the context of a roguelike. Backtracking becomes tiring and annoying (especially with the bland soundtrack droning on) because you might end up wasting your time anyway if you die soon enough. All rooms in the game are of a stock subset, and certain tiles have the chance of being a hidden upgrade, so when I walked into a room that was marked on the map, I knew exactly which blocks to shoot. The novelty of discovery is lost.\n\nIt’s weird because ultimately I think A Robot Named FIGHT! is a fine game. The game plays well; it’s put together fine. But every time I played a run, it just felt like a bland Metroid. Yes, the game has succeeded at emulating the Metroidvania structure of an interconnected world within the confines of a rogue-like, but it fails to realize that the structure of those games was only a fraction of what made them so good. When these maps have only the cold generation of a computer, they lack flavor and heart. It’s a Metroid game in shape, but something was lost in its spirit.\n\n---\n\nThis review was written in tandem with [url=http://saveorquit.com] Save or Quit. [/url]", "timestamp_created": 1506766203, "timestamp_updated": 1506766203, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.568849", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35251443": {"recommendationid": "35251443", "author": {"steamid": "76561198029989461", "num_games_owned": 94, "num_reviews": 1, "playtime_forever": 2772, "playtime_last_two_weeks": 2, "last_played": 1514050356}, "language": "english", "review": "I've been enjoying this game a lot in the last few days. I love how it's basically Binding of isaac meets Super Metroid.\n\nI have one BIG complaint though, one that I'd love the developer would adress somehow...\n\nThe bosses, the bosses are ridiculously easy, they barely last a few seconds, have extremely silly behaviour patterns and are overall not a challenge in any way.\n\nI actually think the world difficulty itself is fine, specially when you unlock the difficulty \"boosts\" (one or two more wouldn't be bad as well, though) but the bosses are just insanely easy.\n\nI understand that maybe the devs want to give an opportunity to all kinds of players, but many of us here are really disappointed with the overall challenge that bosses present, and I'm actually having a hard time imagining new players having trouble with the bosses at all.\n\nMaybe a boss difficulty setting at the beggining? Normal, hard, very hard? I don't know, just please, adress this somehow.", "timestamp_created": 1506556505, "timestamp_updated": 1506556505, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517091", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35236570": {"recommendationid": "35236570", "author": {"steamid": "76561198112295375", "num_games_owned": 540, "num_reviews": 34, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1506490432}, "language": "schinese", "review": "When I say roguelite+metroid(vania), this game is what I mean.\n\n[h1]A Robot Named Fight! 购买建议[/h1]\n\n[u]适宜人群[/u]\nroguelike玩家\n银河战士爱好者\n\n[u]不适宜人群[/u]\n喜欢清新画风，无法接受如同商店页面截图的肉块、肢解、血腥等元素的玩家\n不喜欢roguelike死亡删档一夜回到解放前的玩家\n\n[u]你在游戏中会体验到[/u]\n银河战士玩法\n有限的随机的地图组合和道具分布\nroguelite解锁新道具供以后使用\nsfc级别的画质\n有限复活次数的roguelite（取决于你找到的记录房）\n收集货币+稀有道具以交换能力道具\n不到一小时一次的流程\n\n[u]不会体验到[/u]\n打怪积累经验值升级\n七作城里的刷敌人掉落装备/道具\n初期蹬墙跳", "timestamp_created": 1506493274, "timestamp_updated": 1506493340, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504728", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35194424": {"recommendationid": "35194424", "author": {"steamid": "76561198000219173", "num_games_owned": 524, "num_reviews": 25, "playtime_forever": 1331, "playtime_last_two_weeks": 0, "last_played": 1511716429}, "language": "english", "review": "[b]DISCLAIMER[/b]: The opinions and views presented in this review are wholly my own. I'm not pretending to speak from an objective viewpoint, here. I either liked the game, or I didn't.\n\nA decent little procedurally-generated rougelike Metroidvania. Plays very similar to - and looks a lot like - Super Metroid, which was the entire reason I bought it and it did not let me down in that regard. \n\n[h1]A quick breakdown of what I did, and did not, like about the game:[/h1]\n\n[b]Things I Liked:[/b][list]\n[*]Handles close to Super Metroid, and has a similar gameplay style.\n[*]Good pixel art, and great effects.\n[*]Lots of upgrades to acquire.\n[*]Great enemy design (visual and practical) for the most part.\n[*]Story was orginal in many aspects.\n[/list]\n[b]Things I Was Neutral Towards:[/b][list]\n[*]Story overall, however, was rather meh. Which is its own charm for some people.\n[*]Soundtrack isn't great or varied, but at least suits the game.\n[*]Jumping feels like it's always underwater, which is weird.\n[*]Lots of unlockables, which is great if you're into that.\n[*]Most areas are pretty cramped.\n[/list]\n[b]Things I Did Not Like:[/b][list]\n[*]Locked out of several runs because the game does not spawn approproate power ups in an attainable area.\n[*]Not very many procedural rooms - feels very same-y each run.\n[*]Lots of randomization in the powerups, meaning some are wasted; i.e. getting lots of \"Energy Tanks\" for secondary weapon, when I don't get one until the end of the run.\n[*]Very little explanation about some powerups. I thought the Shield Bot would protect me. Turns out, it doesn't, not much anyway.\n[*]Dark rooms are unnecessarily annoying. Doesn't add to gameplay aside from making me find one more powerup that may or may not be there.\n[*]Speed Module. I don't want to run faster, Fight is plenty fast. How about my bullets go faster instead?\n[*]Fragile Shell. I lose health for speed and RoF? Makes Fight almost uncontrollable. Lame.\n[*]UI gets in the way of... well, everything. Including itself (active save station icon is overlayed on minimap).\n[*]Doesn't scale well on 21:9 (3440x1440) monitors. Understandable because it's a minority resolution? Yes. Doesn't mean I liked it.\n[/list]\n[b]Things I Would Change: [/b][list]\n[*]Have some kind of \"completable\" check so I'm not missing powerups to progress, even after I've checked every room.\n[*]Get rid of Scrap counter on main UI and move it to the fullsize map display.\n[*]Fullsize map display is toggable, not hold to use.\n[*]Turn on and off powerups. E.g. Not a fan of Big Bolt, but I want my 100% item find.\n[*]Boss name display, rather than just \"Get Ready\". I know it's a boss fight, I've played a videogame before.\n[*]Jumping mechanics. It's too... floaty. Like I said, it feels like it's underwater.\n[*]More distinct areas.\n[*]RT + LT is always aiming straight up, regardless of movement.\n[*]Map size modifier. Like, Normal, Double, Quadruble for number of rooms.\n[*]Powerup exchange vendor. Trade one powerup for another one like it. E.g. firebolt for flamethrower, slide for spiderbot form and vice versa.\n[/list]\n\nBiased About:\nSome animations could use work, or a few more frames. Jump + shoot down in particular is kinda cringy. But I've also got a hard-on for how Super Metroid it looks, so I'm probably just unconsciously expecting that animation.\n\n[h1]Overall Impression:[/h1]\nIt's not a BAD game, don't get me wrong. Could it stand improvement? Sure. Most games could, so it's not like it's alone there. It's easy to pick up and play, it's stable, and it's fun in and of itself. However, having to abandon a run because I've explored everywhere and the powerup that will allow me to progress didn't spawn is insanely annoying. When successful runs are ~90 minutes and locked-out runs are anywhere from 20 minutes to almost an hour of futile searching, it's just maddening.\n\n[h1]Verdict[/h1]\nBeing the case, [b]I can't recommend the game [u]currently[/u][/b]. If this one thing were fixed, and every run were able to be completed, I would change my stance and Recommend the game.", "timestamp_created": 1506304301, "timestamp_updated": 1506304301, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.537931", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35190966": {"recommendationid": "35190966", "author": {"steamid": "76561198069014297", "num_games_owned": 247, "num_reviews": 22, "playtime_forever": 775, "playtime_last_two_weeks": 0, "last_played": 1512349506}, "language": "english", "review": "I have never though that Metroidvania gameplay can mix so well with Rogue-like. When I started, my first 2 plathroughs ended shortly, but I've learned from my mistakes and completed at least 5 runs. It's short and sweet, each runs lasting around 1 and a half hour, top. I've finish all these runs telling to myself \"just one more...\"\n", "timestamp_created": 1506287564, "timestamp_updated": 1506287564, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35190769": {"recommendationid": "35190769", "author": {"steamid": "76561197978367331", "num_games_owned": 208, "num_reviews": 11, "playtime_forever": 757, "playtime_last_two_weeks": 0, "last_played": 1511198517}, "language": "english", "review": "Great game! I really dislike most rougelike games but I made an exception for this one :D.\n\nFeels like metroid, like super OP metroid if you get lucky.\n\nYou can turn it into a rougelite by backing up your save games folder if you totally can't stand rouglike.", "timestamp_created": 1506286789, "timestamp_updated": 1506286789, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35189797": {"recommendationid": "35189797", "author": {"steamid": "76561198028465736", "num_games_owned": 229, "num_reviews": 5, "playtime_forever": 1212, "playtime_last_two_weeks": 0, "last_played": 1512446543}, "language": "english", "review": "With the abundance of rogue-lite procedurally generated permadeath games flooding the market, it's easy to look at this game and expect the worst. So many neat game ideas shackled to the extreme difficulty and constant re-playing of levels over and over just to get that tiny bit further, usually with tedious and absurd ways to slowly eek out progress in the metagame.\n\nA Robot Named Fight seems to toss all that nonsense aside in favor of a solid, fun, highly replayable experience. Or at least, that's what the game's first impressions seem to imply.\n\nRather than expecting you to learn every room and every enemy flawlessly, punishing every mistake and holding health drops and ammunition to ransom, ARNF embraces its obvious inspiration. Health and energy drop regularly and in ample supply, enemies respawn between rooms, and the overall gameplay balance seems to be made to facilitate fun encounters and exploration rather than focusing on lots of short-lived runs.\n\nPerhaps it's just my first impressions, but it seems to me like ARNF is more interested in giving you something fun and well polished to play that can be replayed over and over with different results, rather than making the roguelike elements a restraint that draws all the focus. I almost expect the roguelike elements were added in simply because they had too many ideas they wanted to add to fit a standard game, and so used procedural generation to shuffle elements between playthroughs.\n\nOn my very first run, I got 3 zones in. There are no absurdly tedious multi-step elevator/tunnel/teleporter metagame level skips either, which plague so many other games of this type. Expect to sit down and have loads of fun with a very faithful Super Metroid homage that happens to mix things up every time you die.", "timestamp_created": 1506283605, "timestamp_updated": 1506283605, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35181989": {"recommendationid": "35181989", "author": {"steamid": "76561198019092467", "num_games_owned": 185, "num_reviews": 10, "playtime_forever": 301, "playtime_last_two_weeks": 0, "last_played": 1505639949}, "language": "english", "review": "🤖 A Robot Named Fight! is a metroidvania roguelite that create new maps and items in every run. It looks very super metroid, but that is not a bad thing. The combat is good, and its fun to shoot everything in sight. The game can feel a bit slow and boring at the start, because you unlock items for future runs after killing bosses. After a while it can get repetitive to play the same part all over again after dying, and the levels don't feel THAT different each time. Still,  the bosses and the whole atmosphere of the game is great.", "timestamp_created": 1506262421, "timestamp_updated": 1506262469, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35139024": {"recommendationid": "35139024", "author": {"steamid": "76561198109781662", "num_games_owned": 45, "num_reviews": 7, "playtime_forever": 1015, "playtime_last_two_weeks": 0, "last_played": 1509049078}, "language": "russian", "review": "Очень хорошая игра. Начнем с того, что это метроидвания от слова \"метроид\". Игра очень похожа на основоположника жанра как визуально, так и геймплейно. С одной стороны у нас есть определненный набор способностей, которые помогают пройти в области, в которые ранее пройти было невозмоно, есть различное оружие и статы персонажа, которые пракачиваются находя секреты. С другой стороные есть полчища мерзких пришельцев, которые наровят вас уничтожить. \nК тому же игра сочетает в себе элементы roguelike, которые вкючают в себя довольно разнообразную процедурную генерацию уровней, и различные способности на каждое прохождение (что деалет игру еще более реиграбельной). Так же в игре есть вендоры, которые продают оружие и улучшения за материалы. \nВсе это в совокупности дает очень хорошую игру, с приятной атмосферой старого метроида, которая возможно не слишком объемная по своиму прохождению, но отличная во всех остальных аспектах.", "timestamp_created": 1506119243, "timestamp_updated": 1506119243, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35136279": {"recommendationid": "35136279", "author": {"steamid": "76561198328629655", "num_games_owned": 330, "num_reviews": 29, "playtime_forever": 738, "playtime_last_two_weeks": 0, "last_played": 1512526005}, "language": "english", "review": "rougelite super metroid. very well done, stays true to the metroid formula while flawlessley incorperating it into the rougelite genre with random level generation and great upgrades. the random level generation works very well. get this, support this dev as he seems to be passionate about his great game.Very very well done, highly recommended. also dont let that word rouge scare you away form this game! you need to experience this! tons of replay value. buy now, wishlist it, plan to have a great time.", "timestamp_created": 1506110144, "timestamp_updated": 1512501998, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35125829": {"recommendationid": "35125829", "author": {"steamid": "76561198004580377", "num_games_owned": 458, "num_reviews": 4, "playtime_forever": 4827, "playtime_last_two_weeks": 601, "last_played": 1514139891}, "language": "english", "review": "If you're looking for a yes or no, this is a yes. It's worth every penny and then some. \nAn excellent game, somehow made by one guy.\n\nARNF plays, feels, looks and sounds like an indie version of Metroid. In the best ways. \nAlbeit with a Robots Vs. Meat Monsters theme.\nIts controls are tight and the level design is solid. \nGood enemy variety as well, especially within the limitations of \"meat monsters\".\n\nOn one side, it's a roguelite. On the other side, each run is basically an independent Metroidvania game. \nWith each run taking between 50-70 minutes if you aren't rushing too much.\n\nYou start, fight your way to the first boss, then drop down into the exploration part of the game, it's fairly open but usually a loop that you can figure out vaguely where things are going to be. This makes \"speedrunning\" possible while still being randomly generated.\nThere are incentives to revisiting areas that you couldn't fully explore (like a proper metroidvania), there are merchants where you can buy some very helpful or powerful items and upgrades.\nLittle white circles on the map denote the general location of items (often hidden in the walls, floors or ceilings), it's entirely possible to 100% collect each item every run.\nThis is all good stuff that I'd expect from a pure metroidvania.\n\nOn the roguelite side, it does have permadeath and a generated map, different bosses are selected each run, different items and *key items. \nAs well as unlocks that affect future runs; items you can find or buy and the ability to sometimes start with extra items.\n\n*Key items being a staple of Metroidvanias, such as an item to let you move under 1-block-tall spaces, or explosives to bust through an armored door that you saw 20 minutes ago\n\nYou can even unlock one-shot save stations, up to 3 extra lives can generate on the map once you unlock this feature. Sometimes you won't even need them because, unlike a lot of other roguelites, this game isn't brutally hard.\nFor the most part, it's fair when you get hit. And if you get too low you can just run between two rooms collecting health (resources aren't limited!).\n\nThe developer seems dedicated to making this game the best it can be. This game is going places.", "timestamp_created": 1506080372, "timestamp_updated": 1506080372, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35102894": {"recommendationid": "35102894", "author": {"steamid": "76561198012039506", "num_games_owned": 165, "num_reviews": 6, "playtime_forever": 1069, "playtime_last_two_weeks": 0, "last_played": 1511784928}, "language": "english", "review": "This game is worth every penny, and still has plans to expand and add to it as time goes on. You will never have the same run twice, or the same room setup, and if you'rea really big fan of Super Metroid, then this game is right up your alley.", "timestamp_created": 1505995536, "timestamp_updated": 1505995536, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35095895": {"recommendationid": "35095895", "author": {"steamid": "76561198024091736", "num_games_owned": 607, "num_reviews": 25, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1505963797}, "language": "english", "review": "Feels like a crossover of Super Metroid & The Binding of Isaac. So far I'm really enjoying this. The controls are tight, the soundtrack is good and the variety of enemies does provide an ever increasing challenge.\n\nExcellent!", "timestamp_created": 1505961270, "timestamp_updated": 1505961967, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35090467": {"recommendationid": "35090467", "author": {"steamid": "76561198277504441", "num_games_owned": 462, "num_reviews": 141, "playtime_forever": 145, "playtime_last_two_weeks": 0, "last_played": 1505934769}, "language": "english", "review": "A solid take on the Metroidvania genre AND the rogue-lite genre as well. By that I mean that you'll get a different maps, powerups and bosses at each try. So you Vanialike is being roguified here. And not the other way around. Which is kind of a rare thing. The controls are very old school (especially the shoot) as a tribute to Metroid games. So is the gorgeous 2D art and music. One of the best of this kind this year so far.", "timestamp_created": 1505935010, "timestamp_updated": 1505935449, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35089840": {"recommendationid": "35089840", "author": {"steamid": "76561197978711297", "num_games_owned": 4996, "num_reviews": 29, "playtime_forever": 1031, "playtime_last_two_weeks": 0, "last_played": 1505342323}, "language": "german", "review": "Meinen ausführlichen Artikel findet ihr auf [url=http://polygonien.de/2017/09/super-metroid-rogue-like-win-a-robot-named-fight-im-test/]Polygonien.de[/url], aber das Fazit und eine Auflistung der wichtigsten Punkte gibt es direkt hier:\n\n[quote]Ich muss zugeben, dass ich mir aus Metroid nie wirklich viel gemacht habe. Trotzdem hat mich A Robot Named Fight! sofort in seinen Bann gezogen und ich glaube, dass es so manch echtem Metroid-Fan auch so gehen dürfte. Klar, viele werden sich weder mit Permadeath und zufällig angeordneten Arealen noch mit der kaum vorhandenen Story anfreunden können, aber wer sich daran nicht stört, der wird von dieser cleveren Neuinterpretation des klassischen Metroid-Konzepts nicht so schnell loskommen.[/quote]\n\n[b]Positiv:[/b]\n[list]\n    [*]frische Interpretation des altbekannten Metroid-Konzepts, perfekte Mischung aus neu und alt\n    [*]feiner Retro-Look\n    [*]gutes Handling \n    [*]unzählige Items, Waffen, Upgrades etc. zu finden\n    [*]fetziger Soundtrack\n    [*]auch das Scheitern wird belohnt, weil man trotzdem Dinge freischaltet\n    [*]kostenlose Content-Patches auch nach dem Release\n    [*]Entwickler hat immer ein offenes Ohr für Kritik und Ideen\n    [*]absolut fairer Preis\n[/list]\n\n[b]Negativ:[/b]\n[list]\n    [*]etwas mehr Umgebungen dürften es schon sein\n    [*]gelegentlich unfaire Situationen \n    [*]Story findet nur im Intro und dem Abspann statt \n    [*]grundsätzlicher Aufbau der Spielwelt doch meist recht ähnlich\n    [*]Koop ist eher ein Gimmick wie damals in Sonic \n[/list]\n", "timestamp_created": 1505932675, "timestamp_updated": 1505932675, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.619215", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "35077760": {"recommendationid": "35077760", "author": {"steamid": "76561198045190046", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 2352, "playtime_last_two_weeks": 245, "last_played": 1514343341}, "language": "english", "review": "Amazing and addictive Metroidvania/Roguelike! \n\nThe music is fantastic, graphics fleshed out (pun intended), and the style is so nostalgic. Fast paced is the word of the day.\n\nEasily worth my money.", "timestamp_created": 1505883650, "timestamp_updated": 1505883650, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35074636": {"recommendationid": "35074636", "author": {"steamid": "76561198049107911", "num_games_owned": 85, "num_reviews": 6, "playtime_forever": 3365, "playtime_last_two_weeks": 43, "last_played": 1513822336}, "language": "english", "review": "This game is perfect!\n\nWell, not pefect, but really good. It's scratched an exploration itch/metroid vibe that I've been needing to scratch for years. Each playthrough feels a bit different and the more stuff you unlock the better it gets. \n\nI've seen some people complain that certain parts are a straight rip of metroid/contra/megaman/etc. But that's kind of the point. This game is a love letter to all those games with the creator's own flair thrown in. \n\nThe developer also tries to be active in the servers and answer questions as they come. Pretty cool dude. \n\nI wish this game got more exposure because I love it! I can't wait for more content", "timestamp_created": 1505866849, "timestamp_updated": 1505866849, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.548872", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35067365": {"recommendationid": "35067365", "author": {"steamid": "76561197994989896", "num_games_owned": 187, "num_reviews": 2, "playtime_forever": 917, "playtime_last_two_weeks": 0, "last_played": 1511055330}, "language": "english", "review": "Solid gameplay, great atmosphere and soundtrack.  A metroidvania rogue-like that actually works.  It could stand to be a bit bigger, the bosses a bit more refined, but still a great game.\n", "timestamp_created": 1505837056, "timestamp_updated": 1505837056, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35054576": {"recommendationid": "35054576", "author": {"steamid": "76561198018767587", "num_games_owned": 129, "num_reviews": 6, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1506863224}, "language": "english", "review": "Fantastic Game, Great blend between rogue-lite and metroidvania.", "timestamp_created": 1505776759, "timestamp_updated": 1505776759, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35049105": {"recommendationid": "35049105", "author": {"steamid": "76561197996356022", "num_games_owned": 452, "num_reviews": 20, "playtime_forever": 2316, "playtime_last_two_weeks": 0, "last_played": 1512845370}, "language": "english", "review": "Spot on Super Metroid feel and look, and a solid and enjoyable roguelike to boot. Totally get this.", "timestamp_created": 1505753956, "timestamp_updated": 1505753956, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35038721": {"recommendationid": "35038721", "author": {"steamid": "76561198042280538", "num_games_owned": 173, "num_reviews": 9, "playtime_forever": 3465, "playtime_last_two_weeks": 89, "last_played": 1513226111}, "language": "english", "review": "If you like metroid AND Roguelikes, this is the game for you\nI'm not going to describe everything as you can find other reviews for this but here are my little thoughts:\n\nLevel design is cool but after 20 hours, it gets a bit stale, I'm hoping that in later updates, the dev furnishes us with more room variations. Same with powerups placements.\n\nPowerups are nice and orbs are a nice touch. I just wish there would be more area types (sections/sectors), more enemies and bosses, and more powerups... This game is so good I just want more or everything!!\n\nAlso I think it would be cool if there was a game mode where you could choose your upgrades (a bit like risk of rain) to allow us to play with the builds...", "timestamp_created": 1505708677, "timestamp_updated": 1505708677, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35038293": {"recommendationid": "35038293", "author": {"steamid": "76561198049730245", "num_games_owned": 522, "num_reviews": 10, "playtime_forever": 1474, "playtime_last_two_weeks": 129, "last_played": 1513460876}, "language": "english", "review": "A good game for doing quick runs when you want to play a game but don't have all the time in the world.\nI tend to have runs last around 1 hour and 20 minutes, its short for a metroidvania. . . but its meant to be played more than once, like other roguelikes.\n\nThere are several bosses you'll see and even the final boss has slight differences.\nThis game uses an unlock system for new runs, all the achievements unlock new upgrades for future runs.\nHowever the game has quite a few upgrades to start off with, and one of the nice things is that there are several upgrades that cover the same functions but are different in how they work (you usually only get one per run)\n\nThe game is a bit on the easier side but its not bad, more a relaxing game to play in my opinion.\n\nI had a lot of fun with this game, have yet to see everything though.", "timestamp_created": 1505706599, "timestamp_updated": 1505706599, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35037459": {"recommendationid": "35037459", "author": {"steamid": "76561198001961650", "num_games_owned": 926, "num_reviews": 48, "playtime_forever": 663, "playtime_last_two_weeks": 0, "last_played": 1508597279}, "language": "english", "review": "This game was amazing, addicting, and very reminiscent of Super Metroid. The procedural generation could use a bit more variety in room designs, and some are somewhat small, but these small gripes don't put much of a dent in this game. It controls well, has good variety in enemies, a very interesting story and setting, and all around amazingly timeless gameplay. It does suck to lose, but after finally winning and beating the Megabeast, I must say it is immensely satisfying. Worth the price tag, and I would definitely buy and play a sequel.", "timestamp_created": 1505702445, "timestamp_updated": 1505702445, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35033308": {"recommendationid": "35033308", "author": {"steamid": "76561198193640919", "num_games_owned": 76, "num_reviews": 4, "playtime_forever": 937, "playtime_last_two_weeks": 0, "last_played": 1511018863}, "language": "english", "review": "I just got my second Megabeast kill, and am loving the game so for. The generation works well, and I'm starting to see how the game map forms. My favorite feature is the replayability, but I would warn that if you don't like rougelikes or permadeath, this probably isn't for you.", "timestamp_created": 1505682849, "timestamp_updated": 1505682849, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35009548": {"recommendationid": "35009548", "author": {"steamid": "76561197963765812", "num_games_owned": 714, "num_reviews": 1, "playtime_forever": 879, "playtime_last_two_weeks": 0, "last_played": 1507711599}, "language": "english", "review": "This is procedurally-generated Super Metroid with flat stat upgrades instead of missile tanks everywhere, a sprinkling of subweapons that imitate things from other games of that era, and a tiny bit of Risk of Rain mixed in.\n\nThe music and atmosphere of this game is are both great. The story is woefully underdeveloped by comparison, but that's not terribly important because that's not what the game is about, it's just a little disappoint because it seems like it could be deeper due to the areas you visit. The controls are floaty but fairly easy to get used to, especially for a Metroid veteran. The enemies are all very gross and organic, and they seem interestingly parasitic--a lot of later enemies in the game are visibly combinations of previous enemies in ways that gives them unique abilities, which is very cool and feeds into the aesthetic. However, the biggest surprise was how good the procedural dungeon generation is. The overall layout is somewhat sporadic and doesn't feel as hand-crafted as a Metroid map, but the individual rooms are solid, and the enemy placement feels like what you'd see in a Metroid game; they even move around a bit after defeating a boss, and in true Metroid style, some areas will change quite a bit if you live long enough to revisit them.\n\nThe biggest problem with this game at the time of this review are the bugs. Occasionally, the camera sticks in place when it should be moving around a room with the character. This can usually be fixed by saving and reloading. Aiming doesn't seem quite as snappy as it should, either, as holding up actually causes the character to aim diagonally upward for a moment before aiming straight up. Sometimes projectiles will float in the direction you aimed for a moment and then drift off in a different direction, too. Some specific weapons seem to be far more succeptable to this behavior than others, namely the flamethrower. That all said, none of this stuff is utterly gamebreaking and it didn't really hurt my experience beyond the initial confusion.\n\nThe only actual gripes I have for this game are that it's so short and easy. I'm not terribly good at Metroid. In fact, Fusion is the only 2D Metroid I've ever completed. But I beat this on my second playthrough, and the only reason I died in the first one was because a door transition walked me out into some spikes at a bad time. You see, most of the bosses in this game are just a bit beefier than normal enemies. You can smoke them pretty fast just by constantly shooting them--most of them don't have gimmicky methods of hurting them like Metroid bosses do. In fact, the first boss I fought became a regular enemy near the end of the game, albeit in an optional gauntlet that lead to some upgrades. These complaints don't extend to the final boss, which is frantic and difficult for reasons I won't get into. Experience it for yourself.\n\nOverall, I would highly recommend this little gem. It's not long and it's not terribly difficult unless you roll a rough dungeon, but it has very high replayability factor. If you ever finished a Metroid game and said, \"That was fun, but I sure wish I could just have more of that.\" Well, now you can have more fresh Metroid experiences. Repeatedly. For a mere ten dollars. If this game is on sale and you don't already own it, there's absolutely no reason you shouldn't buy it immediately.", "timestamp_created": 1505604253, "timestamp_updated": 1505604253, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34998549": {"recommendationid": "34998549", "author": {"steamid": "76561198081199744", "num_games_owned": 371, "num_reviews": 2, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1510800464}, "language": "english", "review": "A very unforgiving Metroidvania style game. It definitely gets better the more you play and the further you get, but don't get too cocky or you'll be back at the start as harsh as a roguelike game or like in Binding of Isaac.", "timestamp_created": 1505572479, "timestamp_updated": 1505572479, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34994285": {"recommendationid": "34994285", "author": {"steamid": "76561198078590661", "num_games_owned": 55, "num_reviews": 4, "playtime_forever": 434, "playtime_last_two_weeks": 0, "last_played": 1505613494}, "language": "spanish", "review": "Gran juego!.", "timestamp_created": 1505560846, "timestamp_updated": 1505560846, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34987615": {"recommendationid": "34987615", "author": {"steamid": "76561198035353425", "num_games_owned": 237, "num_reviews": 23, "playtime_forever": 374, "playtime_last_two_weeks": 0, "last_played": 1505615224}, "language": "english", "review": "Very fun mixture of the metroidvania and roguelite genres. I even like this better than Dead Cells. Would definitely recommend for the price.", "timestamp_created": 1505536773, "timestamp_updated": 1505536773, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34977422": {"recommendationid": "34977422", "author": {"steamid": "76561197969246511", "num_games_owned": 232, "num_reviews": 9, "playtime_forever": 614, "playtime_last_two_weeks": 26, "last_played": 1514317654}, "language": "english", "review": "Copies the classic Super Metroid formula but pastes it into a Rogue Legacy / Dead Cells style game. It seems like a putdown to describe a game with only other game titles but it works very well, and I'm enjoying it a lot. Very horror / gross factor style and not much of a story but if you like exploring and shooting things this will do it for you.\n\nEven though it's an unlocking rogue legacy style game you aren't really hopeless when you first start out, with skill you can stay alive even if you're underpowered. Would recommend to anyone that likes side scrolling shooters in general, and Super Metroid specifically\n\n", "timestamp_created": 1505496953, "timestamp_updated": 1505496953, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34971088": {"recommendationid": "34971088", "author": {"steamid": "76561198035600918", "num_games_owned": 105, "num_reviews": 10, "playtime_forever": 2230, "playtime_last_two_weeks": 0, "last_played": 1511007397}, "language": "english", "review": "This game looks very simplistic, almost not-impressive at first.\n\nBut then you play, and play, and just wanna play more!\n\nNow I've played Spelunky, Shovel Knight etc... but strangely, A Robot Named Fight has me hooked way more than those other games did. And with the developer Matt planning to put out more content over time, I could see myself playing this for a long time.\n\nCan't wait!\n\nAnd most definitely worth the price of admission.", "timestamp_created": 1505480129, "timestamp_updated": 1505480230, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.542484", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34970674": {"recommendationid": "34970674", "author": {"steamid": "76561198070930881", "num_games_owned": 518, "num_reviews": 93, "playtime_forever": 1075, "playtime_last_two_weeks": 0, "last_played": 1511202551}, "language": "russian", "review": "Update:\nДобавлена видео версия\n\nhttps://www.youtube.com/watch?v=pfpUkEeVubo&t=161s\n\nРазработчик явно вдохновлялся Метроидом, и это видно.\nК сожалению у нас в стране, что метроид, что сопутствующие ему жанры, которые в последующем называли метроидованиями не прижились.\nНаше сообщество Геймеров не понимает этот жанр, не хочет понимать и считает скучным.\nЯвный тому пример Томас Хапп который в одного сделал шедевральный Аксиом Вёрдже.\n( Неудивительно, трудился несколько лет ). Аксиом имеет положительные отзывы из за рубежа, но очень мало русских, и честно говоря не понимаю почему.\n\nДавайте так, я постараюсь вкратце объяснить, что же такое Метроид. А вы сами потом решите, надо оно вам дальше читать или нет.\nМетроид, или метроидоподобные игры включают себя обширные территории - лабиринты, поделенные на зоны, в которые ты просто так не попадешь. Для того, что бы попасть в нужную область, нужно обзавестись апгрейдом.\nВы улучшаете свой костюм, приобретаете новое оружие, навык, или что нибудь еще, и с помощью этого попадаете в нужную зону. Если апгрейд вы не нашли или пропустили, дальше вы никак не пройдете. Кроме того, и без апгрейдов в лабиринте находится куча секретов, которые тоже следует искать, ведь в каждой зоне вам будет все сложнее и сложнее. Это если вкратце. То есть, образно, что есть Метроид? Экшн, Приключенческая - Лабиринтоподобная игра с элементами платформера, с прокачкой и исследованием территорий. Нравится лазить по локациям, обшаривать все углы, искать секреты, прокачиваться, ну и биться с врагами, вам это подойдет.\n\nИтак, что же представляент из себя A Robot Named Fight?\nЭто не Метроидования....нет...\nЭто прямой и духовный наследник Метроида.\nВот все, что я описал выше, здесь это все есть, но в более обширном варианте.\nПаверапов больше 50 штук.\nСолидный выбор оружия.\nВозможность апгрейдить своего персонажа чипами у специальных \"торговцев\"\n6 обширных зон и огромная карта.\nОдно прохождение, в первый раз займет у вас более 2х - 3х часов, а если вы новичок, и никогда не пробовали этот жанр то и все 4, а то и 5ть.\nОднако, это не все, на жворе 2017 год, и разработчик скрестил Метроид с Роуглайком.\nТо есть, присутствует процедурная генерация ( весьма хорошая ), зоны и лабиринты всегда разные, препятствия всегда разные, боссы меняются.\nЧем дальше вы пройдете, тем больше контента вы откроете.\nНе надейтесь на чекпоинты, или ручные сейвы, их тут нет.\nМожно найти точку сохранения, одну - две за всю игру, это позволит умереть вам один раз, и все. После использования камеры, после смерти вы начинаете с самого начала.\nСохранение при выходе из игры работает в том случае, если вы не умирали.\nРеиграбельность на высоте. Играть интересно каждый раз, открывая что то новое. Да каждый новый лабиринт, это уже втягивает.\n\nНу кроме того, игра может похвалиться хорошей 16 битной графикой, хорошей прорисовкой,\nхорошим саундтреком.\n\nВидно, разработчик любит этот жанр, и создал свой Метроид, который сам хотел, и очень удачно. Не ушел от канонов, и сделал все как надо. Даже лучше.\n\nОценка 9 из 10.\n\nТаких игр вы мало где найдете. \nПопробуйте, и не пожалеете.", "timestamp_created": 1505478809, "timestamp_updated": 1506246779, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.629037", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34967382": {"recommendationid": "34967382", "author": {"steamid": "76561197995207287", "num_games_owned": 545, "num_reviews": 9, "playtime_forever": 1092, "playtime_last_two_weeks": 0, "last_played": 1505718348}, "language": "english", "review": "Excellent bite sized metroid adventure.  Longest run to completion was an hour and a half with my normal time being around 55 minutes.  Good for when you just want to play something quick.", "timestamp_created": 1505466214, "timestamp_updated": 1505466214, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34961965": {"recommendationid": "34961965", "author": {"steamid": "76561198005890298", "num_games_owned": 123, "num_reviews": 1, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1505162138}, "language": "english", "review": "Ok, I'm a super fan of metroidvanias, and Hollow Knight is my favorite. This game has a lot of promise, but they've got to fix the \"floatiness\" of the controls and physics in the game. I'm old enough to have played the original Metroid when it first came out, as well as Super Metroid, and both have controls and physics that are tighter than this. Like I said, a lot of promise and I bought it to support it, but it's almost unplayable for me. See Hollow Knight for perfect tight controls. Kudos to the developers for starting something so promising, but please fix this so I can sink more hours in!", "timestamp_created": 1505441070, "timestamp_updated": 1505441070, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34960923": {"recommendationid": "34960923", "author": {"steamid": "76561198039309841", "num_games_owned": 305, "num_reviews": 43, "playtime_forever": 323, "playtime_last_two_weeks": 12, "last_played": 1514196391}, "language": "english", "review": "It's pretty good.", "timestamp_created": 1505436472, "timestamp_updated": 1505436472, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519231", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34952926": {"recommendationid": "34952926", "author": {"steamid": "76561198180181306", "num_games_owned": 17, "num_reviews": 1, "playtime_forever": 70, "playtime_last_two_weeks": 0, "last_played": 1505408767}, "language": "english", "review": "Enjoyed it quite a bit. But permadeath really kills it... it gets to the point where you're doing the same thing over and over again. If they had a save feature, then it would be fine... but they don't. Any save station is simply a one time deal.", "timestamp_created": 1505409205, "timestamp_updated": 1505409205, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.480878", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34952053": {"recommendationid": "34952053", "author": {"steamid": "76561198072734933", "num_games_owned": 138, "num_reviews": 7, "playtime_forever": 1096, "playtime_last_two_weeks": 0, "last_played": 1506723783}, "language": "english", "review": "A truly amazing game. If you love metroid you'll love this. If you love Binding of isaac you'll love this. If you enjoy both of these brings a c*m rag.\n\nPROS\n+Item upgrades feel generally satisfying\n+Not to long and not to short, expect the average run to be 45-70 minutes 30-35 if speed running\n+bosses are a great challenge and aren't unfair save one (See below in cons)\n+Scraps give you a reason to not skip all enemies\n+2 of the three vendors always feel worth visiting\nCONS\n+The rng can sometimes turn your ass from a hallway to the marianas trench. (Example you'll be one hit playing it safe and a doorway throws you into a random creature killing you. Or the megabeast gets strait spawning attachments and overwhelms you)\n+The floating mouth with an eye boss tends to appear in the first or second area and is a real headache he has a cheese, but if you need a cheese to beat a boss there is a problem in its design. (Again every other boss is fun and something to look forward to.)\n+The orb vendor is kind of like running into a homeless person who mugs you and gives you his old shoes as a pity consolation.", "timestamp_created": 1505406645, "timestamp_updated": 1505406645, "voted_up": true, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34951538": {"recommendationid": "34951538", "author": {"steamid": "76561198035875386", "num_games_owned": 91, "num_reviews": 9, "playtime_forever": 381, "playtime_last_two_weeks": 0, "last_played": 1505867602}, "language": "english", "review": "Do you like 2D Metroid? You do? Buy this game. No seriously, that's all you really need to know. If you don't buy this game and you like 2D Metroid then you never liked 2D Metroid to begin with.", "timestamp_created": 1505405245, "timestamp_updated": 1505405245, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34950472": {"recommendationid": "34950472", "author": {"steamid": "76561198179157882", "num_games_owned": 284, "num_reviews": 9, "playtime_forever": 559, "playtime_last_two_weeks": 0, "last_played": 1512485072}, "language": "french", "review": "Comment résumer le jeu rapidement...\n\nVous prenez Metroid, vous changer les personnages, vous rajouter du sang, du malsain ainsi que du rogue like et vous avez A robot Named Fight.\n\nA chaque mort définitive, vous recommencer sur une nouvelle carte. Les boss, les pouvoirs et les plateformes sont totalement aleatoire et sont débloquer au file des parties achever ou non (J'ai pas encore reussi une partie sans mort définitive). Concept très sympas mais surtout réserver au fan de Metroid avec quelques références à Mega Man X comme les barres de vie par exemple ou encore Dead space par moment (très légèrement).\n\nBref a prendre les yeux fermer pour les fans de Metroid et ceux qui adore l'aventure avec du challenge.\n\nPour mon avis perso : Gros coup de coeur <3", "timestamp_created": 1505402161, "timestamp_updated": 1505402161, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34950010": {"recommendationid": "34950010", "author": {"steamid": "76561198026392954", "num_games_owned": 90, "num_reviews": 4, "playtime_forever": 3018, "playtime_last_two_weeks": 0, "last_played": 1510260687}, "language": "english", "review": "A fantastic clone game that does everything right. the weapons and Items are all fun to use and gameplay smooth.\nthough I did find a couple things wrong with the game but it was so minor I can get over that and I hope they continue to add more to the game.", "timestamp_created": 1505400760, "timestamp_updated": 1505400760, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34949705": {"recommendationid": "34949705", "author": {"steamid": "76561198035688014", "num_games_owned": 435, "num_reviews": 17, "playtime_forever": 3311, "playtime_last_two_weeks": 212, "last_played": 1513344948}, "language": "english", "review": "great soundtrack, massive replayabilty and a gameplay tighter than your mum pussy. its a definitly buy for fans of metroidvania/metroid and a worth look if you like playing 2d plataformers.", "timestamp_created": 1505399822, "timestamp_updated": 1505399822, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.440910", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34946585": {"recommendationid": "34946585", "author": {"steamid": "76561198003120459", "num_games_owned": 111, "num_reviews": 3, "playtime_forever": 2520, "playtime_last_two_weeks": 194, "last_played": 1514125515}, "language": "english", "review": "It is like the old 2D Metroid games with very fluid and satisfying gameplay but the most interesting part is the randomization.\n\nThe map is different in each playthrough but every time you beat the endboss, it feels like the procedural generation is evolving.The first two playthroughs teach you the different obstacles and mechanics. After that it becomes more complex and challenging to beat the game.\n\nSo don´t wait for a sale because the 10 bucks are definitely worth it.", "timestamp_created": 1505388099, "timestamp_updated": 1505388099, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34945671": {"recommendationid": "34945671", "author": {"steamid": "76561198043967769", "num_games_owned": 469, "num_reviews": 2, "playtime_forever": 360, "playtime_last_two_weeks": 0, "last_played": 1505616533}, "language": "japanese", "review": "メトロイドヴァニアとローグライトの要素がバランスよく組み合わさったプラットフォームゲームです。\nプレイヤーキャラクターのロボットを強化しながら要所要所に待ち構える中ボスを倒して進み、\n彼らの世界に大災厄をもたらした元凶に立ち向かう...というのが主な流れになります。\n\n[u]【良い点】[/u]\n本作の最大の特長は、ゲームの進行にってプレイヤーキャラクターの能力が次々とアンロックされていくメトロイドヴァニアの特徴と、\nワールドの自動生成システムがうまく調和している点です。\nこのゲームでは、フロアの形状や敵の配置だけではなく、プレイヤーキャラクターの行動範囲を広げるパワーアップアイテムの入手順序も自動生成の範囲に含まれています。\n加えて、例えば天井が狭い通路をスライディングで超えるのか、背丈の低いクモ状に変形して超えるのかなど、一つの障害を越えるための手段も複数用意されています。\nこれらの仕掛けによって、プレイヤーは遊ぶたびに展開の異なるメトロイドヴァニアを楽しむことができます。\n\n[u]【悪い点】[/u]\n・プレイヤーキャラクターの体力や攻撃力などを強化するアイテムは、マップに大まかに表示されるマークを頼りに各フロアの壁や床を破壊して見つけるのですが、これが面倒くさい。\n特に広いフロアにダメージゾーンや消える床などのギミックが組み合わさった場合には、プレイしていて苦痛を感じます。\n・中ボスの動きに工夫がなく単調です。多くのボスは遠くでウロウロしているところにメインの武器を乱射するのが有効な攻略法です。\n", "timestamp_created": 1505383663, "timestamp_updated": 1505383663, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.642857", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34943296": {"recommendationid": "34943296", "author": {"steamid": "76561198006269309", "num_games_owned": 331, "num_reviews": 21, "playtime_forever": 236, "playtime_last_two_weeks": 0, "last_played": 1505370288}, "language": "english", "review": "What a great game in the likeness of metroid and castlevania of Old", "timestamp_created": 1505370370, "timestamp_updated": 1505370370, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34925325": {"recommendationid": "34925325", "author": {"steamid": "76561197998479801", "num_games_owned": 740, "num_reviews": 2, "playtime_forever": 250, "playtime_last_two_weeks": 5, "last_played": 1513974480}, "language": "english", "review": "A fantastic roguelike that barely feels procedurally generated because of the clever mechanincs and using certain items to gate content behind bosses and such. It feels like a metroid game with all the backtracking, upgrading & exploring that comes with it.\n\nWonderfully excecuted!", "timestamp_created": 1505329115, "timestamp_updated": 1505329115, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.564754", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34919841": {"recommendationid": "34919841", "author": {"steamid": "76561197966446818", "num_games_owned": 1100, "num_reviews": 55, "playtime_forever": 111, "playtime_last_two_weeks": 0, "last_played": 1505412250}, "language": "english", "review": "Love Metroid?  Wish it was endless?  Then check this out.  Each playthrough is random, and you will unlock new items for future playthroughs.  \n\nThis game has proven to be fun for quick 15 minute game breaks, and also to sit down with for a while and just explore.", "timestamp_created": 1505310340, "timestamp_updated": 1505310340, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.488231", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34917313": {"recommendationid": "34917313", "author": {"steamid": "76561198188515021", "num_games_owned": 1263, "num_reviews": 287, "playtime_forever": 39, "playtime_last_two_weeks": 0, "last_played": 1506070697}, "language": "english", "review": "hemmorrhoidvania\nwith lots of pus and septic leakage\nrouge lite like totally", "timestamp_created": 1505300671, "timestamp_updated": 1505300671, "voted_up": true, "votes_up": 4, "votes_funny": 3, "weighted_vote_score": "0.531876", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34917201": {"recommendationid": "34917201", "author": {"steamid": "76561197975686297", "num_games_owned": 348, "num_reviews": 5, "playtime_forever": 696, "playtime_last_two_weeks": 0, "last_played": 1506732648}, "language": "english", "review": "I wanted to like this game, I really did but after getting my SAVE GAME REMOVED RANDOMLY I cannot. I  hate the fact that I\"m being forced to start over and frankly it's just not fun. Powerups are so random and most of them, especially the orbs, are completely useless. Before the developer rolled out the patch I was getting fun weapons and the game was fine. Now it's just stupid crap game after game. Wow... another flame thrower / slide / double jump run for the 9th time in a row. I simply cannot reccomend this game. I ask myself \"Would I let sony , nintendo, or anyone else get away with literally erasing my game becuase of careless behavior?\" The answer is \"no\" and i won't let it fly here. Don't buy it. It's not worth the time.\n\nPros :  If you like rogues you may enjoy running through the same rooms over and over again.\n           - Music is passable\n\nCons : way to many game breaking bugs\n           - too easy to get stuck in walls\n           - makes you want to play Super Metroid and forget this game ever existed\n           - your save game will randomly vanish\n           - get far enough to get new stuff, die , restart , repeat to you are braindead", "timestamp_created": 1505300198, "timestamp_updated": 1505300198, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.386470", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34914587": {"recommendationid": "34914587", "author": {"steamid": "76561198025148070", "num_games_owned": 490, "num_reviews": 47, "playtime_forever": 746, "playtime_last_two_weeks": 0, "last_played": 1512454169}, "language": "english", "review": "Needs some tweaking. Over all a great game. \n\nIf the whole GORE thing turns you away from the trailers, its not really that bad, and honestly if the dev asked me how to change their trailer I would say focus on what you do interesting rather than the whole GORE thing. \n\nMade by a single guy for the most part. \n\nUsing examples of other games, this game is literally a Metroid / Binding of isaac like game. \n\nEvery run you do is some what random, bosses, actual room lay outs, direction you need to go. But the metroid aspect comes from actually gaining items that enhance you. Things like double jump, charge beam. Which not only give you more freedom or strength, they also open up their own paths opening more of the game. \n\nA great example of this is the sub weapon system, you have a small energy pool (recharges on its own slowly) Which allows you to use things like Lightning Rod which pierces walls, locks on to enemies, AND does the same affect that a charge beam would on doors. So while your run may NEVER come across Charge Beam you'll have that Lightning Rod gun to open doors, and paths.\n\nUnlocks work a lot like Binding of Isaac, which is fine. The majority of items are always good. And the Dev is fairly active in the forums and does take suggestions!\n\nI hope this dev goes on to maybe growing the content or even a continuation with more items, and such. But for the cost this game is a great grab for that Metroid itch you may have!", "timestamp_created": 1505286065, "timestamp_updated": 1505286065, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503903", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34914133": {"recommendationid": "34914133", "author": {"steamid": "76561198052771375", "num_games_owned": 168, "num_reviews": 20, "playtime_forever": 68, "playtime_last_two_weeks": 0, "last_played": 1504928337}, "language": "english", "review": "Controls a lot like Super Metroid, and the visuals generally have that same vibe as well. Some of the player animations are pretty silly, though (aerial downward shooting and the crouch animation stand out the most).", "timestamp_created": 1505283288, "timestamp_updated": 1505283288, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34911879": {"recommendationid": "34911879", "author": {"steamid": "76561198157926092", "num_games_owned": 205, "num_reviews": 25, "playtime_forever": 286, "playtime_last_two_weeks": 0, "last_played": 1505534307}, "language": "spanish", "review": "Es un buen juego, casi una copia identica a lo que es super metroid, añade variedad de armas e items, en mi caso especifico lo compre por el multijugador local, ya que senti que es era algo novedoso, pero el jugador 2 no es un robot, es solo un satelite que flota y dispara, recoge items, no tiene otra funcion. \n\nEntre los puntos positivos:\n+los mapas se generan de manera aleatoria\n+se van desbloqueando items en cada partida\n+metroidvania con cooperativo local.\n+musica y graficos muy apegados a supermetroid\n+Roguelike sin la dificultad tan disparada, es justo.\n\nEntre los puntos negativos:\n-el Player 2 es solo un satelite que flota y dispara\n-hacen falta powerups para el player 2, ya que para tu amigo puede volverse una experiencia aburrida.\n-Necesita un poco mas de variedad de contenido\n-Se vuelve un poco repetitivo.\n\nSi lo picas de oferta yo diria que es buena compra.\n\n\n\n\n\n\n", "timestamp_created": 1505269001, "timestamp_updated": 1505269001, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.505173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34911774": {"recommendationid": "34911774", "author": {"steamid": "76561198082004172", "num_games_owned": 99, "num_reviews": 1, "playtime_forever": 1035, "playtime_last_two_weeks": 0, "last_played": 1506114800}, "language": "english", "review": "This game is amazing! You start out as a weak robot, and you will probably lose for a while at first, since this game is perma-death. But as you play, you will unlock new weapons that can be used in future games, which take you farther aand farther until you are super OP! The graphics, music, and gameplay are all top notch. If you like Contra, Mega Man, Castlevania, and Metroid, then I can't recommend this game enough. Buy it, and support the creator, and maybe we'll get more awesome games like this in the future!", "timestamp_created": 1505268390, "timestamp_updated": 1505268390, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34911180": {"recommendationid": "34911180", "author": {"steamid": "76561198003270453", "num_games_owned": 163, "num_reviews": 1, "playtime_forever": 354, "playtime_last_two_weeks": 0, "last_played": 1512928440}, "language": "english", "review": "This game is awesome!  A great tribute to the era of weekends spent battling space pirates, vampires and solving puzzles.\n\nThe random generation of levels makes it fun to play over again.", "timestamp_created": 1505264563, "timestamp_updated": 1505264563, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.461310", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34908666": {"recommendationid": "34908666", "author": {"steamid": "76561198139124725", "num_games_owned": 181, "num_reviews": 6, "playtime_forever": 1767, "playtime_last_two_weeks": 0, "last_played": 1511581867}, "language": "english", "review": "tl;dr Best sentence to describe this game: semi-permadeath Super Metroid randomizer.\n\nYou play as a robot named Fight, one of the last robots willing to stand up to the fleshy abominations of Megabeast, by going deep into the earth and gathering all the fight he can! ... eh, screw it. The story is not the main focus, and thank god its not, because its just about killing some giant flying meatball.\n\nAs soon as you start the game, you immediately go into the settings and fix your button layout. I don't have a 360 contoller, and I don't know why, but my Generic USB Joystick (my GameCube controller) has an inverted axis only on this game, and I can't seem to fix it. So I had to use keyboard, which was probably the best option for me. The most suitable way I found is to have movement with 'WASD', diagonal aiming and switching weapons on the arrow keys, Space to shoot and Enter to jump.\n\nThe game doesn't hold your hand, and unless you know how Super Metroid controls, you may go through a few playthroughs getting confused about the control scheme.\n\nUpon choosing 'New Game' the world is created, building a map using pre-existing rooms with random powerups in them.\n\nEven if you only get terrain-phasing shots, four orbs, and no energy weapons, or something equally ridiculous, the game is still entirely completable as its procedurally generated to construct the world's obstacles based on the upgrades you are given. Because of this, the game is fairly linear, and you should be able to get 100% completion as long as you go through every room, since there's no secret rooms or alternate shortcuts, and all the items show up on your map.\n\nEventually you'll come to your first boss, 1 out of 3 random bosses for each area. Although these bosses are simple enough, they can be quite hard especially at the start since you're only guaranteed one or two powerups, which may not even be for your weapon.\n\nIf you beat the boss, you'll be introduced to the game's semi-permadeath mechanic, with new items and perks for all future playthroughs as you progress and unlock achievements. \n\nThese items can be found in upgrade rooms, or forged by the hand of allies whom you can find in the lower levels of the world. To craft these items, you use scrap found from monsters, or found randomly in hidden locations where powerups can also spawn. You don't need to craft these for 100% completion, but you do need to find all the ones across the world.\n\nIf you manage to survive the onslaught of all four areas and their respective bosses, the objective now is to go all the way back to the start and kill Megabeast. Assuming you beat the damage sponge that is the final boss, you teach robotkind the important lesson that things die when you kill them.\n\nThe ending wraps up telling you Megabeast's arrival was due to the 'anti-fascist' Mole People, and that many other robots will now take on the name Fight and challenge Megabeast. Which kind of makes sense with the permadeath idea. S'not 'A Robot Named Fight' as much as it is 'Multiple Robots Named Fight'. \nAnd the game ends with no further explanation. And then you win! Cheers!\n\n\nMusic and graphics are alright.\n", "timestamp_created": 1505250854, "timestamp_updated": 1505250854, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.517982", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34906390": {"recommendationid": "34906390", "author": {"steamid": "76561198157979577", "num_games_owned": 127, "num_reviews": 11, "playtime_forever": 318, "playtime_last_two_weeks": 0, "last_played": 1509728500}, "language": "english", "review": "I really like this game. Good artstyle, great soundtrack and amazing concept as whole. Reminds me somewhat of The Binding of Isaac with the whole \"find items that make you stronger\" stystem, which I really like. I do wish that the game had some sort of online feature though to play with friends who live further away from you. Can't wait to get to experience more of this game, 7/10 so far!", "timestamp_created": 1505241562, "timestamp_updated": 1505241562, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34904075": {"recommendationid": "34904075", "author": {"steamid": "76561197965922649", "num_games_owned": 475, "num_reviews": 21, "playtime_forever": 173, "playtime_last_two_weeks": 0, "last_played": 1505217389}, "language": "english", "review": "It was ok, compared to super metroid, not as challenging, but I like the graphics and the enemies.\nmusic was kinda bad. turned out to be alot of backround noise for the most part.\n\nI completed a 97% run in about 50 minutes. so it's not really a big game, but then again, you unlock things when you get to kill a boss you have never seen before, and also when coming into a new zone for the first time. \n\nall and all, its a big maybe. but better than many other metroidwannabes out there.", "timestamp_created": 1505232712, "timestamp_updated": 1505232712, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34903076": {"recommendationid": "34903076", "author": {"steamid": "76561198027381932", "num_games_owned": 306, "num_reviews": 1, "playtime_forever": 1484, "playtime_last_two_weeks": 0, "last_played": 1512237103}, "language": "english", "review": "Felt a little biased writing a review here as I know him a bit, but I'm very impressed with this game. I read reviews and kind of saw how they explained a little bit of the programming made to make a consistent roguelike metroidvania, but it didn't take the wonder away. I like the choices given and I like that there are more upgrades than necessary. It makes playthroughs all the more interesting when you have a different combination of abilities each time.  I genuinely think it brings a better sense of satisfaction finding upgrades in this game than in Metroid games. The tiny ability upgrades makes you feel like Fight gets stronger and stronger, rather than just plateauing and gaining a new ability.  Felt like an RPG element in a metroidvania I didn't know I wanted until now.\n\nIt wears it's inspiration on its sleeve, definitely. The hallways feel sometimes almost copy and pasted from Super Metroid (one time I found a secret in the exact same place as in SM). I get that Binding of Isaac is a revered game, but the art style is personally off putting. Thankfully the gameplay here is good enough to stomach the art direction inspired (at least partly) by that. \n\nThe game seems a bit like the difficulty swings from thrive or die, what I mean by that is I never have a problem with my health or with my energy... until I do. The challenges here are big, but in a game that takes on the metroidvania and roguelike challenges at the same time, the feeling of peril doesn't really get you until you hit an unescapable boss room. I feel like this may be a tough obstacle to hurdle in a procedurally generated game, but the juxtaposition between run and gun, moderate invincibility in exploration zones and then crushed like an origami crane during some of the harder boss battles is just frustrating. You forget what you're getting into.\n\nIf I could fix any things about the game though? I'd have a more easy to control aiming system, putting aiming as an option on the right analog stick seems like a no brainer. I'd fix hit boxes and collision detection, I can't tell you how many times I have wasted time just trying to jump up a one box hole when Fight's sprite looks slender enough to fit. And lastly, I'd at least include a settings option to turn off the flashing lights in a certain section of the map. It doesn't really feel like they add anything, but they are a strain on my eyes and I'd worry for someone who has a more sensitive reaction than me.\n\nAll in all its a pretty great game and I can't wait to keep playing it and finding all the things the world has to offer.", "timestamp_created": 1505229290, "timestamp_updated": 1505230450, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34902373": {"recommendationid": "34902373", "author": {"steamid": "76561198078153982", "num_games_owned": 97, "num_reviews": 10, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1511015953}, "language": "english", "review": "A Robot Named Fight is an easy 10/10. It's the most fun I've had from a procedurally generated game since Rogue Legacy. It's Super Metroid mixed with Turrican with endless replayability. It's great because no matter how many times you die, it's always fun to restart and try again with the newly unlocked abilities and handicaps. I wish I paid the full $9.99, because this guy deserves it!\n\n\nAt just under 3 hours total playtime and about six playthroughs I have completed the game with 97% item collection and 1 hour, 7 minutes on the clock. I stand by my review. $7.49 is a steal. Heck, $9.99 is still a bargain.\n\nLoved it!\n\nIf you want more Metroid on Steam check out Environmental Station Alpha and Nakawak.", "timestamp_created": 1505226778, "timestamp_updated": 1507502928, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34900593": {"recommendationid": "34900593", "author": {"steamid": "76561198027269114", "num_games_owned": 87, "num_reviews": 3, "playtime_forever": 1244, "playtime_last_two_weeks": 250, "last_played": 1514113935}, "language": "english", "review": "It's worth mentioning that this is one of the very few games I've seen that 100% supports the Playstation 4 controller without the need for 3rd party software.\n\nI didn't even realize that this game was permadeath and randomized until finishing my first run. Highly recommended for anyone who likes the randomized Super Metroid mods.\n\nBecome Fight. For great justice.", "timestamp_created": 1505221143, "timestamp_updated": 1505221227, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523439", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34894567": {"recommendationid": "34894567", "author": {"steamid": "76561197996757858", "num_games_owned": 1054, "num_reviews": 5, "playtime_forever": 1080, "playtime_last_two_weeks": 9, "last_played": 1513990427}, "language": "english", "review": "Super Metroid meets Isaac.\n\nGame plays very much like Super Metroid with the Item Randomizer mod. Except that on only are the items randomized but so is the level layout.\n\nYou can find items and upgrades that only lasts until you die and there are some items that unlock more weapons and abilities in futre games.\n\nAlso Earning certain achievments unlocks more items", "timestamp_created": 1505188112, "timestamp_updated": 1505188112, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34894053": {"recommendationid": "34894053", "author": {"steamid": "76561197992523098", "num_games_owned": 81, "num_reviews": 11, "playtime_forever": 989, "playtime_last_two_weeks": 0, "last_played": 1509147439}, "language": "english", "review": "Just think of the staggering amount of cigarettes, coffee, and condoms I would have gone through if this game had come out during the 80's arcade scene.", "timestamp_created": 1505184692, "timestamp_updated": 1505184692, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.488559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34892585": {"recommendationid": "34892585", "author": {"steamid": "76561198071971056", "num_games_owned": 1076, "num_reviews": 18, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1505336365}, "language": "english", "review": "exactly the type of game i hoped it would be, plus more", "timestamp_created": 1505175986, "timestamp_updated": 1505175986, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34890885": {"recommendationid": "34890885", "author": {"steamid": "76561198053075672", "num_games_owned": 619, "num_reviews": 1, "playtime_forever": 728, "playtime_last_two_weeks": 0, "last_played": 1508027000}, "language": "english", "review": "It's Super Metroid in the best kind of way. You can tell this game is a love letter to the genre, and it scratches just about every itch that's associated with it.\n\nI'm not fantastic at reviewing so I'll just skip right to the Pros and Cons:\n\nPros:\n- It's a bite-size adventure that has all of the best elements of a Metroid game. It's designed to be able to be beaten in a little over an hour, which encourages multiplie playthroughs and speed running.\n- There's a good sense of progression, you really feel like an unstoppable force by the end of a run, yet the final boss remains challenging.\n- No mindless wandering. I know this wont be a plus for everyone, but I don't like feeling entierly at a loss on what to do next, this game always has a few leads to follow if you're unsure. It never spells it out for you, but you always have an idea on where to go next.\n- It follows the beam-stacking formula, which means your default weapon will always be fun to upgrade and worth using.\n- There are some really nice musical pieces in here.\n\nMixed Impressions:\n- Bosses are a bit too easy sometimes. I'm grateful for this sometimes, but other times I'm unsure. Maybe the late game bosses could be a little harder. The final boss seems just right though.\n- The minimap lets your know if there's a powerup in the room somewhere. This isn't a big deal, and encourages speedier play, but I wouldn't mind if there were additional powerups that weren't revealed on the map as well as the ones that are. (Unless there are, then whoa...)\n- The downward shot while jumping looks hillarious. \n- No wall jump. I can see how this would break a procedurally generated game though.\n\nCons:\n- This is just an early game gripe, but my first few play throughs saw too many of the same powerups.\n- Each run (so far.) has contained the same areas in the same locational placement. \n\n\nI'm always happy to see fellow Unity developers have success. This game is totally worth the money.", "timestamp_created": 1505166638, "timestamp_updated": 1505171793, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.634762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34889429": {"recommendationid": "34889429", "author": {"steamid": "76561197972257745", "num_games_owned": 610, "num_reviews": 9, "playtime_forever": 589, "playtime_last_two_weeks": 0, "last_played": 1506709808}, "language": "english", "review": "One of the best Metroidvanias I have played in a while and for this cheap too. Highly recommend it if you like the genre", "timestamp_created": 1505160327, "timestamp_updated": 1505160327, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34888190": {"recommendationid": "34888190", "author": {"steamid": "76561198020059262", "num_games_owned": 566, "num_reviews": 1, "playtime_forever": 1193, "playtime_last_two_weeks": 0, "last_played": 1510960577}, "language": "english", "review": "A wonderful love-letter to classics like Super Metroid and Zero Mission, if you enjoy side-scrolling metroidvanias with a lite dash of roguelike then you owe it to yourself to give A Robot Named Fight a shot.", "timestamp_created": 1505155311, "timestamp_updated": 1505155311, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.518072", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34877210": {"recommendationid": "34877210", "author": {"steamid": "76561197970840363", "num_games_owned": 491, "num_reviews": 2, "playtime_forever": 1407, "playtime_last_two_weeks": 0, "last_played": 1508019850}, "language": "swedish", "review": "its good", "timestamp_created": 1505108166, "timestamp_updated": 1505108166, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34877040": {"recommendationid": "34877040", "author": {"steamid": "76561198306255244", "num_games_owned": 27, "num_reviews": 1, "playtime_forever": 436, "playtime_last_two_weeks": 0, "last_played": 1511237392}, "language": "english", "review": "Great game! Got it cause it looked cool and I needed to burn some cash. If you like The Binding Of Isaac and the metroid series you would like this game.", "timestamp_created": 1505107055, "timestamp_updated": 1505107071, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34876263": {"recommendationid": "34876263", "author": {"steamid": "76561198003132276", "num_games_owned": 356, "num_reviews": 3, "playtime_forever": 403, "playtime_last_two_weeks": 0, "last_played": 1505881513}, "language": "english", "review": "If Lovecraft worked on Metroid, this would be that game.", "timestamp_created": 1505102378, "timestamp_updated": 1505102378, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34872572": {"recommendationid": "34872572", "author": {"steamid": "76561198010986221", "num_games_owned": 249, "num_reviews": 3, "playtime_forever": 310, "playtime_last_two_weeks": 0, "last_played": 1512726234}, "language": "english", "review": "It's Super Metroid if Super Metroid was also The Binding of Isaac.\n\nEach playthrough is wildly different and may force you to adapt your style of play accordingly based on what equipment you find, environments you enter, and monsters you encounter. Trial and error are part of the game as you learn the nature of enemies, bosses, and traps. Dying is part of the game as new items and mechanics are unlocked through your progress, making the next attempt possibly more managable. The art and music direction are pretty good compared to other games that try too hard to emulate faux-retro styles and miss the mark. \n\nIt even features couch co-op, although I'd personally have liked something for online play too.\n\nFor its value and replayability, It's definitely worth it. I hope future updates expand its lifespan.", "timestamp_created": 1505083090, "timestamp_updated": 1505083090, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34872361": {"recommendationid": "34872361", "author": {"steamid": "76561198202570808", "num_games_owned": 282, "num_reviews": 1, "playtime_forever": 768, "playtime_last_two_weeks": 0, "last_played": 1512664886}, "language": "english", "review": "I beat this game in about 3 or 4 runs myself, and I gotta say I absolutely adore it.\n\nIt IS a straight rip of Super Metroid, and theres nothing wrong with that. Lord knows this game has done more for the Metroid series in about 2.5 hours of my life than Nintendo has in the past what, 4 years?\n\nPROS:\n- Unlocking items for future playthroughs is always a nice time, making your next runs feel that much more fresh.\n- Secrets aren't too hard to hunt down, which for this style of game IS a good thing.\n- Bosses are varied between playthroughs so its neat when you fight one you haven't before.\n- The game controls and feels just like Super Metroid.\n- While its true that coming across the same rooms is kind of yawn inducing, its nice that the larger rooms have varied doorways between runs.\n- Poor, poor Tutorial Smith. We knew him long enough.\n- Save Rooms as extra lives was brilliant.\n\nCONS:\n- The music just.. isn't that good. Its not BAD by any means, but I often found it really easy to just ignore and never really felt like it was adding to the experience.\n- Its... shorter than I'd like. My first successful run was about 2 hours long and after I beat the boss I just sat there wondering if there was gonna be anymore. Then the credits rolled.\n- The Final Boss fight could have been better. Its a nice bullet hell (sort of) but when you show up completely decked out you can kinda just blast all the pesky mobs and bullets.\n- Normally I like my games Charge-Attacks to charge off the first press, but in this case I found it more frustrating that my attack-speed gets nerfed slightly by having a charge weapon because it always tries to charge shots when I wanna just tap-tap-tap the fire button quickly. (This might be modifiable in the options, so if it is disregard this and call me an idiot)\n\nThings that could be done to improve the experience (aka Things that my greedy white ass demands of the dev) :\n- Make it so that you can visit the Final Boss at any point, this will promote Speed Runs and No-Powerup Runs. And give the Final Boss door a clear warning so that people know to avoid it if they want to.\n- Unlockable areas to flesh-out (heh) future playthroughs, Isaac did it first yeah but that doesn't mean its a bad mechanic for other Roguelikes.\n\nThats all I've really got right now. Thanks to the creator for making this game, it was well worth the money spent and felt really fresh and satisfied an itch I've been having for some time.", "timestamp_created": 1505081939, "timestamp_updated": 1505081939, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.672504", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34870233": {"recommendationid": "34870233", "author": {"steamid": "76561198044781774", "num_games_owned": 562, "num_reviews": 23, "playtime_forever": 1294, "playtime_last_two_weeks": 0, "last_played": 1512858968}, "language": "english", "review": "This game is a real procedurally generated metroid like game in that it requires that you have platforming and weapon keys to access new areas, and has areas that you can backtrack to to gain new items and upgrades that aren't necessary. I like it a lot. In fact I was giddy when I first started playing it because it blew my expectations out of the water. I've beaten the game twice now, and from what I understand after you've beaten it a few times, the game gets harder, which is good.\n\nPros:\n[list]\n[*]Real metroidy map design and gameplay loop\n[*]Different upgrades spawn that help you get through the same obstacle. For example, to reach a high ledge some games will give you a double jump, some games will give you a jetpack, ect.\n[*]More items unlock when you complete certain achievements.\n[*]The character movement feels almost exactly like super metroid, which is admittedly kind of sluggish. This is a pro for nostalgia, and a con for feeling sluggish, ha.\n[*]Lots of bosses and lots of content. Each run has you fight 5 bosses including the main boss, but there is a lot more bosses than that in the pool that can be drawn from.\n[*]Local coop is as good as it can be for a metroid like game. The second player controls a floating orb and basically plays like a twin stick shooter. Having the second player makes the game a lot easier, but that's okay.\n[*]Interesting art, and unique locations to explore.\n[/list]\n\nCons:\n[list]\n[*]The opening sequence is poorly voice acted. I wish that there wasn't a voice actor and that it was just text.\n[*]There's a piece of graffiti in one of the areas that says \"f***\". Everything else in the game is probably rated E10+, and that automatically makes it so you can't play with your kids anymore for absolutely no benefit. Kind of ridiculous.\n[*]The video options are pretty limited.\n[*]Finding the upgrades secretly hidden in the walls is kind of a chore. There is no graphical indication (that I saw) where the upgrade is, so you just have to shoot like a crazy person all over the room until you break the wall chunk that has the upgrade in it.\n[*]Sometimes enemies are a little hard to see against the environment.\n[/list]", "timestamp_created": 1505074136, "timestamp_updated": 1505074221, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34869750": {"recommendationid": "34869750", "author": {"steamid": "76561198096607404", "num_games_owned": 45, "num_reviews": 2, "playtime_forever": 2173, "playtime_last_two_weeks": 0, "last_played": 1506864631}, "language": "english", "review": "If you liked Binding of Isaac and Super Metroid, then you will LOVE this game. I've blown the better part of my weekend on this game and just can't get enough. There are plenty of other reviews to cover all the pros and cons (99% of which I agree with), but what I will say is that I hope there's an upgrade in the future to make the game a little bigger and add some stuff that isn't blatantly ripped from Metroid. But all in all, it's a lot of fun. The controls are pretty tight and I haven't died without totally feeling like I deserved it.", "timestamp_created": 1505072465, "timestamp_updated": 1505072465, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.528476", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34862896": {"recommendationid": "34862896", "author": {"steamid": "76561198080263894", "num_games_owned": 165, "num_reviews": 56, "playtime_forever": 1705, "playtime_last_two_weeks": 1, "last_played": 1513831283}, "language": "english", "review": "Amzing this game can be one of the best games of all time if the devs put in the work its for sure metriod like but done right just needs a bit of work on the maps (there still great tho)", "timestamp_created": 1505052680, "timestamp_updated": 1505052680, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34859259": {"recommendationid": "34859259", "author": {"steamid": "76561198295702903", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1505041498}, "language": "english", "review": "If you like not being able to save your game and die having to start all over after minutes of gameplay, then this the game for you ! A metroidvania style game with Dark souls all over it and randomized rooms with randomized power ups everytime you die and resrtart. We don't need another game like this, Sundered was bad enough.  NO SAVE ROOMS?!! at all...", "timestamp_created": 1505041939, "timestamp_updated": 1505041939, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.207593", "comment_count": "13", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34856303": {"recommendationid": "34856303", "author": {"steamid": "76561198012842369", "num_games_owned": 218, "num_reviews": 3, "playtime_forever": 556, "playtime_last_two_weeks": 0, "last_played": 1505552612}, "language": "english", "review": "As my first review, I would say this game is incredibly good and a fun time but will sadly be overlooked.  For 10 dollars this is a steal and well deserving of more publicity.", "timestamp_created": 1505031892, "timestamp_updated": 1505031892, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.520647", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34856245": {"recommendationid": "34856245", "author": {"steamid": "76561198018485266", "num_games_owned": 579, "num_reviews": 151, "playtime_forever": 575, "playtime_last_two_weeks": 0, "last_played": 1505149759}, "language": "schinese", "review": "8月份的时候，原本计划要推荐一款名为《Sundered》的Metroidvania类游戏。然而尴尬的是，在实际体验过后，虽然游戏的美工和操作手感均数上乘，但纯粹以游戏性来说我仍然无法给予正面评价。\n\n将平台动作游戏最重心的关卡设计交给程序随机生成后，这个游戏甚至可以列在最糟糕的“银河城游戏”范例。它的意义可能正好证明了：现下的程序算法仍不足以替代由制造者亲自设计的关卡。\n\n所以你知道在时隔一个月后，再次看到另一个标榜着所谓随机生成的Metroidvania时，我对自己仍然坚持试毒的举动有多么坎坷。\n\n还好，这个游戏的开发者脸皮比较厚。\n\n我不会说《A Robot Named Fight》（简称ARNF）是致敬《银河战士》，我当然也不可能认为制造者抄袭了它，因为这个游戏直接就照着模板将后者抠了下来。\n\n这个游戏的人物动作、主体的成长系统、操作手感和关卡风格、乃至主角左右身位的绘图都与2D时代（主要以超银为主）的《银河战士》有90%以上的相似度。从这一点上，它几乎省下了任何一位稍微接触过《银河战士》的玩家去适应的过程，开发者即使连前空翻的惯性都照着原版抠了过来。\n\n我是不太了解任天堂对于“借鉴”的容忍底限，但如果它比较敏感苛刻的话，这个游戏的处境其实还蛮不妙的。当然，这些问题对于我来只是身外事，如果版权方没意见当然是最好的啦（？？？）。\n\n从某种程度上来说，与其说ARNF是一款力图还原银河战士的游戏，不如说它是个试验性的同人作品。\n\n这个游戏所采用的随机生成算法本身比较稳固 —— 在预先做好的内容库里，挑出固定数量的“地图块”、每一局的物品、敌人三种元素组成整个流程。它的每一局流程长度、敌人与升级物品的数量基本完全一样，平均每局在一个小时左右便能通关。\n\n比较好的情况是，相比强调属性数据的《Sundered》，ARNF仍然是一款以动作元素为主的游戏。所以在游戏过程中，就不需要采用敌人随机掉落物品的系统，而是更传统的关卡内探索获取。\n\n另一个防止随机生成毁灭游戏体验的做法是，系统生成的关卡仍然按照固定的流程进行安排。都市、洞穴、工厂和废墟的推进是固定的，整个地图也必定是绕一个圈走。而拼凑起整个地图的“房间”，事实上都是预先做好后打碎，然后用比较合理的算法再拼接起一个区域。\n\n这种做法就令流程避免了毫无目地性，而关卡设计混乱且敷衍的情况发生。每一个房间的设计水平都保持在一定水准（毕竟多数都照搬了银河战士的设计），敌人配置、平台跳跃等等都是预先由开发者亲自完成后再由程序安排的。\n\n作为本身应该内容十分饱满，以长时间游玩探索的魅力吸引玩家的Metroidvania类游戏来说，本作的立意相当古怪。“快节奏、街机风格的银河战士”，在体验过本作之前只会被我当成笑话。然而实际通关了两局后，我觉得如果正统的银河战士，乃至Metroidvania类游戏都能加入一个类似本作一样的附加模式应该会非常有趣。\n\n将原本流程中的关卡打乱、缩短后可以让人更方便地体验游戏的动作系统，获得非常不错的爽快体验。\n\n由于流程短，所以剧情介绍基本都在开头的结尾才会出现 —— 机械之神升仙后，留下了一群无所事事的后代留在赛博坦星。XXXX年，某个最近在中国人气暴涨的精神污染神话的没脑子神突然降临，拉了一堆不可名状的东西下来。作为机器人士兵中的一员（男性版萨姆斯，我们就叫它阿萨姆吧），阿萨姆义不容辞地加入到了殴打眷族的行列中。\n\n游戏的流程实际上就是“去地下逛一圈，升级然后回来暴打阿撒托斯”，重点就在于尽量获取流程中的强化以应对最后决战。敌人都是些触手和被触手寄生的东西，中BOSS会随机从20种预设好的种类里挑出4位阻扰玩家。\n\nARNF的道具数量不少，，因为每局固定出现物品有限，所以你每一次都不可能体验所有升级。除了属性成长的物品外，技能与武器类的物品几乎每一种都有两个备案。部分“解谜物品”并非固定只有一种类型 —— 比如滑铲和蜘蛛变形的主要作用都是钻过矮洞，但在实际运用时策略就有所区别。同样的例子还有不少，比如可以用于击打墙壁内开关的副武器：激光与火焰喷射都是如此。\n\n不过无论当前游戏随机出现什么物品，只要100%收集后必定能躺赢最终BOSS，让追求难度的玩家稍微有点不满足吧。\n\n如果说ARNF有什么自我特色的创意，那么很可惜我看不到。这游戏相当厚脸皮地照搬了前辈的大量优秀元素，从严肃的角度来说“抄袭”都有点抬举它了。而随机生成预设内容的设计虽然体验不错，但将这些优秀内容用在过短的流程后，着实有种浪费的感觉（大概是绝对反正不是自己想出来的？）。\n\n但至少在前几个小时、或者说前3次通关的过程中，ARNF还是给了我相当不错且新奇的体验的。没有存档点，没有剧情对话，只为了享受Metroidvania独特的动作乐趣。在每局一个小时的流程中，它让我看到了Metroidvania类游戏的另一种增加耐玩度的可能性。", "timestamp_created": 1505031710, "timestamp_updated": 1505031710, "voted_up": true, "votes_up": 45, "votes_funny": 1, "weighted_vote_score": "0.834797", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34852085": {"recommendationid": "34852085", "author": {"steamid": "76561198008931222", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 103, "playtime_last_two_weeks": 0, "last_played": 1505013366}, "language": "english", "review": "Great game!  A lot of fun to play.  Friend recommended it to me and can't say he was wrong, I do like it.", "timestamp_created": 1505013527, "timestamp_updated": 1505013527, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34848985": {"recommendationid": "34848985", "author": {"steamid": "76561198013784317", "num_games_owned": 95, "num_reviews": 8, "playtime_forever": 2849, "playtime_last_two_weeks": 0, "last_played": 1511573277}, "language": "english", "review": "I've only played the game for about 5 hours but can tell this is going to be a game I come back to. This year has been amazing for \"homage\" games with 20XX taking inspiration from MegaMan X and now A Robot Named Fight! from metroid (a series in dire need of SOMETHING) \n\nYou play as a Robot attempting to rid the world of fleshy beasts and if your robot dies, another Robot takes its place (not a huge deal, but it helps me personally be okay with the lore aspect of the revive lol)\n\nThere are hidden powerups throughout the map and there are indicators on the map telling you that there's a powerup in the room...this is a pro and a con. I can see people being a little MEH about KNOWING there's a powerup in the room because then there's no \"discovery\" but you still have to search for the powerup. Maybe in the future there can be an option to turn off the indicators?\n\nThe gameplay is great, it feels like you're in a Metroid game. The weapons and powerup you get change so much about the game. You can only access certain areas with certain powerups and sometimes you flat out don't even see those powerups and will have to abandon that room. \n\nBasically - if you're a fan of metroid and \"roguelike\" permadeath games with random powerups you should buy this game. It's fantastic, It's so much fun. I've only been to the 3rd \"area\" and I've probably seen 6 bosses. \n\nALSO THE MUSIC IS OMGGGGGGGG!!!!", "timestamp_created": 1504999364, "timestamp_updated": 1504999364, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.535616", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34848392": {"recommendationid": "34848392", "author": {"steamid": "76561198042368636", "num_games_owned": 63, "num_reviews": 3, "playtime_forever": 1888, "playtime_last_two_weeks": 0, "last_played": 1512586168}, "language": "english", "review": "Pretty interesting game that mixes the best of the Metroidvania genre with Rogue-like elemets.\n\nThe game controls exactly like a Metroid game with backtracking, \"hidden\" power ups and upgradable gear as you play.\n\nPros:\n- Graphics and presentation are great.\n- Backtracking that doesn't feel annoying.\n- Great power up diversity.\n- Very good controls, exactly like Metroid.\n- Overall the gameplay experience is very good.\n\nCons:\n- Although it's supposed to be a Rogue-like game, it's pretty short, my 100% run took around 2 hours and later playthroughs become much shorter and less interesting (until certain milestones).\n- The room variety suffers because of the randomly generation, once you see a room you know how it plays out.\n- The minimap shows you the hidden upgrade so it's pretty hard to miss anything in this game.\n- No lore basically, the only information you get is from the first/last cutscene. It would have been nice to find some lore items that you can collect.\n\nSo unless the game gets longer as you beat it there isn't much replayability, once you beat it that's it. I look forward to what the dev does next, I feel that if he ever decides to make another metroidvania without the rogue-like elements and with some storytelling elements he can make a game as good or even better than Axiom Verge.\n\nSo, should you buy this game?\nIf you are here because of the Metroidvania or Pixelated graphics tags then yes, it's a wonderful addition to your collection.\nIf you are interested in the Rogue-like element you may consider waiting for a discount/more content being added.\n\nEdit: After playing the game a couple of more hours there's some things that I want to point out:\n- The game becomes harder with each playthrough which is good since it makes the replayability better.\n- Enemy placement should be rechecked in future patch notes to avoid \"unfair\" damage, specially on later playthroughs.\n(SPOILERS)\n- A new area becomes available after beating the game a sixth time which adds a bit of lore. Still, I stand with my opinion that the story of the game needs to be expanded upon as collectibles.", "timestamp_created": 1504997120, "timestamp_updated": 1505753436, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34848257": {"recommendationid": "34848257", "author": {"steamid": "76561198009807533", "num_games_owned": 833, "num_reviews": 15, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1506217231}, "language": "english", "review": "Super fun Metroidvania style game that perfectly captures the feeling of playing Super Metroid, while still being distinct enough that you can't just classify it as a Metroid clone. It's a fun game without taking the random generation into account, and while you won't get as varied experiences as something like The Binding of Isaac, it really adds a bit of icing to the cake of this wonderful game. Don't buy it because you want a randomly-generated Super Metroid experience, buy it because you want a solid Super Metroid experience that just happens to have some random elements thrown in.\n\nFor reference: I purchased this more or less on a whim after seeing a video about it on YouTube, and I am more than happy with my purchase.", "timestamp_created": 1504996575, "timestamp_updated": 1504996575, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501969", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34847579": {"recommendationid": "34847579", "author": {"steamid": "76561197971988082", "num_games_owned": 207, "num_reviews": 5, "playtime_forever": 2957, "playtime_last_two_weeks": 0, "last_played": 1512013511}, "language": "english", "review": "Just finished my first successful playthough, and gotta say I'm loving this game.  No idea how the guys behind this pulled it off but this is the first time I've seen a randomized world play out like a proper Metroid game will backtracking and everything.  The upgrades and alternate weapons are all fun, the controls are solid and the gameplay mechanics are easy to follow.  I've yet to have a death that felt unfair, just me making poor moves.  Definitely recommend this to anyone that wants a true Metroid roguelike.", "timestamp_created": 1504994010, "timestamp_updated": 1504994010, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34847158": {"recommendationid": "34847158", "author": {"steamid": "76561198013189777", "num_games_owned": 105, "num_reviews": 4, "playtime_forever": 1036, "playtime_last_two_weeks": 0, "last_played": 1507014444}, "language": "english", "review": "Very good game. But i managed to kill the the final boss after 2.5 hour of gameplay. It was too short and to easy for my taste. I think an hard mode sould be added, a really difficult special zone unlocked with a harder final boss when you finish the game for the first time.", "timestamp_created": 1504992573, "timestamp_updated": 1504992573, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.488559", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34846703": {"recommendationid": "34846703", "author": {"steamid": "76561198126692446", "num_games_owned": 107, "num_reviews": 11, "playtime_forever": 149, "playtime_last_two_weeks": 50, "last_played": 1513715619}, "language": "english", "review": "One of my favorite roguelikes to play in my freetime.", "timestamp_created": 1504990992, "timestamp_updated": 1504990992, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34842612": {"recommendationid": "34842612", "author": {"steamid": "76561197964845598", "num_games_owned": 1424, "num_reviews": 70, "playtime_forever": 502, "playtime_last_two_weeks": 0, "last_played": 1505061361}, "language": "english", "review": "[url=http://gonewiththewin.com/review-a-robot-named-fight/]Please Click and Read the Full Review[/url]\n\n[b]PRO's[/b]\n- Procedural generation is both intuitive, and breaks up monotony\n- Multiple playthroughs evolve, becoming slightly more interesting each time\n- Instantly familiar to Metroid fans\n- Impressive effort for a one man dev team.\n- Saves point if you quit\n- Solid budget title\n\n[b]CONs[/b]\n- A little tooo Metroid\n- A lot to get through on just one playthrough\n- Animations and enemy designs a little goofy at times\n- Controls feel a tad on the sluggish side\n\nA solid budget metroidvania-roguelike from a single man dev team. ARNF! definetly plays and looks a lot like a Metroid repeat at times. What distinguishes itself from being a simple knock-off from the SNES classic is the procedural generation of its levels. It's intuitive and will keep you on a true and constant easter egg hunt. This difficulty and the time involved to beat through the games 60 levels may also appear daunting to some.\n\nHowever it's a budget title, and well made. Metroid and rogue-lite fans will definitely get hours of entertainment from this title. With a unique experience for each player and playthrough, that alone merits consideration. Games like ARNF! and Dead Cells may just require a new genre name, as metroidvania just doesn't quite describe the experience any longer. For more information please click our link above.", "timestamp_created": 1504978424, "timestamp_updated": 1504978424, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.487916", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34842283": {"recommendationid": "34842283", "author": {"steamid": "76561197961312181", "num_games_owned": 554, "num_reviews": 146, "playtime_forever": 1100, "playtime_last_two_weeks": 0, "last_played": 1511052151}, "language": "english", "review": "This is a shakey recommendation. \n\nIt is what it says on the tin: Roguelike Metroidvania.  It's sort of a hasty mashup of Metroid and Binding of Isaac, without the variation in the content that BoI offers.\n\nThis could turn into something a lot better, but the base nature of game is just too few randomized elements and too many reused ones.  It's done remarkably well for being procedural metroidvania, but the navigation is too predictable.  The game progression is not 100% predictable, but it is enough such that you don't really get much \"new\" from run to run.\n\nI'm giving my recommendation primarily because it's competent in most areas, even if it's not necessarily a great contender in what it wants to be.\n\nIt lacks the variation of content that would give it the staying power of something like BoI, and the difficulty lies more in making one mistake and getting punished for it repeadly, but there's definitely something here that could be refined and built upon.", "timestamp_created": 1504977431, "timestamp_updated": 1504977431, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34839594": {"recommendationid": "34839594", "author": {"steamid": "76561198090035210", "num_games_owned": 1160, "num_reviews": 89, "playtime_forever": 1834, "playtime_last_two_weeks": 0, "last_played": 1512498257}, "language": "japanese", "review": "===============================================\n2017.12.05\n私の提案が採用され、ランダムMAPのシード値による共有が可能に！\nデベロッパーに祝福あれ！\n[b][url=http://steamcommunity.com/app/603530/discussions/2/1473096694451090116]シード値による共有提案[/url][/b]\n\nシード値の共有もしておこう\n2BZI3J 14MZFD 95SB11 111111\n[b][url=http://steamcommunity.com/app/603530/discussions/0/1488866813768496913]シード値共有場[/url][/b]\n===============================================\n\n本作はメトロイドヴァニアと言うよりメトロイド＋ローグライトなパーマデス仕様のプラットフォーム型アクションである\nグラフィックは一見メトロイドと比べると見劣りはするもののゲーム内容については基本を抑えており文句ない仕上がりになっているので安心して欲しい\n操作性はSFCのスーパーメトロイドをプレイしたことがある方ならすんなり馴染めるだろう\n操作性だけでなくMAPのギミックやパワーアップなどもメトロイドのそれと類似していてニヤリとくる場面も豊富だ\n\nプレイ毎にMAP構造だけでなくパワーアップやボスまでランダムに変化するため、パーマデスという仕様が探索要素と精巧なる融合を果たしている\n4種類の素材を集めてMAPに点在するロボット達に出会う事ができれば様々な便利品のクラフトを行ってくれる\n\n隠しアイテムが豊富なので探索は飽きないが、面倒くさがりな人たちには隠しアイテムを見つけてくれるドローンも存在している\n尚、このドローン達はいくつか種類があり複数所持することができる\n\nメトロイドをこよなく愛する人達に強くお薦めしたい一品だ\n\n\n※ネタバレ含む\n本編自体は意外と短く、ボスはラスボス含め5体と長くても2時間のボリュームとなる\n腕に覚えのあるプレイヤーなら1時間も掛からないだろう\nそれまでに多くの犠牲を重ねることになるので実際にはより多くの時間が必要になると思われるが\n\nあるパワーアップを開放することでエリアのどこかにレブナントステーションが出現することがあり、ここで自己保存をすることで死んだ際に一度復元することが出来るようである\nこのステーションは運に恵まれれば複数箇所出現することがあるため非常に有利となる\n\nボス撃破又は特定エリアへの侵入により次回プレイから開放される数多くの新たなパワーアップが存在し、一度のプレイで全てが揃うことはなくクリアしてさえリプレイ性は保たれ、全てを遊び尽くすには相当の時間が必要となるだろう\n\nランダムMAPには少し懐疑心であったが、久しぶりに探索が楽しいゲームに出会えたと思う", "timestamp_created": 1504969850, "timestamp_updated": 1512479684, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.443529", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34838321": {"recommendationid": "34838321", "author": {"steamid": "76561198018827887", "num_games_owned": 66, "num_reviews": 1, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1505009097}, "language": "english", "review": "Much fight.  Very meaty.    \n\nNot typically my genre of games, but I can't put this down.", "timestamp_created": 1504966376, "timestamp_updated": 1504966376, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34837081": {"recommendationid": "34837081", "author": {"steamid": "76561197998410885", "num_games_owned": 413, "num_reviews": 3, "playtime_forever": 1337, "playtime_last_two_weeks": 592, "last_played": 1514369860}, "language": "english", "review": "I'm surprised by how well this game manages to meld Metroid's gameplay with roguelike elements, mainly by focusing a lot more on the former than the latter. You lose all your items and the map regenerates every time you win or die, but the map generation and item distribution masterfully replicates Metroid's progression elements without sacrificing variance between runs; one playthrough might let you open fire doors with an upgrade for your basic weapon, another might require you to find a flamethrower subweapon instead. Exploration also comes into play with various hidden items and optional side-routes scattered around the map, and their placement even encourages backtracking to old areas to find new secrets with acquired abilities. It does lack the sprawling, hand-crafted maps and lengthy individual playthroughs of its peers (Axiom Verge comes to mind,) but the elements it takes from its inspirations are executed well enough for me to recommend it, especially for its price.", "timestamp_created": 1504962660, "timestamp_updated": 1504962696, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34832980": {"recommendationid": "34832980", "author": {"steamid": "76561198029061647", "num_games_owned": 389, "num_reviews": 27, "playtime_forever": 358, "playtime_last_two_weeks": 0, "last_played": 1505043201}, "language": "english", "review": "Pros:\n- Feels like a legitimate Metroidvania.\n- The Roguelike elements are done well.\n- The gameplay is very good.\n- Replayability is high.\n\nCons:\n- More modes and ways to play would be encouraged.\n\nOverall, glad I bought it. Would recommend to anyone who knows that they like this kind of game.", "timestamp_created": 1504949041, "timestamp_updated": 1504949041, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.511331", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34829412": {"recommendationid": "34829412", "author": {"steamid": "76561197993519302", "num_games_owned": 700, "num_reviews": 6, "playtime_forever": 772, "playtime_last_two_weeks": 0, "last_played": 1506999029}, "language": "english", "review": "So, just finished this for the first time, only took me. . . 3 or 4 runs I think. Fun game, one of my roommates wandered in during the final run for a bit and commented that the design was a straight rip of Metroid, but I happened to be in one of the early areas with lots of meat background that really do look like Metroid levels. Other areas are more varied.\n\nControls are nice and tight for the most part. Was able to hit jumps where I needed to, always good in platformer parts. Found the final boss pretty easy, maybe a little too easy. Not sure if it was just the combination of weapons I had or what. Will see.\n\nStory was interesting, but a little lacking. Not sure if there is more shown in later play-throughs, if not, probably won't keep playing.\n\nAll in all, fun game, reasonable length. Got at least 3.5 hours of solid entertainment from it, so more than the average movie, which is about what I'm looking for from a game in this price range.", "timestamp_created": 1504933943, "timestamp_updated": 1504933943, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.525018", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34828807": {"recommendationid": "34828807", "author": {"steamid": "76561198073193213", "num_games_owned": 278, "num_reviews": 4, "playtime_forever": 5696, "playtime_last_two_weeks": 222, "last_played": 1513888881}, "language": "english", "review": "Wonderful game, If anyone has doubts about it play til you beat the last boss twice. This is a rogue like after all and it gets alot more interesting past that :) Beyond that, If you like Super Metroid/Metroidvania's and happen to love The binding of Isaac. This is the game for you.", "timestamp_created": 1504930860, "timestamp_updated": 1504930860, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.556876", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34828516": {"recommendationid": "34828516", "author": {"steamid": "76561198062118386", "num_games_owned": 284, "num_reviews": 46, "playtime_forever": 674, "playtime_last_two_weeks": 0, "last_played": 1508484989}, "language": "english", "review": "This is what I've longed for ever since Super Metroid on SNES!\n\nToo bad all following attempts on Gamecube and Nintendo DS were a flop. Gameboy Advance sort of got the idea not to turn a side scroller in to a first person shooter or make it realistic. Somethings a classic is just that.", "timestamp_created": 1504929432, "timestamp_updated": 1504929432, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.446143", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34825155": {"recommendationid": "34825155", "author": {"steamid": "76561197972731422", "num_games_owned": 358, "num_reviews": 4, "playtime_forever": 1568, "playtime_last_two_weeks": 0, "last_played": 1512414265}, "language": "english", "review": "This is the metroidvania I never knew I needed!", "timestamp_created": 1504913098, "timestamp_updated": 1504913098, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34824125": {"recommendationid": "34824125", "author": {"steamid": "76561198049913852", "num_games_owned": 71, "num_reviews": 1, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1504916309}, "language": "english", "review": "Great game. 5/5 stars.", "timestamp_created": 1504908555, "timestamp_updated": 1504908555, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.478786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34823960": {"recommendationid": "34823960", "author": {"steamid": "76561198006276098", "num_games_owned": 326, "num_reviews": 30, "playtime_forever": 55, "playtime_last_two_weeks": 0, "last_played": 1504828487}, "language": "english", "review": "I've only played a brief run where I died a little over half-way through the game. So far I've really enjoyed the game which kind of makes me imagine what Metroid might have been like had it been given the Sega treatment. \n\nThe enemy and boss design is really cool which reminds me a bit of Alien Syndrome, Alien Storm, and Treasures own classic Alien Soldier! That's alot of Aliens I know but these disgusting sacks of flesh are pretty cool looking. \n\nThe music and the sound effects especially the sort of squishy noise you get from flamethrowing some lumps of meat is quite good and satisfying. It's brief but pretty sweet and makes me pleased that I bought it on a whim. \n\nYou seem to get a pretty large variety of weapons to choose and create along with upgrades to you normal shot like explosives.\n\nControl needs a tiny bit of work as I find the game is a little picky about aiming straight up using a 360 pad but no regrets.", "timestamp_created": 1504907916, "timestamp_updated": 1504907916, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.474982", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34823152": {"recommendationid": "34823152", "author": {"steamid": "76561198032808571", "num_games_owned": 262, "num_reviews": 11, "playtime_forever": 34, "playtime_last_two_weeks": 0, "last_played": 1505420372}, "language": "russian", "review": "Игра конечно хорошая, взята с игры Super Metroid с super nintendo. Вот что я хочу вам посоветовать: Сделать эффект как на телевизоре меняя его от 50% до 100% и вы вернёте этой игре полное ретро!!!", "timestamp_created": 1504904766, "timestamp_updated": 1504904766, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.458015", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34819324": {"recommendationid": "34819324", "author": {"steamid": "76561198023766848", "num_games_owned": 105, "num_reviews": 5, "playtime_forever": 18, "playtime_last_two_weeks": 0, "last_played": 1504890228}, "language": "english", "review": "Friend bought it for me he is some kind of robot pushing megabeast.\n\nIf you like metroid and roguelikes then this is the perfect game for you.  I wish I had a game pad!\n\n5 blaster cannons out of 5.  Would fight the flesh apocalypse again.", "timestamp_created": 1504891970, "timestamp_updated": 1504891970, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34817852": {"recommendationid": "34817852", "author": {"steamid": "76561197969532890", "num_games_owned": 357, "num_reviews": 1, "playtime_forever": 987, "playtime_last_two_weeks": 0, "last_played": 1511626870}, "language": "english", "review": "A Robot Named Fight! truely is a Metroidvania roguelike/lite. The creator managed to find the right balance of sprawling exploration, backtracking to areas previously not accessable, unlockable powerups, and just plain, good fun. Excellent original soundtrack and great meaty sounds. \n\nDropping into the game the first time immediately reminded me of Super Metroid; especially the movement. Although sluggish at first (at least compared to my memory of Super Metroid), the movement feels better after your first speed powerup and overall makes sense with the concept of continued growth. By time you head to the final area, you feel light-years from your sluggish start. \n\nYou'll spend slightly over an hour to collect everything and get to the final area. I'm sure that time comes down the more you play (there is a 35 minute acheivement). While, I was initial surprised how quickly it took me, it does feel right. Replaying the game yields new bosses to fight and new powerups to enjoy. There are also varied room types each play through, such as fire rooms and dark rooms. Good surprises each run. \n\nFor me, the difficulty is somewhat easy with moments of panic as Fight hangs on with 1 bar of health. I think the difficulty could be bumped up or possibly offer a hard option to suit people's taste. Don't get me wrong, a wreckless person will be punished. \n\nA Robot Named Fight! is well worth the asking price, especially given the creator is actively incorporating feedback into the game. I only hope that more people get to experience the game so more Fight can be added! \n\nPick it up now!\n\nPS. Tutorial Smith... A+\n\nGlitch update adds some great new content to find... for free.", "timestamp_created": 1504887239, "timestamp_updated": 1511627305, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.574969", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34815667": {"recommendationid": "34815667", "author": {"steamid": "76561198131925475", "num_games_owned": 30, "num_reviews": 2, "playtime_forever": 3885, "playtime_last_two_weeks": 305, "last_played": 1513921299}, "language": "english", "review": "I hate that I never really got into the Metroid games growing up. I know enough to appreciate how special those games are, Super Metroid in particular. A Robot Named Fight feels so inspired and crafted as a love letter to games like that. For me personally, it feels like I'm finally in on the magic of Metroidvanias. I love the game. The gore and monsters are so satisfying to kill, and even though I've already beaten the game 30 times, I want to keep playing to get faster run times and interesting build combinations. The last game to draw me in like that was Binding of Isaac, if that tells you anything. Buy this game.", "timestamp_created": 1504880844, "timestamp_updated": 1504880844, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.446805", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34814912": {"recommendationid": "34814912", "author": {"steamid": "76561198032128945", "num_games_owned": 1279, "num_reviews": 20, "playtime_forever": 529, "playtime_last_two_weeks": 0, "last_played": 1504859154}, "language": "english", "review": "Retro meat battle?  Heck yeah!", "timestamp_created": 1504878527, "timestamp_updated": 1504878527, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.477552", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34812918": {"recommendationid": "34812918", "author": {"steamid": "76561198092324557", "num_games_owned": 857, "num_reviews": 49, "playtime_forever": 243, "playtime_last_two_weeks": 0, "last_played": 1505160278}, "language": "schinese", "review": "roguelike版银河战士，银河战士爱好者极力推荐", "timestamp_created": 1504871700, "timestamp_updated": 1504871700, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581994", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34811781": {"recommendationid": "34811781", "author": {"steamid": "76561198208382752", "num_games_owned": 196, "num_reviews": 3, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1504859125}, "language": "english", "review": "A true metrovania and roguelite mix and as far as I know, the only one in the market.", "timestamp_created": 1504867547, "timestamp_updated": 1504867547, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.472855", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34808627": {"recommendationid": "34808627", "author": {"steamid": "76561197973435505", "num_games_owned": 1071, "num_reviews": 1, "playtime_forever": 537, "playtime_last_two_weeks": 0, "last_played": 1505521009}, "language": "english", "review": "Do you like Super Metroid? Do you hate Roguelikes? If the answers are yes and no respectively, this game is for you. A Robot Named Fight hits all the right gameplay notes and perfectly captures the non-linear exploration of a classic 2D Metroid game while adding new power ups and remixing everything with the procedurally generated maps after each death. The graphic style has a distinct Super Metroid tribute vibe, though a little bit gorier and grotesque in its designs. \n\nMy only problems came from the rogue-like elements in the game, and I would warn away people who have problems with Rogue-like games. In my first few hours of playing I feel like I was thrust into a few bad combinations of map and item placement, and died several times in the early stages of the game while trying to rush through the early areas where I was still weak. There was a little bit of frustration at first, but eventually I found a run where things went well and the game started to shine. If you get frustrated with games that force you to start over from scratch and sometimes throw bad combos of items at you, this game might not be for you, but otherwise it is a lot of fun. \n\nMy first complete run took me roughly an hour and forty five minutes with 100% of items collected, and it seems like I have quite a ways to go before I find everything that A Robot Named Fight has to offer, and I look forward to playing more.\n\n(Edit/Addition: After posting the review I remembered I should note that I played the game on an older Mac system and it ran very well, and that I played using a Dualshock 4 controller, which also worked very well for the game.)\n\n(Disclaimer: A friend who has been following the development of this game gave me a code and asked me to review it on Steam.)", "timestamp_created": 1504849775, "timestamp_updated": 1504850114, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.480769", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34808524": {"recommendationid": "34808524", "author": {"steamid": "76561197982783901", "num_games_owned": 676, "num_reviews": 6, "playtime_forever": 1404, "playtime_last_two_weeks": 31, "last_played": 1513571763}, "language": "english", "review": "Just a great fun time, the random items on every run means the progression path is different everytime. So one run you might start out finding the missles, and another you'll start out finding a wave beam. The game has the right amount of difficulty, and respects your time. The music is rad, and the creature and boss designs are fantastic and gross! Probably my favorite metroid style game to come out this year!", "timestamp_created": 1504849099, "timestamp_updated": 1504849099, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.524577", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34808490": {"recommendationid": "34808490", "author": {"steamid": "76561198344546262", "num_games_owned": 61, "num_reviews": 6, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1512093325}, "language": "english", "review": "Controls get some getting used to but really fun game so far. If 20XX is a Rogue-lite Megaman X this is a Rouge-lite Super Metroid.", "timestamp_created": 1504848894, "timestamp_updated": 1504848894, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.496656", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34808355": {"recommendationid": "34808355", "author": {"steamid": "76561197960679506", "num_games_owned": 170, "num_reviews": 11, "playtime_forever": 93, "playtime_last_two_weeks": 0, "last_played": 1511579875}, "language": "english", "review": "Waiting for Nintendo's Metroid Remake? Fuck it, play this.", "timestamp_created": 1504848091, "timestamp_updated": 1504848091, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.442288", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34808227": {"recommendationid": "34808227", "author": {"steamid": "76561197960466087", "num_games_owned": 265, "num_reviews": 3, "playtime_forever": 215, "playtime_last_two_weeks": 0, "last_played": 1505307680}, "language": "english", "review": "This is an awesome buy.  Cost/fun factor is great.  Extremely satisfying controls that get better with each powerup.  The music and graphics are AMAZING.  Most people these days don't know what the metroidvania and roguelite genres mean, but if you do, you know what you're looking for and this game blends the two naturally.  And if you don't know, then strap on your arm cannon and get out the grill cause it's about to start raining meat!", "timestamp_created": 1504847283, "timestamp_updated": 1504847283, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.524577", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34807299": {"recommendationid": "34807299", "author": {"steamid": "76561198043649799", "num_games_owned": 125, "num_reviews": 2, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1504842233}, "language": "english", "review": "Seems like a pretty fun game. I like the graphic style a lot and the music is killer.", "timestamp_created": 1504842285, "timestamp_updated": 1504842285, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.477035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34807178": {"recommendationid": "34807178", "author": {"steamid": "76561198258398979", "num_games_owned": 5, "num_reviews": 1, "playtime_forever": 214, "playtime_last_two_weeks": 0, "last_played": 1504928611}, "language": "english", "review": "I don't want to get into arguing semantics and definitions about qualifications for terms like 'Metroidvania' and 'roguelite' et al. In my opinion, those discussions (while worthwhile in certain situations) can become a bit superfluous and alienating. When I play a game, the first question I want to answer is not, \"What genre is this game?\"\n\nI am primarily motivated to ask myself one thing: \"Is this game [b][i]fun[/i][/b]?\"\n\nAnd to put it simply, A Robot Named Fight is fun. Top to bottom, it's a very good experience. The graphical style and overall aesthetic are appealing. The map and room designs prevent exploration from bogging you down or becoming overwhelming. Despite a couple insignificant hiccups, the camera is responsive, has a tight window on the main character, and generally moves well without being bumpy or motion-sickness inducing (looking at you, Bubsy 1 and 2). Combat is satisfying, and player progression happens at a good pace (lots of neat powerups to unlock and use). Replayability is [i]very[/i] high, given the structure of the game itself in combination with the above reasons.\n\nI don't want to offer a review more complicated than it needs to be, so to summarize: there's a lot of good stuff in A Robot Named Fight. Given the content already in the game, plus the updates that will be delivered, it's a heck of a deal.\n\nYou should buy this game, because you will like it. If Ron Swanson were here, he'd call that a Ron Swanson Guarantee.", "timestamp_created": 1504841591, "timestamp_updated": 1504841591, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.524577", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34806922": {"recommendationid": "34806922", "author": {"steamid": "76561198132788762", "num_games_owned": 289, "num_reviews": 28, "playtime_forever": 187, "playtime_last_two_weeks": 0, "last_played": 1507810500}, "language": "schinese", "review": "简直就是程序生成版超级银河战士！\n\n虽然是个roguelite，但里面包含大量metroid式的探索元素和玩法！喜欢metroid的朋友值得一试！", "timestamp_created": 1504840098, "timestamp_updated": 1504840207, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543860", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34806605": {"recommendationid": "34806605", "author": {"steamid": "76561197992673878", "num_games_owned": 647, "num_reviews": 24, "playtime_forever": 1403, "playtime_last_two_weeks": 0, "last_played": 1512984331}, "language": "english", "review": "I'll be doing a more detailed review later, but for now, the quick and dirty.\n\nUsually when people say \"Roguelike Metroidvania\" it gets dismissed pretty quickly because it doesn't really have everything that makes up a Metroidvania. You may have a big open, explorable map, but you don't get upgrades to get to various parts of it. Or you may just have individual levels that can be explored, but then you go to the next one and never go back to the previous.\n\nThis game is neither of those. This is literally a Metroid Roguelike. Find upgrades to advance to new areas, and find stuff in old ones. And your upgrades change every run.\n\nAs someone who loves Metroid games, this is just amazing and fun as all heck. Get it already.", "timestamp_created": 1504838366, "timestamp_updated": 1504838366, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.649834", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34806207": {"recommendationid": "34806207", "author": {"steamid": "76561197962454022", "num_games_owned": 834, "num_reviews": 14, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1505180873}, "language": "english", "review": "What if Super Metroid were replayable over and over and over again, only different every time? And it had a way better soundtrack? \n\nBuy this and enjoy.", "timestamp_created": 1504835975, "timestamp_updated": 1504835975, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34806142": {"recommendationid": "34806142", "author": {"steamid": "76561197963892235", "num_games_owned": 230, "num_reviews": 1, "playtime_forever": 6348, "playtime_last_two_weeks": 22, "last_played": 1514007637}, "language": "english", "review": "I've got about five hours in now and am enjoying this game immensely. The learning curve is very balanced, I went from cussing at my computer on the first playthrough death to learning what not to do by the third. One final note I have is that it's also smoothly playable on a non-gaming laptop, so this is something I could play on the go as well. Great job, Matt!\n\nEDIT: With the new update to 1.1.0.0 (The Glitch Update), the game became even better, with all new content and a hidden area/boss.", "timestamp_created": 1504835605, "timestamp_updated": 1511414499, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34805344": {"recommendationid": "34805344", "author": {"steamid": "76561198015509470", "num_games_owned": 379, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 0, "last_played": 1504832318}, "language": "english", "review": "A Robot Name Fight has the best qualities of Metroid blended with hints of games from our childhoods.  The procedurally generated levels make for an infinitely-playable adventure through new worlds of familiar hallways and rooms.  It's a permadeath game which makes for some intense battles and adds a heart-wrenching difficulty but still remains playable and fun even to those of us whose Nintendo reflexes are far behind us.  \n\nI can't recommend this game enough and look forward to many playthroughs.", "timestamp_created": 1504831166, "timestamp_updated": 1504831166, "voted_up": true, "votes_up": 16, "votes_funny": 1, "weighted_vote_score": "0.508800", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34805053": {"recommendationid": "34805053", "author": {"steamid": "76561198019787842", "num_games_owned": 554, "num_reviews": 4, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1504829551}, "language": "english", "review": "You shoot at meat. 10/10", "timestamp_created": 1504829626, "timestamp_updated": 1504829626, "voted_up": true, "votes_up": 3, "votes_funny": 2, "weighted_vote_score": "0.496194", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34804771": {"recommendationid": "34804771", "author": {"steamid": "76561198112708844", "num_games_owned": 168, "num_reviews": 24, "playtime_forever": 142, "playtime_last_two_weeks": 12, "last_played": 1514340873}, "language": "english", "review": "If you love games like Super Metroid or Megaman X then you will love this game. I absolutely love the gameplay and physics, my only gripe is the sound effects. I think this game is awesome, good job", "timestamp_created": 1504828060, "timestamp_updated": 1504833642, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34804489": {"recommendationid": "34804489", "author": {"steamid": "76561198017610749", "num_games_owned": 131, "num_reviews": 6, "playtime_forever": 455, "playtime_last_two_weeks": 0, "last_played": 1507854599}, "language": "english", "review": "This is a good Metroidvania. It's cool how it was made to be rogelike too, I wonder how the creator programed it. It's pretty hard, I die all the time.\n\nThe controls are great.", "timestamp_created": 1504826620, "timestamp_updated": 1504826892, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34803804": {"recommendationid": "34803804", "author": {"steamid": "76561197961949916", "num_games_owned": 186, "num_reviews": 2, "playtime_forever": 319, "playtime_last_two_weeks": 0, "last_played": 1506263084}, "language": "english", "review": "I am a big fan of the roguelike genre, but this is my first time playing a metroidvania.  Highly recommend, it's exactly the kind of game you can pick up and play right away, but has a lot more depth then you can get out of one sitting.", "timestamp_created": 1504823490, "timestamp_updated": 1504823490, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.491147", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34803311": {"recommendationid": "34803311", "author": {"steamid": "76561197967981251", "num_games_owned": 401, "num_reviews": 84, "playtime_forever": 156, "playtime_last_two_weeks": 0, "last_played": 1511073810}, "language": "english", "review": "You know.. I wanna leave a positive review but I just can't for the game's cost/length.\n\nThere's a lot of good - the music and sound are pretty solid, the graphic style is decently solid. They've got a nice pixely art thing going, but obviously not a 'true' pixel art with the way assets and gibs move and flop around, but it's a minor nag.\n\nWhat gets me  though is I beat the game, first playthrough, no deaths, in an hour and fourteen minutes. The bigger problem is I didn't really feel compelled to do it again - the unlocks just seemed to be a few random powerups and a weapon or two, but none of that really changes up the game dynamic enough to be really worth further exploration. Metroidvanias work because they are sprawling and vast - this one had basically two areas, and that's it. Several powerups felt kinda pointless - the 'dash' is just a sluggish short-range dash with no purpose besides breaking a few blocks to arbitrarily block you, and many many assets are more 'copied' than 'inspired by' metroid. There's a fine line between homage and needless mimicry. The last boss was more of a pain in the finger from button mashing than difficulty, I knelt in one spot and just shot for a few minutes.\n\nThis is a game where I wish steam had a yes but bear in mind or a more neurtal rating, I hate having to give it a thumbs down, but I really just wouldn't recommend someone to buy it. It just doesn't quite work as it is. A true metroidvania relies on several things to really make it jive, and those things don't really jive well with some roguelike nuances.\n\nIt was kinda fun but horrifically short - if I hadn't left it on the title screen to get lunch I woulda beat it with 45 minutes to spare in the refund window, and that just doesn't cut it for me and a 'metroidvania' of any sort. The entire point is to spend hours and hours wandering  and exploring different areas, going back and forth, finding things, etc.\n\nSeveral things really threw off this game further - the item which lets you see powerups totally trivializes exploration and removes the need to keep an eye out, you immediately know every room with a powerup, period. SEveral powerups don't seem to work together - I got a 'shot fragments on collision' powerup, but my shots already passed through enemies and walls.. so it just did nothing? The shops have no explanation whatsoever for items until after you buy them, and resources to purchase seem random/scarce.. but ultimately not really needed anyways, apparently.\n\nThe game isn't bad, if it were just a couple bucks I'd let it slide for an hour and change, but as it is I just don't think it really works.\n\n", "timestamp_created": 1504821283, "timestamp_updated": 1504821283, "voted_up": false, "votes_up": 67, "votes_funny": 1, "weighted_vote_score": "0.661966", "comment_count": "19", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34803231": {"recommendationid": "34803231", "author": {"steamid": "76561198045040005", "num_games_owned": 183, "num_reviews": 14, "playtime_forever": 462, "playtime_last_two_weeks": 0, "last_played": 1512599665}, "language": "english", "review": "You know? It's pretty hard to find games that deserve to be called \"metroidvania\". I'm pretty glad to say that this one has everything that defines a true title of this genre. It's simple: do you like Super Metroid? Great. Do you like feeling rewarded for exploring areas of a map? Nice. Do you enjoy a challenging yet fair experience that changes everytime you die? This is your game. \nNow I know what you guys are thinking: a roguelike with procedural generated maps? Sounds dull. HELL FUCKING NO.  Trust me: every single time you start, the map layout arranges itself, and every single fucking time it's something that it isn't crazy nor it doesn't feel dull. Heck, you can even get shortcuts in order to reach other areas faster. And everything connects perfectly which is something that you'll never see in any other \"metroidvania roguelike\". This one EMBRACES those terms and manages to create an experience that makes you go \"I want to play again to see what I will find this time\". Coming from someone who played Super Metroid for more than 200 hours it's something.\nPros:\n+Great level design \n+Great soundtrack\n+Controls are just great\n+Exploration feels and IS rewarding\n+Random generated maps which connect areas in a very metroidesque way\nCons:\n-It ends. Wait, no, it never ends, because there are A BILLION DIFFERENT WAYS TO PLAY THIS GAME. \n\nScore: I'm gonna expend weeks playing this game non stop/ 10", "timestamp_created": 1504820930, "timestamp_updated": 1504820930, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.495579", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34802680": {"recommendationid": "34802680", "author": {"steamid": "76561198010185507", "num_games_owned": 1315, "num_reviews": 9, "playtime_forever": 211, "playtime_last_two_weeks": 0, "last_played": 1512941043}, "language": "english", "review": "First impressions review based on a single hour-long playthrough (I died before I even got access to the final area due to carelessness).\n\nThe game manages to recreate the feel of Super Metroid pretty well. Pacing is a bit faster; there's more combat and less peaceful exploration. The difficulty is just a bit harder than Super Metroid, which means it's still relatively easy if you're prudent. Secrets and other stuff are conveniently marked on the minimap from 1 tile away, so there's always a sense of progression in every way possible: exploration, incremental upgrades (damage, atk rate, max health, etc), and exploration upgrades (double jump, arachnomorph, etc.). \n\nCurrency can be acquired and used at various vendors throughout the map (for weapon upgrades, suit upgrades, shmup-type orbs, and other stuff), though there are no descriptions for any of the items before you buy them. \n\nMusic and sound effects are spot-on, though the music starts to get repetitive a bit too soon.\n\nOverall it's exactly what it says on the tin, and pretty much what I expected.", "timestamp_created": 1504818567, "timestamp_updated": 1504818626, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.500846", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34802659": {"recommendationid": "34802659", "author": {"steamid": "76561198125132771", "num_games_owned": 545, "num_reviews": 10, "playtime_forever": 492, "playtime_last_two_weeks": 0, "last_played": 1513101378}, "language": "english", "review": "Described by developer Matt Bitner as \"The Binding of Isaac meets Super Metroid\" was what instantly pulled me deep into this title. Not only does this game play and feel just like Super Metroid and have all the great ideals that game held true, but it has the uniqueness of it's roguelite gameplay loop to hold it firm in place. Not often are games so easily pinned against one another, but as far as I'm concerned this is a true roguelite metroidvania (as expressed in the email I recieved). Now for the fun bits:\n\nGameplay - When someone think of Super Metroid, they most likely think of the large map that folds in on itself via item-gated challenges. Well A Robot Named Fight does just this. Every run (we'll get to that in a bit) of the game has a clearly defined meta progression to follow in order to win. Items unlock new areas you couldn't access before and lead to more fun challenges and items. Now when someone mentions The Binding of Isaac, or roguelites in general, they think of persistent progression, permadeath, and a run based gameplay loop. Well...how does one do that in a closed off exploraion based platformer? Matt figured it out, and I have no idea how. This game is run based like it's contemporaries, however each run is in it's own metroidvania style map. Sounds crazy right? Well you have to play it to believe it!\n\nSound - The games OST instantly grappled me with it's opening menu theme. The sound is reminiscent of old school Genesis and SNES titles. Not only is the music fantastic, but the games sound design is spot on as well. Footsteps, shots, squishes of meaty baddies, and all other assorted metal clinkings are right there to pull you into the environment.\n\nVisuals - This is the most subjective area of the review, and thusly is something best looked at via videos or screenshots. I find the art style of the game to be one of it's highlights. The art style pays great hommage to Super Metroid and the older Castlevania's. While most modern metroidvania games try to go above and beyond, sometimes a good classic feel is what's really needed. The art fits the game and while some may find it moderately offputting, I find it to be a right fit.\n\nMatt Bitner really did create one of this years greatest surprises for sure. This game came out of nowhere and will most likely end up in many of my followers steam libraries after release. A respectable price point for one of the most enjoyable games I've played this year. A definite buy!\n\nPros:\n- Fantastic combination of roguelite and metroidvania design.\n- Old school Super Metroid visual design to match the feel of the game.\n- High replayability.\n- Great price point.\n\nCons:\n- Some areas/mobs can get a bit frustrating.\n- Not for those turned off by tons of searching and exploring.\n- Controls are very clunky if you aren't used to Super Metroid (but great for those who are!)\n- Music is great, but can get a bit repetetive while walking around.", "timestamp_created": 1504818497, "timestamp_updated": 1504818497, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.514893", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34801685": {"recommendationid": "34801685", "author": {"steamid": "76561198219656925", "num_games_owned": 94, "num_reviews": 7, "playtime_forever": 65, "playtime_last_two_weeks": 0, "last_played": 1504808344}, "language": "english", "review": "I'm only an hour in, and already it's an incredibly immersive experience.  \n\nNow, I've died several times in this game due to my own error, and despite Permadeath being an advertised feature, it doesn't feel punishing to be forced to start a new playthrough because the level design constantly changes for each playthrough.  \n\nThis is so genius because while it is fun to speedrun Metroidvania games, this game manages to capture that \"first time\" feel, every time.  And because each playthrough is supposed to take an hour to finish, it further makes permadeath just like any other death except with a new consequence.  But one that is more rewarding than simply restarting at a checkpoint to a familiar level layout.  \n\nTHAT is how you know this game has so much going for it.  From level design that works with the Protagonist Robot's moveset that feels similar to the universally praised Super Metroid, to power ups that make you feel all the more rewarded when an ability is added to your existing moveset like the cannon now having flame powers, or being able to phase through walls and hit enemies.  \n\nAnd because of its constantly changing design structure for each playthrough, it's even more fun knowing that the order you get these power ups will never be the same, keeping the player guessing and constantly surprised at every single turn.\n\nA Robot Named Fight would get my high recommendation, because I know I will keep coming back to play this and explore the myster of this devastated world.", "timestamp_created": 1504814639, "timestamp_updated": 1504814639, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.559348", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34801475": {"recommendationid": "34801475", "author": {"steamid": "76561197997754810", "num_games_owned": 403, "num_reviews": 26, "playtime_forever": 1813, "playtime_last_two_weeks": 0, "last_played": 1512775298}, "language": "english", "review": "https://youtu.be/P4L3prFV4LQ\n\nThis game is to Metroid what 20XX is to Megaman X. The only issues I had were due to my own crappy vision. It controls exactly as well as Super Metroid did and positively screams that game as THE influence.\n\nRating: I made a playlist for it. [b](THAT MEANS I'M GOING TO PLAY A LOT MORE OF IT!)[/b]", "timestamp_created": 1504813928, "timestamp_updated": 1504813928, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.483986", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34801173": {"recommendationid": "34801173", "author": {"steamid": "76561198074552049", "num_games_owned": 107, "num_reviews": 47, "playtime_forever": 1070, "playtime_last_two_weeks": 0, "last_played": 1512423147}, "language": "english", "review": "Metroid style exploration and gameplay mixed with a randomly generated huge world.\nMy greatest, wildest dreams, realised.\nWelp, time to lose all of my free time to this game.\nThanks!", "timestamp_created": 1504812961, "timestamp_updated": 1504812961, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.525170", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34800713": {"recommendationid": "34800713", "author": {"steamid": "76561198038445569", "num_games_owned": 13, "num_reviews": 5, "playtime_forever": 289, "playtime_last_two_weeks": 0, "last_played": 1504927882}, "language": "english", "review": "Got the game and I'm loving it.\n\nIts fast and the art is cool.\n\nBut how the hell do I save game? I keep dyig and restarting the game from the very beggining.", "timestamp_created": 1504811410, "timestamp_updated": 1504811410, "voted_up": true, "votes_up": 13, "votes_funny": 6, "weighted_vote_score": "0.492019", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34800205": {"recommendationid": "34800205", "author": {"steamid": "76561198067608206", "num_games_owned": 3033, "num_reviews": 124, "playtime_forever": 326, "playtime_last_two_weeks": 0, "last_played": 1512431311}, "language": "brazilian", "review": "http://steamcommunity.com/sharedfiles/filedetails/?id=1130115027\n\nA Robot Named Fight! é um roguelite metroidvania, com fortíssima influência de Super Metroid em seu design, mas contando também com elementos de Mega Man X e Contra em sua jogabilidade.\n\nA parte metroidvania faz com que o jogo seja focado em exploração, recompensada gradualmente com itens variados. Você precisará destrancar certas habilidades para poder passar de certos trechos das fases, e por vezes terá de retraçar seu caminho e buscar outro caminho liberado para continuar.\n\nJá a parte roguelite está presenta na geração procedural dos labirintos, que mudam a cada partida. A morte permanente é um risco constante, mas é bem mitigada pela facilidade de recuperar-se vida ao matar inimigos.\n\nA história é bem secundária, contada por uma introdução, e presente em elementos de narrativa espalhados à medida que você explora. Basicamente, você controlará um robô, numa cidade-robô infestada por formas de vida. Uma run inteira costuma levar cerca 1 hora.\n\nToda vez que você atinge uma nova área e mata um chefe pela primeira vez, ou completa uma run, irá liberar novos itens para futuras runs. Completar runs subsequentemente irá inclusive adicionar eventos à futuras runs, tornando o jogo mais difícil e mais complexo, portanto a rejogabilidade é enorme.\n\nOutro ponto de progressão permanente é pegar 100% dos itens de uma run, que irá adicionar uma chance de você começar uma nova run com um item de bônus, e pode ser repetido inúmeras vezes para adicionar mais e mais itens ao pool de início de fase.\n\nSeus visuais e sons são bem retrôs, extremamente inspirado no Super Nintendo em todo seu conteúdo.\n\nO jogo possui cooperação local assimétrica para 2 jogadores, com o segundo jogador controlando um drone voador que atira livremente em qualquer direção, e compartilha sua vida com o jogador principal.\n\nEnfim, recomendadíssimo para fans do Super Metroid ou da franquia em geral que aceitem ter uma experiência mais compacta, mas também é uma ótima pedida para fans de jogos de plataforma em geral e roguelites que queiram curtir a experiência de exploração e busca de itens.", "timestamp_created": 1504809886, "timestamp_updated": 1504970729, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.664588", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34799975": {"recommendationid": "34799975", "author": {"steamid": "76561198077203371", "num_games_owned": 487, "num_reviews": 4, "playtime_forever": 1062, "playtime_last_two_weeks": 0, "last_played": 1510767598}, "language": "english", "review": "A Robot Named Fight! has great responsive controls, lots of upgrades and masses of meat waiting to turn you into a pile of scrap. Co-op is great as well if you want to Fight! with a friend.\n\nI strongly recommend this game to anyone who like the 2D metroids and/or The binding of Isaac.", "timestamp_created": 1504809089, "timestamp_updated": 1504809582, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.457937", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34799679": {"recommendationid": "34799679", "author": {"steamid": "76561197993473791", "num_games_owned": 612, "num_reviews": 51, "playtime_forever": 252, "playtime_last_two_weeks": 0, "last_played": 1504932444}, "language": "japanese", "review": "XBOX Oneコントローラーを使用。クリア済み。\n\n[u]メトロイドヴァニア系ローグライク2Dアクション。ローグライクな要素としてはその周で入手していたパワーアップやアップグレードアイテムを死亡時に全てロストし、最初からのプレイになる。なお、マップはプレイごとにある程度ランダム生成される。[/u]\n\n[h1]良い点[/h1]\n\n・ステータスパーは左から「ヘルス」と「特殊武器エネルギー」になっており、今作での操作はシンプルで撃つ、ジャンプ、しゃがむが初期に行える操作になっている。各種アップグレードを入手することによって、追加のアクションが可能になる。特殊武器は何かしら早い段階で入手することになる場合が多い。というのも特殊武器で攻撃した場合のみしか開かないゲートがあるからだ。特殊武器は共通のエネルギーを使用するので使い過ぎには注意。\n\n・各種実績を解除することで、次回でのプレイ以降に特殊武器等の新たなアップグレードが追加される。実績は新しいエリアへ到達することやボスを始めて倒す等だ。\n\n・入手できる能力の順番がランダム。マップがランダム生成なのでプレイごとに入手できる能力が変わる。これによって、ボス戦時に前回とは違った戦い方を強制される場合もあり、新鮮な気持ちでプレイできる。\n\n・ステータスパワーアップ系は「ヘルスの最大値上昇」、「エネルギーの最大値」、「移動速度上昇」、「攻撃力上昇」と「攻撃速度上昇」があり、アップグレードに関してはネタバレになるので伏せるが「スーパーメトロイド」をプレイしたことのある方ならニヤリとするものが多い。オーブという主人公の周囲を飛び回りサポートするメカもある。\n\n・今作にはスクラップの収集要素があり、これらを使用することでマップの情報や一部のアップグレードを店（商人の様なロボット）から購入できる。特に主人公をサポートするオプション（今作での名称はオーブだが）はどれも強力なので助かる。\n\n・各種特殊武器がどれも強力。入手できる順番はどれもランダムだが、使い勝手の良い物ばかりなのでハズレが無い。例えば、「ミサイル」は単発の攻撃力が高くボスで使いやすく、「火炎放射器」は持続ダメージを与えることができ、硬いザコ敵や当てにくい敵にダメージを当てやすい。初回プレイ時にハズレかと思った「アックス」も実際には凄く使い勝手が良かった。\n\n[h1]悪い点[/h1]\n\n・悪い点と言うほどではないが、初回起動時のみ、コントローラーを正しく認識しないバグが発生した。初回以降は特に問題はなかったので、同じ症状になった方はオープニング後にゲームを再起動してみてください。\n\n[h1]総評[/h1]\n\n良い点が他にも沢山あるのだが、挙げていくとキリがないのでこのぐらいに。\n\n探索自体も面白く、「スーパーメトロイド」の操作性まんまなので、好きだった方は買って損はしないように思う。値段自体がお手頃なので、気になった方は是非。\n\nプレイ動画をアップしているので、気になった方は[u][url=https://youtu.be/e-8wHRsSu3E]こちら[/url][/u]を参考までにどうぞ。", "timestamp_created": 1504808061, "timestamp_updated": 1509374622, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.620884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34799553": {"recommendationid": "34799553", "author": {"steamid": "76561197971884386", "num_games_owned": 892, "num_reviews": 18, "playtime_forever": 75, "playtime_last_two_weeks": 0, "last_played": 1506371717}, "language": "english", "review": "An actual, backtrackable, fully explorable, rogue-lite castleroid.  Controls scheme is very much like Super Metroid (shoulder buttons to aim up and down, can't move and crouch etc).\n\nHighly recommended if you want a bit of roguelite in your castleroid rather than the other way around.", "timestamp_created": 1504807591, "timestamp_updated": 1504807675, "voted_up": true, "votes_up": 29, "votes_funny": 2, "weighted_vote_score": "0.535066", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34799483": {"recommendationid": "34799483", "author": {"steamid": "76561197985012954", "num_games_owned": 438, "num_reviews": 2, "playtime_forever": 4134, "playtime_last_two_weeks": 198, "last_played": 1514012196}, "language": "english", "review": "There are a bunch of titles out there that throw around the words \"metroidvania”, “roguelike/lite”, and \"procedurally generated\" while trying to appeal to the people who grew up on SNES, TG-16 and Genesis classics with pixelized 8/16 bit graphics, but so few are able to pull them off and still manage to hold its own identity in the way A Robot Named Fight does.\n\nWhen first hearing about the game, I was skeptical in the way anyone should be when someone starts throwing around those aforementioned terms as buzz words; especially with how a lot of the Metroidvania style games out there seem to lean much heavier on the “vania” side of the fence. As a big lover of Super Metroid and the almost 16-bit action adventure exploration perfection it brought to the table all of those years ago being a bastion of non-linarity and mechanics driving gameplay, I have long awaited something that would scratch that itch in the same way.\n\nA Robot Named Fight is right now the closest you will get to a true procedurally generated Super Metroid. The way the game carefully gives out its powers, to the sense of progression it manages to build up on each and every run. This is a very skill based game, and despite what some would think of the floaty controls at first, there is always a way to get out of binds and save yourself. Each death that comes feels well deserved and helps you learn more about the game.\nThe roguelite aspects of this game actually help it shine rather than confuse as some would think with a different map and item progression with every death or victory. Every run never outstays its welcome with a nice hour to hour and a half run time (provided the game doesn’t kill you first), and if/when you die you don’t ever feel too much loss since another run is just a click away.\n\nI haven’t had this “just one more run” feeling since Binding of Issac won me over so many years ago. This game truly is the perfect melding of Issac + Super Metroid gameplay that I didn’t know could possibly work so well, and yet it does!\n\nThe pixel art in the game is superb and while it recalls into memory games such as Splatterhouse with its fun yet grotesque enemy designs and Metroid area inspirations, the game still manages to feel original. The music as well doesn’t disappoint with not only hitting such great atmospheric tones to set the lone exploration mood, but also blood pumping full out rock tracks to help you finish the fight, its a wonder that everything here was put together just by one guy alone. The quality shines through every entire bit of this meat filled project as well as the sheer love for the gaming classics of yesteryear that have helped inspire this work of genius to be made.\n\nWith the developer stating that much like Binding of Issac, he hopefully plans to add in a bunch of new content over time to the game which would keep me (and everyone else hopelessly already addicted to this ) coming back constantly to this title for many months/years to come! The price point is perfect and has already given me so much enjoyment in my short time already. Because of this, I wish this game the most possible success and implore anyone who happens to be intrigued at how a Super Metroid roguelite could/should be done to immediately pick this one up! \n\nP.S. Tutorial Smith shall live on forever in our hearts… poor guy, was only one day from Tutorial retirement too…", "timestamp_created": 1504807395, "timestamp_updated": 1504809163, "voted_up": true, "votes_up": 32, "votes_funny": 2, "weighted_vote_score": "0.635751", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "34798584": {"recommendationid": "34798584", "author": {"steamid": "76561197962122959", "num_games_owned": 323, "num_reviews": 3, "playtime_forever": 775, "playtime_last_two_weeks": 0, "last_played": 1512873713}, "language": "english", "review": "This is a cool game from a cool guy. I've known Matt Bitner for a few years and he's a hard working guy who has a good grasp on what makes good video games.\n\nIf you're a fan of Super Metroid and Roguelikes in general you will enjoy this game a lot. The sprite graphics fit the feel of the game, and the music is absolutely killer. The controls are not quite as tight as I would prefer, but you get used to it. The gameplay is really well thought out though. Each run you feel like you are progressing a little further and unlocking more goodies for your next run. It is very enjoyable learning about the different enemy types and how to approach them with your current weapon load out. I definitely recommend this game.", "timestamp_created": 1504804458, "timestamp_updated": 1504804458, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.477049", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34798379": {"recommendationid": "34798379", "author": {"steamid": "76561197963981669", "num_games_owned": 437, "num_reviews": 34, "playtime_forever": 704, "playtime_last_two_weeks": 0, "last_played": 1508552894}, "language": "english", "review": "As far as I'm aware, this is the first TRUE metroidvania roguelite hybrid that's been released.  Dead Cells is great, don't get me wrong, but it's not at all a metroidvania no matter how many people or how much the devs will claim it is.\n\nAll the metroidvania elements are here: gated progression, meaningful powerups with your weapons and movement, and bosses, fun exploration.  All the roguelite elements are here too: permadeath, randomly doled-out powerups that will change from run to run, unlocks based on your performance, procedurally generated maps.\n\nA Robot Named Fight (ARNF) draws a lot from Super Metroid and Megaman and ties it into a relatively small map with runs that can last a little over an hour.  Control-wise, it feels like the movement was heavily inspired by Super Metroid which might feel a tad floaty at first, but is tight and precise as you master it.  There's a lot of fun different item and weapon combinations that you'll experience over your different runs.  One run might have you with a super-powered automatic rocket launcher, another one might have you relying on your energy-powered secondary weapons like the bouncing sawblade to deal most of your damage.\n\nARNF is a trailblazer in the \"roguevania\" space and makes me excited that my two favorite subgenres were successfully combined.  There are still some sacrifices from each side that were required, such as the intricate world-building of a well-crafted metroidvania, but ARNF proves that the \"roguevania\" is real.  And fun.  And now that it exists, I'm hoping that it inspires many other game developers to try their hand at making one.\n\ntldr: It's great.\n\nIf you're interested in an in-depth analysis on the concept of a \"roguevania\" with direct comparisons between A Robot Named Fight and Dead Cells, check out my video: https://www.youtube.com/watch?v=LpceV7GD6fg", "timestamp_created": 1504803716, "timestamp_updated": 1504803870, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.476325", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "34798148": {"recommendationid": "34798148", "author": {"steamid": "76561198023893421", "num_games_owned": 1296, "num_reviews": 41, "playtime_forever": 415, "playtime_last_two_weeks": 0, "last_played": 1505064970}, "language": "english", "review": "Video showing off start and endgame: https://www.youtube.com/watch?v=z92rmBATH2w\n\nA Robot Named Fight is a Rogue-Like that captures the essence of Super Metroid. You start out as a weak robot fighting a bunch of meat beasts; but as you traverse the map and gain more powers, you become a full on fighting force.\n\nThe controls and feel of the game is very Super Metroid, it is one of the developer's favorite games and they nail it. Each run is one big map that has connections to different areas and ability gated sections like a Metroid game. You're fighting your way around the map looking for abilities to get passed the gated areas as you search for the final ability which will allow you to reach the final boss. Which is a pretty epic fight.\n\nThere are other bosses you have to take on as you travel across the map, each looking quite horrific while being an interesting fight.\n\nThe variety of enemies and weapons keep the game interesting for many hours of play.  Complete runs for me have taken around an hour.\n\nAnother great feature is \"pick up and play\", you can leave the game and come back later and it'll be where you left off. More Rogue-Likes need to do this.\n\nThe visuals are good, especially if you're into body horror. The music is good as well; my favorite is the opening song.\n\nThe game is also priced pretty well. You can have 10s to 100s of hours with this game and it's only $10. Pretty good.\n\nI like it and I recommend it.\n", "timestamp_created": 1504802997, "timestamp_updated": 1504802997, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.398203", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}}}
