{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 151, "total_negative": 12, "total_reviews": 163}, "reviews": {"38609802": {"recommendationid": "38609802", "author": {"steamid": "76561197997293808", "num_games_owned": 179, "num_reviews": 2, "playtime_forever": 601, "playtime_last_two_weeks": 522, "last_played": 1514105356}, "language": "english", "review": "Look beyond the graphics - which vary between weak and exactly perfect for the job.\nFight uneasy, creeping monsters which get under your skin.\nFeel the tension of impending doom and the deep satisfaction of success.\nEngage with clever, unique mechanics and a puzzle logic I have to greatly applaud.\n\nIt's more Lovecraftian than any other game I can think of, and does it with minimalist style. It's remarkable.", "timestamp_created": 1514098059, "timestamp_updated": 1514098059, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38136367": {"recommendationid": "38136367", "author": {"steamid": "76561198171062938", "num_games_owned": 52, "num_reviews": 3, "playtime_forever": 884, "playtime_last_two_weeks": 452, "last_played": 1514147525}, "language": "english", "review": "One of the few games in recent years that's managed to genuinely scare me, the unknowable and oppressive nature of the creatures give me a sense of dread throughout every play-through.  Even the clunky combat system people often criticise helps to sell this feeling of helplessness, the lack of sophistication makes it a lot harder to win when facing multiple monsters, and thus makes me dread running into them all the more. I don't know if this is by design, but it works anyway.\n\nThe graphics are the one thing I'd say I outright dislike. I appreciate giving them a somewhat rough feel to add to the mood, but there were far better ways to do it than what we ended up with, as many have pointed out, it very much looks like a Newgrounds flash game from the early 2000s. I wish Yahtzee had hired an artist to handle the graphics, I know he's handled them for his previous games (which I also enjoy), but they aren't up to the standard I'd expect from a £6.99 Steam purchase. They didn't bother me too much all things considered, but they seem to have turned a lot of people off, and it's a shame that many haven't experienced this game because of them. \n\nOn the positive side, I really felt like a detective when putting clues together for my tablet, it's a small thing, but the fact that the game allows you to work things out and alter it yourself based on the clues you receive helps in making you feel like you're really deducing  things instead of being spoon-fed (I imagine a mainstream game would've automatically filled it in as you found things.) While I definitely see fault in the combat and presentation, this core game-play mechanic was incredibly satisfying, I'd whoop with joy whenever I found a new clue, the oppressive atmosphere makes these moments all the more joyous, a glimpse of hope in the relentless darkness.\n\nOverall, I'd give the game a solid 8, I've enjoyed playing it, and hope to play it many more times.", "timestamp_created": 1512675462, "timestamp_updated": 1512676047, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37673771": {"recommendationid": "37673771", "author": {"steamid": "76561197991766855", "num_games_owned": 108, "num_reviews": 1, "playtime_forever": 600, "playtime_last_two_weeks": 0, "last_played": 1509875140}, "language": "finnish", "review": "The Consuming Shadow is a very interesting game. It challanges player to save the world from otherworldy horror slowly forcing its way in, while managing time, health and sanity.\nThe player has three days to find a banishment ritual, figure out the invading god and make it to the Stonehenge. On the way player travels from town to town searching for rifts to close and various monsters, human and otherworldly, to exterminate.\nThe game features character upgrading system with birth stars, that boost various stats and attributes. When playing a character, the player gets experience points for that character, and when leveling up they get additional star to allocate upon starting a new game, improving your chances of survival.\nGraphicly the game could be improved, especially the UI. While some effects and textures are functional and fine, some could be improved.\nWhile the game offers challenge modes and different playable characters, the game can get repetetive. However, the game also challenges player by its core mechanics and randomly generated play sessions, requiring player to think and use their brain to even challenge the invading god.\nI recomend this game to those who can enjoy replaying the game multiple times, challenging gameplay and the tense atmosphere.", "timestamp_created": 1511705674, "timestamp_updated": 1511705674, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37607051": {"recommendationid": "37607051", "author": {"steamid": "76561198208262067", "num_games_owned": 113, "num_reviews": 5, "playtime_forever": 374, "playtime_last_two_weeks": 0, "last_played": 1512931324}, "language": "english", "review": ">boots game\n>gets the option to kill yourself\n>chooses it\n>dies\n>...\n\nkek gg 10/10", "timestamp_created": 1511661154, "timestamp_updated": 1511661154, "voted_up": true, "votes_up": 2, "votes_funny": 2, "weighted_vote_score": "0.501317", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "37228311": {"recommendationid": "37228311", "author": {"steamid": "76561197980804769", "num_games_owned": 366, "num_reviews": 3, "playtime_forever": 1094, "playtime_last_two_weeks": 0, "last_played": 1511479209}, "language": "english", "review": "The graphics aren't great, and the controls are a bit clunky, but the replayability and the difficulty of this game (especially when it comes to the challnge modes) makes this game worth it from a roguelike perspective. The lore is standard fare for cosmic horror, but it isn't anywhere near as badly presented as some other games that tend to be Lovecraft's sycophants.\n\nBut can you expect for the price of two pints? The fun lasts a hell of a lot longer.\n\n", "timestamp_created": 1511479629, "timestamp_updated": 1511479629, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520548", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36117326": {"recommendationid": "36117326", "author": {"steamid": "76561197998015177", "num_games_owned": 183, "num_reviews": 1, "playtime_forever": 375, "playtime_last_two_weeks": 0, "last_played": 1510238381}, "language": "spanish", "review": "No apto para cualquiera. En serio.\nYo reconozco que no es un juego que le vaya a gustar a todo el mundo. Es simple, de gráficos cutres y con una mecánica de combate que roza lo minimalista, pero tiene algo que lo hace muy especial.\n\nPara empezar, ni siquiera sabes cuál es tu objetivo una vez que empiezas el juego. Sí, sabes que un dios malvado quiere entrar por una grieta dimensional e invadir este mundo. Sabes dónde está la localización de esa grieta. Pero ahí acaba todo. No tienes ni idea de qué dios es, ni de cómo detenerlo. Tu objetivo, pues, es recopilar pistas para ir todo lo preparado posible al lugar de la invasión antes de que ésta se produzca (tienes unas 60 horas ficticias).\n\nCómo se hace eso? Yendo de pueblo en pueblo (tú eliges la ruta) intentando ayudar a todos en tu camino y a la vez recopilando pistas que vas anotando tú mismo en una especie de cuaderno. La gracia está en que todas las pistas cambian de un juego a otro y por lo tanto no valen de una a otra partida, si no que cada vez que juegas hay que investigar.\n\nTodo esto hace que el juego se distancie por completo de las mecánicas convencionales de los juegos de terror. El juego no trata de idiota al jugador, si no que este tiene que tirar de coco para poder tener una mínima posibilidad contra las hordas de la oscuridad.\n\nLos monstruos que te encuentras, así como la ambientación y el tema de la cordura (sanity) me recuerdan mucho al universo de Lovecraft, y de hecho, a falta de que lo confirme, es muy posible que fuera la intención de los desarrolladores. \n\nLos combates ya he dicho que son muy simplones. Tienes tres formas de matar a los monstruos; cuerpo a cuerpo, con balas de tu revolver o con conjuros. Es un aspecto que flojea, pero me da la impresión de que lo importante del juego es la gestión de tus recursos, más que tu destreza luchando. Aún así le doy un suspenso en este apartado.\n\nNo obstante lo compensa con su ambientación, tensa y lúgrube, su planteamiento tan original de tener que ir investigando y haciéndote tus croquis de quién puede ser el dios invasor, qué runas necesito para el conjuro de expulsión... una joya en estos apartados.\n\nCompra totalmente recomendada si lo que quieres es pasar un buen/mal rato por un precio bastante asequible para lo que ofrece.\n\nKill yourself... quiero decir, que lo disfrutéis!", "timestamp_created": 1509295821, "timestamp_updated": 1509295918, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36004997": {"recommendationid": "36004997", "author": {"steamid": "76561198032972455", "num_games_owned": 184, "num_reviews": 22, "playtime_forever": 988, "playtime_last_two_weeks": 0, "last_played": 1507487798}, "language": "english", "review": "The name is a perfect description of the game. The less you know the better, jump into it blind. Is the game pretty? No. Is the game clunky? Yes, and it serves the game well. You're not supposed to be a badass hero action cop, just a guy with a car, a gun, and 72 hours to save the world. Give it a try if you love lovecraftian horror. You won't be disappointed with the dreadful atmosphere this can pull you into with it's minimalistic artstyle and horrific sounds. Simply imagining what these creatures look like in detail is enough to send shivers down one's spine.", "timestamp_created": 1508997307, "timestamp_updated": 1508997307, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35937029": {"recommendationid": "35937029", "author": {"steamid": "76561198049430662", "num_games_owned": 38, "num_reviews": 1, "playtime_forever": 409, "playtime_last_two_weeks": 0, "last_played": 1511386361}, "language": "english", "review": "Normally I don't write reviews but I know this is Yahtzee's work and knowing this here's how you figure out which god is invading and what the banishment ritual is....\n\n[spoiler] RANDOM DOCUMENTS AND AUDIO LOGS! WE FIND THEM STUCK TO NOTICE BOARDS, WE FIND THEM UNDER DOGS! WE'RE GONNA PUT THEM IN A FILE AN' GIVE IT A REVIEW! AN' WE'RE BORED OF ALL THE GAMEPLAY BUT THERES NOTHIN' ELSE TO DO! *slam*[/spoiler]\n", "timestamp_created": 1508731020, "timestamp_updated": 1508731020, "voted_up": true, "votes_up": 0, "votes_funny": 3, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35894250": {"recommendationid": "35894250", "author": {"steamid": "76561198001008808", "num_games_owned": 324, "num_reviews": 6, "playtime_forever": 1173, "playtime_last_two_weeks": 0, "last_played": 1510104212}, "language": "english", "review": "Like tabletop Call of Cthulhu? Like rougelike-like games? Play this.", "timestamp_created": 1508599258, "timestamp_updated": 1508599258, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35761855": {"recommendationid": "35761855", "author": {"steamid": "76561198001275020", "num_games_owned": 398, "num_reviews": 4, "playtime_forever": 1123, "playtime_last_two_weeks": 0, "last_played": 1508114234}, "language": "english", "review": "Okay game with some broken aspects that the dev never bothered to fix, along with the game just being buggy in general, you might as well begin praying to the elder god of chaos theory.\n\nWith the artwork being a significant downfall of the game, combined with permanent bugs due to being abandonned by the developer, it kinda comes across as a joke that the developer prides himself on having made a career by critiquing video games.\n\nReally wouldn't recommend unless you've got more money than standards.", "timestamp_created": 1508114545, "timestamp_updated": 1508114545, "voted_up": false, "votes_up": 5, "votes_funny": 2, "weighted_vote_score": "0.375100", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35268827": {"recommendationid": "35268827", "author": {"steamid": "76561198017135739", "num_games_owned": 315, "num_reviews": 9, "playtime_forever": 394, "playtime_last_two_weeks": 0, "last_played": 1506784712}, "language": "english", "review": "Do you like Lovecraftian horror, good writing and rougelite mechanics? If you answered \"yes\" to at least one of above questions then I highly recommend to try out this game. Yahtzee has an amazing talent and manages to create engaging and thrilling stories. The graphics, yet minimalistic and simple, help to deliver slow madness and incoming apocalypse. Atmosphere is even better with music and sounds. Although I understand that the randomness of every playthrough may be a little discouraging. I had playthroughs that lasted 10 minutes, as I died horribly in one of the first \"dungeon area\", while I had some that lasted over an hour and delivered absolutely amazing, proceduraly generated story.\nI strongly recommend purchase of this game. If you ask me it was money well spent.", "timestamp_created": 1506624706, "timestamp_updated": 1506624706, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.565217", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35152170": {"recommendationid": "35152170", "author": {"steamid": "76561198192386713", "num_games_owned": 46, "num_reviews": 5, "playtime_forever": 733, "playtime_last_two_weeks": 0, "last_played": 1509902290}, "language": "english", "review": "I was surprised with this one. The gameplay is surprisingly engaging. The atmosphere is heavy like frozen jam. The unlockable characters are kinda useless except the Ministry Man, tons of replayability and is just as fun on the first run as it is the four thousandth.", "timestamp_created": 1506169474, "timestamp_updated": 1506169474, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34963282": {"recommendationid": "34963282", "author": {"steamid": "76561198112228691", "num_games_owned": 286, "num_reviews": 15, "playtime_forever": 230, "playtime_last_two_weeks": 0, "last_played": 1512311974}, "language": "english", "review": "For a game that is written about a zombie apocalypse in the UK, it feels very out of touch. This game allbeit warrants a fun appeal at first, the idea that your a reoccuring character is novel but leaves some imagination to where to go next in the game. The sideways scrolling feels like it belongs on an old console port and not on a modern 2017 pc. This game just doesnt match up to the others out there in the same genre id advise you ignore it and move on. Its quite clear the developer knows he/they have done something wrong here.\nAvoid this one ladies. It will only end in you paying money for a pile of rubbish. Better free games out there with far more content than this has to offer.", "timestamp_created": 1505447142, "timestamp_updated": 1511493069, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.280915", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34443478": {"recommendationid": "34443478", "author": {"steamid": "76561197997246476", "num_games_owned": 406, "num_reviews": 21, "playtime_forever": 744, "playtime_last_two_weeks": 166, "last_played": 1514135539}, "language": "english", "review": "It's an interesting title and worth a look if you're into table top games like eldersigns as I think it's in the setting, events and writing that are the games strongest elements. The combat feels a little clunky at first but is servicable and adds an element of challenge without feeling broken.\n\nThe progression system and different play styles give a sense of progresion. Probably a purchase for the patient horror fan, but I found it's puzzle solving elements strong enough to keep me playing.", "timestamp_created": 1503510840, "timestamp_updated": 1511399139, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34183805": {"recommendationid": "34183805", "author": {"steamid": "76561198064668740", "num_games_owned": 119, "num_reviews": 16, "playtime_forever": 425, "playtime_last_two_weeks": 0, "last_played": 1503239461}, "language": "english", "review": "Not a game I thought I'd get into... thought I'd play it for half an hour and get a refund... I was wrong. This is a damn good game.", "timestamp_created": 1502514678, "timestamp_updated": 1502514678, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33807532": {"recommendationid": "33807532", "author": {"steamid": "76561198005010038", "num_games_owned": 558, "num_reviews": 10, "playtime_forever": 601, "playtime_last_two_weeks": 0, "last_played": 1457859001}, "language": "english", "review": "I followed this game through its development, and really enjoyed what I saw of it. When it became available, I grabbed it and played it through pretty early on.\n\nHonestly, it's a decent, fun roguelike, but in the vein of the genre, it's one where you'll fail a lot. Even if you're very expert at the game, there are a lot of things that can happen that seem just straight up failure-based. Some enemies, last I played, were just pretty undoable without ammunition, or traded a decent slab of your HP.\n\nIt's a good game, just don't feel bad if you fail it a lot. And if you're anxious about things, maybe not the best game to play.", "timestamp_created": 1501071743, "timestamp_updated": 1501071743, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33732164": {"recommendationid": "33732164", "author": {"steamid": "76561198151692432", "num_games_owned": 138, "num_reviews": 4, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1486860459}, "language": "english", "review": "Pros:\n- Made by Ben 'Yahtzee' Crowshaw\n- Lovecraftian \n- Tons of replayability \n- Easy to get lost in \n- Interesting plot that changes with each playthrough \n- No tutorial (some may see this as a con however)\n\nCons: \n- Some design and graphic choices may put people off\n- Bit of a learning curve (takes a while to really get the flow of the game, but once you do it's extremely rewarding)\n\nAll in all, The Consuming Shadow is, in my book, one of the better games out there and it doesn't need fancy graphics to draw you in and keep you drawn in for hours at a time. You die a lot in this game and thats not a bad thing, because everytime you die, you've more than likely learnt how you could have done better. Leveling in this game adds new features to your game that weren't there before. For example, one of the first things you unlock after your first couple of playthroughs is a perk tree of sorts, it allows you to allocate points into certain areas such as max ammo, max health, max sanity, resistances... You get the idea. The great thing about that however is, you get to allocate points every playthrough, so you can experiement and play around with the perks until you find a perfect match for your playstyle.\n\nI highly reccomend the game for those of you who are patient and willing to learn every bit about a game and get lost in the worlds lore. \n", "timestamp_created": 1500766348, "timestamp_updated": 1500766348, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33669343": {"recommendationid": "33669343", "author": {"steamid": "76561198031645130", "num_games_owned": 33, "num_reviews": 3, "playtime_forever": 501, "playtime_last_two_weeks": 0, "last_played": 1503506124}, "language": "english", "review": "This is a very well made and well written game, it really does require some level of deduction to......win.\n\nIt has a lot of fun challenges behind it, plenty of lore, several unique enemies to keep you on your toes, and a few different play styles to fit you.", "timestamp_created": 1500546527, "timestamp_updated": 1500546527, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33537294": {"recommendationid": "33537294", "author": {"steamid": "76561198058925614", "num_games_owned": 151, "num_reviews": 18, "playtime_forever": 1447, "playtime_last_two_weeks": 0, "last_played": 1500114802}, "language": "english", "review": "A gun, a car and sixty hours to save the world!\n\nUnless you pick one of those other guys...", "timestamp_created": 1500043480, "timestamp_updated": 1500043480, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.497512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33435739": {"recommendationid": "33435739", "author": {"steamid": "76561198029126609", "num_games_owned": 140, "num_reviews": 59, "playtime_forever": 71, "playtime_last_two_weeks": 0, "last_played": 1499824958}, "language": "english", "review": "I think its a fun little game, being a fan of Yahtzees work I can definitley aprecciate the effort he has put into it. To start on the positives it does have a nice atmosphere and good difficulty. I like a lot of the mechanics and systems put into place. It has a lot of nice ideas in general. The influence from the likes of say FTL is quite obvious. I also aprecciate the progression system.\n\nHowever I cant say I would reccomend this in a circumstance other than sale. For starters it has a rather low quality early 2000's web game look to it. The combat is clunky and incantations/spells are also clunky to use. Maybe a turn based system would suit the game more. I also wish the game had a bit more variety to it which would make more playthroughs diffirent with more variety.\n\n7/10", "timestamp_created": 1499706293, "timestamp_updated": 1499706293, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.496654", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33373152": {"recommendationid": "33373152", "author": {"steamid": "76561198041300903", "num_games_owned": 415, "num_reviews": 14, "playtime_forever": 822, "playtime_last_two_weeks": 0, "last_played": 1499762782}, "language": "english", "review": "I shot myself in the head accidentally. 10/10", "timestamp_created": 1499517939, "timestamp_updated": 1499517939, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33335459": {"recommendationid": "33335459", "author": {"steamid": "76561198076103721", "num_games_owned": 92, "num_reviews": 1, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1499412012}, "language": "english", "review": "Doesn't work with windows 10. The screen just stays black, I know the game hasn't crashed because the sounds still work and if i press randomly i can still start the game.", "timestamp_created": 1499412238, "timestamp_updated": 1499412238, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.313157", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33304713": {"recommendationid": "33304713", "author": {"steamid": "76561198011456469", "num_games_owned": 308, "num_reviews": 14, "playtime_forever": 210, "playtime_last_two_weeks": 0, "last_played": 1507260786}, "language": "english", "review": "Relatively quick playthroughs combined with serviceable gameplay and compelling detective work all wrapped up in a nice, Lovecraftian eldritch package. All in all it's just damn good.", "timestamp_created": 1499330005, "timestamp_updated": 1499330005, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "33284022": {"recommendationid": "33284022", "author": {"steamid": "76561198077889168", "num_games_owned": 1834, "num_reviews": 18, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1499275098}, "language": "english", "review": "It's... alright for a first try.", "timestamp_created": 1499275144, "timestamp_updated": 1499275144, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.253120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32921847": {"recommendationid": "32921847", "author": {"steamid": "76561198045050154", "num_games_owned": 357, "num_reviews": 7, "playtime_forever": 954, "playtime_last_two_weeks": 0, "last_played": 1498983656}, "language": "english", "review": "Let's all do Yahtzee a favour and pretend the sprite tearing is a sanity effect.", "timestamp_created": 1498640622, "timestamp_updated": 1498640622, "voted_up": true, "votes_up": 10, "votes_funny": 28, "weighted_vote_score": "0.580033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32823826": {"recommendationid": "32823826", "author": {"steamid": "76561198015733349", "num_games_owned": 366, "num_reviews": 16, "playtime_forever": 429, "playtime_last_two_weeks": 0, "last_played": 1498762728}, "language": "english", "review": "Incredibly dark and atmospheric Lovecraftian game, fairly simple to get into once you understand the mechanics and interactions between the gods. The combat controls are a bit clunky, but nothing too awful. Definitely suggest getting this while it's on sale this summer.", "timestamp_created": 1498498840, "timestamp_updated": 1498498840, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32711530": {"recommendationid": "32711530", "author": {"steamid": "76561198330937137", "num_games_owned": 67, "num_reviews": 18, "playtime_forever": 822, "playtime_last_two_weeks": 0, "last_played": 1502820629}, "language": "english", "review": "Right, this is long. Hopefully bits of it are useful to you. I'll say right up front that I've really been enjoying playing the game.\n\nIndividual playthroughs are quite fast. I ate pavement, brutally, on my first several tries at this game, followed by a few more tries where I ran out of time before running out of health for a change. By then I'd unlocked another character whose style suits me much better, and at that point managed a full game and banishment (but not the optimal ending) in my first 6.7 hours of gameplay. There have been $60-release titles that lasted about that long before I was done with them, so this was a good start.\n\nCombat, like the graphics, is pretty bare-bones, but both get the job done. I'll say this for the art: The shadowy figures of the playable characters, however 'creator cannot art' they may be, suit the kind of game that it is. It's not about them, it's about saving the world from falling into shadow as they slowly slide into madness along the way. Sometimes madness gets the upper hand...\n\nThe music provides a nicely atmospheric backdrop to the game, without being distracting or annoying, speaking as someone who gets fed up and turns the music off, or at least the combat music, in more games than where I don't. The flip side of this is that I couldn't find an option to turn down or off only the music and not all ingame sound. Because there's, sensibly, no music to speak of in areas where combat occurs, this isn't a deal breaker for me. If you do tire of the music, you can turn sound off everywhere else, and turn it on for those parts where being able to hear enemies can save you some pain and Sanity. It's a functional solution, though not ideal.\n\nI'm more annoyed that, if it's possible to re-map the game controls, I couldn't determine how. Clicking on them in the controls list does nothing. That's my biggest negative point about this game, since for me, it makes the combat more awkward than it needs to be. It's also a personal pet peeve, so take with the appropriate number of grains of salt.\n\nThe rest of the interface can be a bit awkward (I'm keyboarding) but I've only had serious trouble once. I managed to backstep my character and get wedged at the entrance to a dungeon I'd just entered, with it throwing the flee-or-proceed window at me over and over each time I opted to stay. I managed to wriggle him loose somehow after several minutes and carry on.\n\nThe birth stars mechanic is interesting, making even failed attempts on a character gradually count toward scrabbling your way to a win on future attempts. I like that, and also like that placements aren't set in stone forever, but assigned again at the start of each playthrough. I haven't tried the challenge modes yet, but they look promising.\n\n[Edited to add additional observations, including...]  I'd held off looking at the diary entries until I had all of the earliest ones and could read the first chunk of them in order. Like a lot of random document backstory stuff, reading them is optional, but I'm enjoying getting the rest of the story. It's added flavor to subsequent playthroughs.\n\nThe design of the game includes few guarantees; I had to walk into the final confrontation with a best guess based on evidence, because the random clues hadn't given me confirmation of the name. They'd given me enough that I was almost sure I was right, though, and when it turned out I was, that was more fun than just go-here-go-there-ok-got-all-the-parts-now-hit-combine-for-the-win. Or to put it another way, I may have yelled a few triumphant expletives at the end when the incantation worked.  ;D  I have yet to get impossibly stuck, being a victim of my own time management or combat skills aside.\n\nI expect I'll be yelling a lot more angrily if the randomized bits result in me taking a flying leap into doom and failure, and they were the source of the time-ran-out losses I've had so far: I got caught too far out to drive to the end location after I hunted for one more useful clue. \n\n[LATER EDIT: I finally did it, I failed a run so hard that even an educated guess was probably beyond hope. The random towns I picked to go to kept being not-yet-darknessized when I didn't have any funds or clues yet and really needed some. And the ones that were in trouble which the game directed me to gave me clues that weren't filling in the blanks I needed. Losing this way was less irritating than I expected it to be, partly because even though I failed miserably, I got a respectable pile of XP from the effort, and partly because it was stiill fun even when I realized, 8 hours from impending doom, that I wasn't going to pull this one off.]\n\nBut the neat twist is that, as long as you don't push your luck past breaking with the timeclock to get there, you can always go at the final boss with a guess at the bits you're missing. So, The Consuming Shadow doesn't easily leave you stuck at a boss fight you have NO way to win. (\"Not easily\" isn't the same as \"doesn't ever\", but it'll do!) That's more than I can say for FTL:Faster Than Light, which I do like, but which has a real habit of randomizing its way to a fatal smack against a brick wall. (Also, just because I'm yelling at a game doesn't necessarily mean the game sucks. If I'm invested enough to yell, then that's at least one point in the positive column.)\n\nI did flounder a bit on my first go at The Consuming Shadow's end scenario, but I also think I know what I missed, which I like better than \"Boss destroyed me. Gee, wish I knew why\". And it was still a win, if a sloppy one! I'll see if I was right the next time I get there. [Edit: Having seen the end engagement again, I was right, I did miss something that first time. It was a fun \"ah-HA, I see now\" moment.]\n\nOh yes, there will be a next time. I unlocked a third character on that one victorious run, and I'm not done with the first two yet. So I'd say that The Consuming Shadow is definitely worth a try. \n\n[Edit/P.S.: The third character is fun as well, but the second remains my favorite. On the other hand, if I'd been playing the third character I unlocked, that catastrophically failed playthrough I recently had might have ended very differently...]", "timestamp_created": 1498281016, "timestamp_updated": 1502564636, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.723757", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32206010": {"recommendationid": "32206010", "author": {"steamid": "76561197983693357", "num_games_owned": 142, "num_reviews": 1, "playtime_forever": 981, "playtime_last_two_weeks": 0, "last_played": 1512060375}, "language": "english", "review": "Not the best when it comes to the visuals, but the atmosphere and gameplay is amazing.\n\nIf you love survival horror and lovecraftian themes, this is the game for you.", "timestamp_created": 1496688883, "timestamp_updated": 1496688883, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543568", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "32046576": {"recommendationid": "32046576", "author": {"steamid": "76561198032081181", "num_games_owned": 185, "num_reviews": 11, "playtime_forever": 606, "playtime_last_two_weeks": 0, "last_played": 1496175090}, "language": "english", "review": "Pros:\n-Unique and organic logic puzzle-based gameplay\n-Satisfying to master the combat system\nCons:\n-Graphics\n-Game games stale after maybe 4 hours of gameplay\n\nNot very scary after the first ten minutes or so, but that's not really what I'm here for.\nIt's a pretty decent survival game (though it gets dramatically easier after you play for an hour or so and your character permanently 'levels up' a few times), and an adequate procedurally generated dungeon crawl.\nThe coolest part of the game is by far how it incorporates logic puzzles. You'll end up figuring out complex puzzles in a very organic way, and it is always incredibly satisfying figuring out who the invading god is and what the rune necessary to seal them away is.\nThere ARE times when you'll have an unsatisfying run (generally due to not getting any of the necessary clues), but that comes with the nature of procedurally generated games like this, such as FTL.\n\nOverall, I recommend it. The logic puzzles are something I've never seen in a game before, and getting rare drops (such as learning a ritual spell) is always exciting.", "timestamp_created": 1496080570, "timestamp_updated": 1496080570, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31706326": {"recommendationid": "31706326", "author": {"steamid": "76561198153156295", "num_games_owned": 86, "num_reviews": 2, "playtime_forever": 1403, "playtime_last_two_weeks": 147, "last_played": 1514243360}, "language": "english", "review": "[h1]The biggest disservice this game does to itself is presenting itself as \"cheap and \"tacky\", when at least 85% of player know the heart of the game is in the gameplay - and [b]JESUS,[/b] is the game good. 8/10.[/h1]", "timestamp_created": 1494610083, "timestamp_updated": 1494610128, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.650392", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31533153": {"recommendationid": "31533153", "author": {"steamid": "76561198174940523", "num_games_owned": 83, "num_reviews": 2, "playtime_forever": 473, "playtime_last_two_weeks": 187, "last_played": 1514074995}, "language": "english", "review": "Very atomspheric, fun horror game.", "timestamp_created": 1493856311, "timestamp_updated": 1493856311, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.494840", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31498159": {"recommendationid": "31498159", "author": {"steamid": "76561197993819884", "num_games_owned": 79, "num_reviews": 8, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1501600800}, "language": "english", "review": "well starting out it seems like another dark souls difficulty game but eventually you realize YOUR DOING IT WRONG you dont fight your opponents you smart them learn magic and go INSANE 10/10 would go mad again", "timestamp_created": 1493689466, "timestamp_updated": 1493689466, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "31165035": {"recommendationid": "31165035", "author": {"steamid": "76561198038278528", "num_games_owned": 597, "num_reviews": 12, "playtime_forever": 90, "playtime_last_two_weeks": 0, "last_played": 1474718320}, "language": "english", "review": "Yeah, it's pretty good.", "timestamp_created": 1492290894, "timestamp_updated": 1492290894, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.436314", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30902416": {"recommendationid": "30902416", "author": {"steamid": "76561198130111269", "num_games_owned": 164, "num_reviews": 2, "playtime_forever": 2601, "playtime_last_two_weeks": 0, "last_played": 1511987286}, "language": "english", "review": "Forget that this game hasn't got the best graphics in the world; Yahtzee manages to create a very tense, foreboding and dreaded atmosphere with the limited resources he used. The game shines in that regard, as there is a constant feeling of tension when you investigate a location, looking for clues. Limited visibility, ammunition and (especially in the beginning of the game) frailty of both body and mind only add to this, and in a good way.\n\nThe overall gist of the game is this: there is an Ancient God that is trying to invade the world, and you have 60 hours to banish it. Who, or what, the God that is invading is, you don't know. By solving and completing dungeons/quests, you will get clues that push you in the right direction. But even if you have deduced everything correctly, you still need to make an educated guess. And that is what you do in the game's only permanent location: Stonehenge. If you deduced the clues right and got the correct Ritual of Banishment, you have a chance to save the world. In all other cases, you don't.\n\nThe game is procedurally generated, and everything is random when you start a new game (except Stonehenge). Locations will have monsters, clues and other helpful items, there will be random encounters when you travel between locations, your phone will receive texts which can be either good or bad... and that is only scratching what this game has to offer. You can even unlock 3 additional characters with each of them having their pros and cons, plus a challenge mode, which add replayability. And after each time you finish a game (good or bad), you will gain points which will level up your chosen character. Each level grants a birth star which you can allocate to a constellation when starting a new game to gain some bonuses.\n\nFor everyone who doesn't really care about graphicsin a game, like to have an atmosphere not unlike Silent Hill's, and enjoy Lovecraftian fiction, get this game right away. It is hard in the beginning, but once you start gaining levels you are that much closer to banishing that Ancient one.", "timestamp_created": 1491143439, "timestamp_updated": 1491143439, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30459273": {"recommendationid": "30459273", "author": {"steamid": "76561198001776842", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 916, "playtime_last_two_weeks": 0, "last_played": 1484613334}, "language": "english", "review": "If you're looking for flashy graphics you're going to be disappointed. But this game manages to use it's minimalistic graphics to instill a sense of creeping dread as you try to survive long enough to save the world. The clunkiness of the combat system actually adds to the sense that this is a desperate last struggle to save humanity from forces vastly more powerful than you. 9/10 would die die die again.", "timestamp_created": 1489278196, "timestamp_updated": 1489278196, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30378110": {"recommendationid": "30378110", "author": {"steamid": "76561198305223081", "num_games_owned": 73, "num_reviews": 10, "playtime_forever": 953, "playtime_last_two_weeks": 0, "last_played": 1512623922}, "language": "english", "review": "\n\nThe Consuming Shadow- Minimalism Maximized.\n\nThe Consuming Shadow is a two dimensional Procedural survival horror game By Yahtzee Crowshaw. I gave this review the title it has not because The Consuming Shadow is an exercise in minimalist design, but because it’s executes a dizzying level of subtly and complexity through it. One of the first things you notice when opening the main menu is a rather simplistic two-dimensional art style. I would argue that not only does this not take away from the horror experience, it actually can and will add to it. Here in the main menu you see the player character hunched over a desk in a nearly pitch black room giving a basic summary of plot details. A shadow(see game name if this was a genuine surprise to you) has fallen over jolly ol’ Enlgand and you 'The Scholar’ has been tasked by the Ministry of Occultism with putting an end to it. Within the menu itself you have the option of beginning your journey or killing yourself. This is a masterfully crafted execution of both the games tone, and one of it’s central game play mechanics. Clicking on 'Kill Yourself” starts a mini-game where you frantically tap the mouse to keep a silhouette of your character from putting a gun to their head and pulling the trigger...obviously. After you begin your journey you find in yourself in your car with a map of England and a variety of towns. You will notice a sixty hour timer on your screen. Time management is a factor here. If you fail to die within sixty hours, the invading god will do what he does. Which is invading. Also here is another great moment of subtly. In your rear view mirror is a post it note with the words “Don’t look back” written on it. At first it seems almost whimsical, but as your sanity wanes you start to see it as a call for clarity in a world going mad. Your car is where you can heal from a refillable med-kit, and take narcotics to temporarily restore sanity with diminishing returns. You can find your book of clues and a spell book. Clues will logged as you find them. They are integral to completing the game. You need to discern the identity of the invading god and the correct runes needed for his banishment ritual. This segues nicely into your spell book. Here you keep all the spells you have learned and more importantly, your knowledge of what runes are needed for the banishment ritual. You will also receive texts from time to time in your car. They run the gamut of job offers from the ministry, family texts that can or subtract sanity and random numbers or threats from cultists. Also you can sort through equipment you find in dungeons and purchase from towns. These while not necessary, they can extremely useful.  This section of the game has a somewhat Oregon Trail feel with traveling from town to town(albeit in a non-linear fashion) while coming across a variety of random encounters along the way. Towns themselves will consist of either friendly towns or towns that have fallen to the shadow. Friendly towns give you the option to scavenge for supplies and a hospital for mending wounds, refilling med-kits and buying more drugs. All of this is conveyed through a simple but well executed silhouettes of towns with accompanying text. Fallen towns are where the meat of the game-play is located. Here you will find “dungeons” consisting of various realistic settings like hospitals, parks and warehouses. Objectives will be rescuing a hostage, closing a dimensional rift, defeating a large creature or finding an important artifact. I am going to leave an important note here, imagine it as a post it note on your rear-view mirror. You, will, die. You will die a lot. It is not simply a Dark Souls combat style of masochist difficulty, it is a central game-play mechanic. Completing dungeons, killing monsters and piecing together clues about the impending gods arrival all give you experience. The difference here is, you only level up when you die. Every level unlocks birth signs which are used to boost your stats at the beginning of each new journey. Birth signs are placed in the sky near astrological symbols which confer health and sanity bonuses, to other things like loot drops, research buffs, spell effectiveness and larger ammo capacity. Combat consists of using your 9.mm pistols for ranged, or pistol whipping for melee. Here lies one of my favorite aspects of Consuming Shadow and one of my favorite types of horror game combat in general. Combat in horror usually falls into one of three categories. On one extreme you have the Outlast/Amnesia style horror combat, where there is basically no combat. Your a wet paper bag lost in the wrong side of town. You stealth about and run when you realize you suck at sneaking. On the other end is the Doom 3/Dead Space style combat. Your a sentient oil drum filled to the brim with whoop ass. you mow down all sorts of monstrosities and neer’do’wells with gleeful abandon. The Consuming Shadow falls into that happy medium between the two ala Resident Evil 1-3 or Zombi. A wonderful chunk of corned beef and sour-kraut between two slices of wholly different loaves of bread. You have means of defending yourself, sometimes it is the better option. Other times, it is not. The dungeons are procedurally generated making each play through fresh and new. Here you will encounter various ghastly creatures and occasional cultists; human foes who cast profane magic at you. Taking damage or leaving rooms with enemies in them result in sanity loss(among other ways) While sanity mechanics have been implemented in other games, I find Consuming Shadow executes it almost to perfection. As your sanity drains, a whole host of uncanny visual effects begin happening. Translucent black botches appear on the screen, a grain effect fades in an out. Sometimes the silhouette of your character will disappear entirely, doors will shift about and enemies that only exist in your mind will appear. While are all well and good despite being cribbed to some level from Eternal Darkness, there are other sanity effects that nail the atmosphere and horror like a professional sniper. One in particular is when the objective text at the beginning of a dungeon is replaced with “kill yourself” “die die die” etc, only to seamlessly transition back into the normal text while your reading it. The other major one is far more sinister. Various commands in the town and car sections will randomly be replaced with the “Kill Yourself” command for a few moments. You will accidently hit this. If you succeed at pulling the gun from your throat, you have a high chance at recovering some sanity, But, it gets progressively harder every time you enter the mini-game. While It is never stated in any way, a lot of background story telling is at play here when infer that even when you are completely out of ammo, you still have one bullet left. It is a great reinforcement of the despair and morbid atmosphere in this game. Even when your characters head is held high, they still know in the back of their mind the only fail safe way to save themselves from the darkness is to simply end it all. The endgame of all this is to discover enough clues about who the invading god is to form the correct banishment ritual. The place of his summoning will always be found at Stonehenge, the farthest point from where your journey begins. You can also learn an assortment of spells for different situations by combining the runes you encounter throughout the game. The trade off is, they cost sanity to use. Which you will soon find out, sanity is a priceless commodity in short supply. When you die, or complete the game(you lucky bugger) your’re presented with a rundown of your characters actions. This is one of many moments where Yahtzee really flexes his writing chops and despite their random nature, I found all of them compelling and enjoyable. I believe I covered most of the meat that is\n\n4/4 Banishment runes", "timestamp_created": 1488914226, "timestamp_updated": 1488914226, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.504384", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30109857": {"recommendationid": "30109857", "author": {"steamid": "76561198066327538", "num_games_owned": 254, "num_reviews": 8, "playtime_forever": 354, "playtime_last_two_weeks": 0, "last_played": 1487917738}, "language": "english", "review": "Love the game, got frustrated when I found myself with 94 Sanity but still suffering negative effects (Still gonna play it doe)", "timestamp_created": 1487810108, "timestamp_updated": 1487810108, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "30001580": {"recommendationid": "30001580", "author": {"steamid": "76561198005879531", "num_games_owned": 1024, "num_reviews": 41, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1487400282}, "language": "english", "review": "Interesting.  Like Where Is Carmen Sandiego (I think that's that it was called) but with monsters and suicide.", "timestamp_created": 1487400393, "timestamp_updated": 1487400393, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.512144", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29863923": {"recommendationid": "29863923", "author": {"steamid": "76561198043837917", "num_games_owned": 72, "num_reviews": 7, "playtime_forever": 961, "playtime_last_two_weeks": 0, "last_played": 1488868798}, "language": "english", "review": "[h1]Preface[/h1]\n[i]The Consuming Shadow[/i] is a game whose graphics are somewhere between Amiga and early 2000s flash game.  I opened my review with that sentence because at the time this game came out, I was absolutely enraged to see much of the internet tout graphics as this game's fatal flaw.  What those brainless twats don't realize is fuck graphics - [i]The Consuming Shadow[/i] is all about gameplay... and its sopping with it.  \n\n[h1]With that done, now the actual review.[/h1]\n\nYour goal is to save the Earth from impending doom at the hands of an unknown deity.  Standing in your way are hordes of monsters, an ever-looming time limit, and your own rapidly deteriorating mental-state.  Insanity plays a huge role in [i]The Consuming Shadow[/i], as well it should in any game with a mythos inspired by H. P. Lovecraft, and your character will, indeed, start seeing shit that is not real, become less efficient in combat, and might even attempt to take his or her own life... just, kinda outta the blue... or because a dialogue box turned to \"kill yourself\" without you noticing, sending the player off tap-tap-tapping furiously away at the A key to not die.\n\nThe game is set across England and you'll travel between fictional cities, procedurually laid out on the map, collecting supplies, completing quests, and finding clues as to just who or what is trying to destroy everything.  Combat is profficiently done in a two-dimensional side-scrolling style with the three main flavors being melee (pistol-whipping), ranged (shooting said pistol), and spells (which don't, to my knowledge, involve the pistol in any way).  Items that you can scavenge include three different kinds of ammunition for your pistol, various different upgrades to both yourself and your vehicle, and [b]illegal drugs[/b] (because how else do [i]you[/i] temporarily manage your sanity?)  The last pillar of gameplay are the clues to who is invading reality and this is where the genius of [i]The Consuming Shadow[/i] shines it's brightest.  Each clue you scavenge is in a form like what you would see in a logic puzzle.  For instance, let's say you found a clue: \"Chzo hates knobs,\" and you already had, \"the god who hates knobs owes you twenty bucks.\"  So after contemplating why it is Chzo doesn't like knobs and when it was you lent him money, you can access the handy in-game fact table from the menu and mark down that information for later.  I've always said, \"the only way to improve logic puzzles are to add violence, drugs, and existential statements on reality\" and I now see that I was right all along and not just weird or something.\n\nBeing procedural and very [i]Rogue[/i]-ish, there's a lot of fun to be had just playing the main game, especially with unlockable characters and different play-styles, but [i]The Consuming Shadow[/i] also includes two different types of challenge modes, one of which involves descending into an infinitely-deep dungeon a-la [i]Nethack[/i].  Very, very replayable.  I managed to annoy someone into giving me a pirate copy when this first released, and over the course of the past year, I've played it enough off and on that when I finally got my finances sorted, it wasn't just a since of duty to the artist that I legitly purchased this game.\n\nYahtzee Croshaw is the rare type of critic whose talent and skill does not begin and end at the analyzing of other works.  Check out this [url=http://www.fullyramblomatic.com/games.htm]link[/url] for all the games he's developed over the years, and if you enjoy [i]The Consuming Shadow[/i], give [i]Adventures in the Galaxy of Fantabulous Wonderment[/i] a look as there's many parallels in game-design between the two.", "timestamp_created": 1486872544, "timestamp_updated": 1486873222, "voted_up": true, "votes_up": 8, "votes_funny": 1, "weighted_vote_score": "0.582514", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "29776933": {"recommendationid": "29776933", "author": {"steamid": "76561198049948479", "num_games_owned": 228, "num_reviews": 6, "playtime_forever": 1455, "playtime_last_two_weeks": 0, "last_played": 1512854611}, "language": "english", "review": "My favorite run (also the most frustrating run, admittedly) was with the [spoiler]Wizard[/spoiler] character, because I was just barely able to fully assemble the Banishment Ritual and get to Stonehenge with enough supplies and runes to banish Chzo, before watching my last few precious seconds dwindle away to doom the world. It's actually great fun, I highly recommend picking this one up if the description of the game even remotely interests you.", "timestamp_created": 1486540267, "timestamp_updated": 1486540267, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28957693": {"recommendationid": "28957693", "author": {"steamid": "76561198061501510", "num_games_owned": 345, "num_reviews": 95, "playtime_forever": 1038, "playtime_last_two_weeks": 0, "last_played": 1506294098}, "language": "english", "review": "Fortunately there's a lot less gay rape than in some of his previous games", "timestamp_created": 1483394426, "timestamp_updated": 1506358993, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28340347": {"recommendationid": "28340347", "author": {"steamid": "76561198067765525", "num_games_owned": 129, "num_reviews": 1, "playtime_forever": 963, "playtime_last_two_weeks": 52, "last_played": 1513737679}, "language": "english", "review": "Um, yeah look it's pretty good.\n\nGraphically it's kind of shit but it makes up for that by using the silhouettes and big, bold sprites and you won't often miss stuff because the graphics were too bad to see it. The UI is also decent, though the inventory navigation is a little unintuitive, you click on the slot you want to swap out and then have to select from the inventory the item you want to swap it with instead of just a drag and drop situation. I dunno.\n\nStory, yeah I mean with we're talking about lore it's pretty solid, it doesn't try to force feed it to you but sorta offers it on the side like, \"Here is the main course and beside it is a rather lovely sauce to give the meal context if you like.\" So yeah. Also the writing it good too.\n\nGameplay-wise it fits a horror setting (in my view) in that ammo is relatively scarce, though that can fluctuate depending on the seed (more on that below), and the combat itself is clunky but managable. The game punishes you for fleeing but not in a completely unmanagable way and more as an incentive to fight the horror. \n\nRogue-like elements, including the meta-game progression in the form of birth stars which are allocated before each game and give buffs, are pretty well done though I can see how eventually they may become over-powering. You can delete your history on the game, resetting you, but I guess the life of a rogue-like will inherently depend on how long it takes for you to get bored with it (maybe, I'm not an expert).\n\nOverall, decent enough if you can look past the graphics. Tonally it's consistent, with a focus on prioritisation (personal surivival vs. being a decent person for a bunch of sprites) as well as with an heavy weightiness to it (bad description, think Silent Hill 2?). Um, so yeah, thanks for reading all of this. I'm not an expert but I hope this helps mate (or lady-mate).", "timestamp_created": 1481620833, "timestamp_updated": 1481620833, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28248186": {"recommendationid": "28248186", "author": {"steamid": "76561198037178823", "num_games_owned": 193, "num_reviews": 11, "playtime_forever": 472, "playtime_last_two_weeks": 0, "last_played": 1481175858}, "language": "english", "review": "(place holder thumbs up till I can be bothered to review the game)", "timestamp_created": 1481176525, "timestamp_updated": 1481176525, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492239", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28242655": {"recommendationid": "28242655", "author": {"steamid": "76561198043595103", "num_games_owned": 111, "num_reviews": 4, "playtime_forever": 594, "playtime_last_two_weeks": 0, "last_played": 1488910444}, "language": "english", "review": "Right off the bat the game is very atmospheric. the game does keep you your toes by having new enemys and you have tons of stuff to unlock so you could have more hours of play time. Over all i give this game a good 9/10", "timestamp_created": 1481144926, "timestamp_updated": 1481144926, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "28133191": {"recommendationid": "28133191", "author": {"steamid": "76561198074595422", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 435, "playtime_last_two_weeks": 0, "last_played": 1481042301}, "language": "english", "review": "tall man cornered the ministry man while trying to banish chzo. for anyone who knows the chzo mythos, that is beautiful. well designed gameplay, upgrade system is innovative and unique every time, and the story is highly competent. \n\n10/10 would reccomend to lovers of roguelikes and/or horror.", "timestamp_created": 1480658290, "timestamp_updated": 1480658290, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27572785": {"recommendationid": "27572785", "author": {"steamid": "76561197983370738", "num_games_owned": 305, "num_reviews": 4, "playtime_forever": 1140, "playtime_last_two_weeks": 0, "last_played": 1500736491}, "language": "english", "review": "Can`t play it in dark. It gets on your nerves.", "timestamp_created": 1480119834, "timestamp_updated": 1480119834, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.498518", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27420234": {"recommendationid": "27420234", "author": {"steamid": "76561198057328440", "num_games_owned": 792, "num_reviews": 6, "playtime_forever": 687, "playtime_last_two_weeks": 0, "last_played": 1508137332}, "language": "english", "review": "It may not be the most visually impressive game ever made, but I have yet to play anything which captures the miserable nihilism and existential terror of Lovecraft better than The Consuming Shadow. The gameplay mechanics are satisfying (especially with a controller), the writing is excellent, and everything drips with oppressive creepy atmosphere.", "timestamp_created": 1480068971, "timestamp_updated": 1480068971, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27399040": {"recommendationid": "27399040", "author": {"steamid": "76561198018974323", "num_games_owned": 368, "num_reviews": 1, "playtime_forever": 241, "playtime_last_two_weeks": 0, "last_played": 1472948767}, "language": "english", "review": "There are many games that attempt to embrace Lovecraftian mythology, but none come nearly as close to it as this one. The gameplay is slow, as it should be, and although it does have the cliché sanity meter, it is a staple for attempting to tackle the world Lovecraft created. You start your journey with next to no information (unless you play as a specific unlockable character) only the knowledge that the world is coming to an end in three days, a car, and some cash in your pocket. Using the runes on the walls of dungeons in addition to notes left behind that give you somewhat detailed information, and the nature of the dungeon and affilation of the monsters you make inference on the god you need to seal. The combat is clunky and your character lumbers about in the dark and dreary environments. This experience, while infuriating to some, people like me find that it brings the game world together. You aren't just managing your resources and sanity in game, the slow gameplay with a time limit grates on your mind in real life as well. All in all if you are looking for a Lovecraftian procedually generated mystery game you won't find anything better than this.", "timestamp_created": 1480058801, "timestamp_updated": 1480058801, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27296304": {"recommendationid": "27296304", "author": {"steamid": "76561197995265619", "num_games_owned": 253, "num_reviews": 1, "playtime_forever": 389, "playtime_last_two_weeks": 0, "last_played": 1480016833}, "language": "english", "review": "Best investigative driven game i can remember playing.\nGood replay value.\nGood atmosphere\n", "timestamp_created": 1480016810, "timestamp_updated": 1480016810, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "27176816": {"recommendationid": "27176816", "author": {"steamid": "76561198084341590", "num_games_owned": 426, "num_reviews": 16, "playtime_forever": 1362, "playtime_last_two_weeks": 0, "last_played": 1498247237}, "language": "english", "review": "yatheeze, lovecrathian horrors... yee", "timestamp_created": 1479996608, "timestamp_updated": 1479996608, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26999491": {"recommendationid": "26999491", "author": {"steamid": "76561198035358905", "num_games_owned": 297, "num_reviews": 3, "playtime_forever": 527, "playtime_last_two_weeks": 0, "last_played": 1480324641}, "language": "english", "review": "A unique and easily missed gem.", "timestamp_created": 1479956381, "timestamp_updated": 1479956381, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26844408": {"recommendationid": "26844408", "author": {"steamid": "76561198055422951", "num_games_owned": 154, "num_reviews": 5, "playtime_forever": 1292, "playtime_last_two_weeks": 0, "last_played": 1496368898}, "language": "english", "review": "An absolute must-buy for fans of cosmic horror, roguelikes, or both alike.\nThis game has you investigating various cults trying to summon an ancient god into the world, while you are given only 60 hours to stop them. To this end you have to travel all around the countryside investigating infected towns, searching for clues, and doing everything in your power to hinder the approaching shadow. There are four different playable characters all who have unique starting abilities and playstyles that alter the way you play the game, perceive different threats, and go about your investigations.\nThe game is heavily linked to the Chzo Mythos series, and is a good place to start if you are interested in the games or want to immerse yourself in a new eldritch horror series. If you're a returning fan, there are a lot of allusions and nods to the previous games that are sure to satisfy you.\nAt only 10 dollars, I've gotten plenty of hours of enjoyment out of the game, and I highly recommend picking it up if any of the above points interest you.", "timestamp_created": 1479931450, "timestamp_updated": 1479931450, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "26781816": {"recommendationid": "26781816", "author": {"steamid": "76561198040919135", "num_games_owned": 502, "num_reviews": 175, "playtime_forever": 729, "playtime_last_two_weeks": 0, "last_played": 1477005676}, "language": "english", "review": "A challenging but well made Paranormal Investigator game, requires some grinding to get all the acheivments and endings and can get repetive but well worth the price tag.", "timestamp_created": 1479925914, "timestamp_updated": 1479925914, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25971165": {"recommendationid": "25971165", "author": {"steamid": "76561197971726726", "num_games_owned": 369, "num_reviews": 17, "playtime_forever": 474, "playtime_last_two_weeks": 0, "last_played": 1458838626}, "language": "spanish", "review": "This is a great game,dont be fooled for its poor grafics", "timestamp_created": 1476126745, "timestamp_updated": 1476126745, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25541394": {"recommendationid": "25541394", "author": {"steamid": "76561198047455977", "num_games_owned": 431, "num_reviews": 30, "playtime_forever": 2004, "playtime_last_two_weeks": 0, "last_played": 1501281309}, "language": "english", "review": "Very fun game with good writing and good atomsphere.  If you like survival horror and lovecraftian mythos, you'll really dig this.", "timestamp_created": 1474094213, "timestamp_updated": 1474094213, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25513069": {"recommendationid": "25513069", "author": {"steamid": "76561197981128738", "num_games_owned": 241, "num_reviews": 1, "playtime_forever": 564, "playtime_last_two_weeks": 0, "last_played": 1499198544}, "language": "german", "review": "Mit „The Consuming Shadow“ liefert Yahtzee, vor allem bekannt für „Zero Punctuation“, einen minimalistischen, aber handwerklich guten und atmosphärisch großartigen Horror-Roguelike-Titel ab.\n\nDer Titel setzt dabei lovecraftesken Horror, der durch die gute Geräuschkulisse, den guten Soundtrack und die hervorragenden (nur in englisch verfügbaren) Texte getragen wird. Die Grafik dagegen ist minimalistisch, aber stimmig.\nDas Gameplay besteht daraus, unter Zeitdruck Orte in Britannien abzufahren. Entweder man trifft unterwegs in interessanten Begegnungen Entscheidungen (deren Ergebnisse nicht immer gleich sind), füllt in sicheren Städten seine Vorräte auf oder betritt Dungeons in vom Schatten befallenen Gegenden, um die Runen für das jeden Durchgang variierende, nötige Bannritual und den zu verbannenden Gott zu recherchieren. Natürlich bekämpft man auch Monster mittels Pistole, Nahkampf und Magie und l00tet, was das Zeug hält. Es macht Spaß, die Schwachstellen einiger Gegner herauszufinden, aber das System an sich ist nicht sehr anspruchsvoll.\n\nSeit „Eternal Darkness“ gehört zu Horror à la Lovecraft in Spielen auch die Leiste mit geistiger Gesundheit dazu. Zauber schaden dem Verstand ebenso wie traumatische Erfahrungen in Begegnungen und Flucht vor Monstern. Wahnsinnig hat der Spieler nicht nur nette Halluzinationen, sondern muss auch dem Drang widerstehen, sich umzubringen: Entscheidungen werden in kurzen Intervallen durch Selbstmordkommandos ersetzt. Klickt man diese aus Versehen an, muss man in einem simplen, aber schwerer werdenden Quicktime-Event dagegen ankämpfen, sich erschießen zu wollen.\n\nNatürlich sieht man bei einem Roguelike nach dem ersten Durchgang (ca. 30 - 120min) nicht das beste der vielen Enden. Der Titel lebt von seiner Wiederspielbarkeit und fährt neben dem obligatorischen Auflevel-System einiges auf: freischaltbare Charaktere, Herausforderungsmodi, tägliche Herausforderungen, einen Endlosdungeon, verstreute Story-Schnipsel und ein Bestiarium.\n\nBereits in der offenen Beta hat mich der Titel immer wieder angefixt und in der fertigen Version ist \"The Consuming Shadow\" für Freunde atmosphärischer Roguelikes oder von Yahtzees \"Chzo-Mythos\" sein Geld auf jeden Fall wert.\n\n\nWer das Spiel mal in Aktion sehen möchte, findet auf Youtube zum einen ein von Yahtzee selbst kommentiertes Video, zum anderen habe ich mich selbst ein bisschen durch eine kurze Runde „The Consuming Shadow“ gel00tet. Ich zeige einen der freispielbaren Charaktere am Anfang, ansonsten habe ich mich darum bemüht, nicht zu viel zu verraten: [url=https://www.youtube.com/watch?v=pKe1cAjJS2c] ’N bisschen L00ten?: The Consuming Shadow [/url]", "timestamp_created": 1473954784, "timestamp_updated": 1474147860, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25470016": {"recommendationid": "25470016", "author": {"steamid": "76561198179933574", "num_games_owned": 191, "num_reviews": 14, "playtime_forever": 1353, "playtime_last_two_weeks": 0, "last_played": 1506025401}, "language": "english", "review": "FTL and Arkham Horror's lovechild. Can play as Mr \"Double kicks women because you thought they were a slenderman precursor\" Trilby. Gabriel gets a credit. ithurtsithurtsithurtsithurts", "timestamp_created": 1473627284, "timestamp_updated": 1473627284, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.500624", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25392649": {"recommendationid": "25392649", "author": {"steamid": "76561198154997988", "num_games_owned": 295, "num_reviews": 51, "playtime_forever": 121, "playtime_last_two_weeks": 0, "last_played": 1469789604}, "language": "english", "review": "Oregon Trail meets Binding of Isaac meets Cluedo in a Lovecrafian setting.", "timestamp_created": 1473234805, "timestamp_updated": 1473234805, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.510322", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25264150": {"recommendationid": "25264150", "author": {"steamid": "76561197992098037", "num_games_owned": 292, "num_reviews": 15, "playtime_forever": 1283, "playtime_last_two_weeks": 0, "last_played": 1486372629}, "language": "english", "review": "This is one of my favorite rouge-lites. Yes it looks like arse. Yes it controls a bit wonky. \n\nBut it has  a great theme, excellent (if rather purple) prose and a lot of replay value. The biggest asset however is the actual detective work. Finding clues and figuring out which ancient is the invader never fails to get old especially when time is short and clues a sparse.\n\nIf you can look past the awful", "timestamp_created": 1472629991, "timestamp_updated": 1472629991, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503106", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25113852": {"recommendationid": "25113852", "author": {"steamid": "76561198011571587", "num_games_owned": 315, "num_reviews": 35, "playtime_forever": 13, "playtime_last_two_weeks": 0, "last_played": 1472049685}, "language": "english", "review": "lovely game, reminds me of the good old times. goes to show that immersion has nothing to do with ultra graphics setting.", "timestamp_created": 1472049742, "timestamp_updated": 1472049742, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.492556", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25054529": {"recommendationid": "25054529", "author": {"steamid": "76561198026550834", "num_games_owned": 67, "num_reviews": 3, "playtime_forever": 1678, "playtime_last_two_weeks": 0, "last_played": 1508871246}, "language": "english", "review": "I love this game. It just really gets my heart racing every time I play. I love the inquisitve, logic-puzzle-y aspects of it, I actually really like the combat for as simple as it is, and I love the writing. My only real gripe with this is that I wish there was a separate page in the notebook to put down possibilites. If I find a yellow rune, I'd like to record it without putting it in my clue table and forgetting that those are only possibilities, not facts.", "timestamp_created": 1471791079, "timestamp_updated": 1476157007, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "25002567": {"recommendationid": "25002567", "author": {"steamid": "76561198046280501", "num_games_owned": 410, "num_reviews": 12, "playtime_forever": 1070, "playtime_last_two_weeks": 0, "last_played": 1491681942}, "language": "english", "review": "Shit graphic, repetetive random generated dungeons, worthless combat system and tons of \"imagine your own story\" elements.\n\nYou have to try it!", "timestamp_created": 1471565019, "timestamp_updated": 1471565019, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24921155": {"recommendationid": "24921155", "author": {"steamid": "76561198128414210", "num_games_owned": 464, "num_reviews": 2, "playtime_forever": 733, "playtime_last_two_weeks": 0, "last_played": 1475997219}, "language": "english", "review": "Brings back great memories from my childhood fave, organ trail, with my favorite lovecraftian mix thrown in, id recomend it", "timestamp_created": 1471211325, "timestamp_updated": 1471211325, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24831434": {"recommendationid": "24831434", "author": {"steamid": "76561198072430754", "num_games_owned": 63, "num_reviews": 7, "playtime_forever": 2532, "playtime_last_two_weeks": 0, "last_played": 1502136050}, "language": "english", "review": "Yahtzee of Zero Punctuation brings us this delightful game thats basically the show \"Supernatural\" but paranormal stuff replaced with delicous lovecraftian cosmic horror and replace Contiental U.S. with England. You are some schmuk that figured out a mystical evil prescense is invading our world and it will conquer it in 60 hours which seems a lot of time but its really not.You are aware that an evil God is invading but your not sure which 1 and how to banish the said beast from our world and all your armed with is a 9mm pistol. Also you can go insane and the effects from insanity go from minor annoyances to almost gamechanging annoyances (thankfully they don't last long) and sanity loss is practically permanent you can use heroine to make you more sane but its temporary and is less effective each time you use it. Theres gear to make you more efficient at killing the shadows minions.\n\ntl;dr\n\npros:\n     the time limit makes it a thrilling experiance\n     frantic combat (fits with the theme)\n     well written\n     YOU yes YOU have to figure out which god is invading (the game will let you fuck up) through deductions\n     Trilby's back from Yahtzee's adventure game series the chzo mythos.\n\ncons:\n     Yahtzee's not the best artist and it kinda shows\n      the insanity effects could be a lot more hindering of your investigation\n      descriptions of possessed towns repeats itself A LOT\n\nIm a sucker for cosmic horror themes and a fan of Yahtzee's other works so this was an instant buy for me, but the game is compelling beyound that for example if someone else made this instead of Yahtzee I'd have still be recomending this game with the same enthusiasm. If you are a fan of Yahtzee's work WHY HAVEN'T YOU BOUGHT THIS ALREADY!?!?! YOU CAN LITERALLY PLAY AS GABE AND BEAT UP CHZO! thats besides the point.\n\nIn conclusion:\n     worth a try if your interested in cosmic horror\n     Also has the most unique minigame ever mah dood.", "timestamp_created": 1470945122, "timestamp_updated": 1479951683, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24655593": {"recommendationid": "24655593", "author": {"steamid": "76561198025526230", "num_games_owned": 422, "num_reviews": 1, "playtime_forever": 502, "playtime_last_two_weeks": 0, "last_played": 1488550598}, "language": "english", "review": " AGN BTI EU KZ SHM", "timestamp_created": 1470072466, "timestamp_updated": 1470072466, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.500329", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24556561": {"recommendationid": "24556561", "author": {"steamid": "76561198306726154", "num_games_owned": 14, "num_reviews": 2, "playtime_forever": 96, "playtime_last_two_weeks": 0, "last_played": 1469563857}, "language": "english", "review": "this game reminds me of silent hill and in a way it is silent hill but with 2D graphics. it gets into the mind of the player, reminding them they are not safe at all times but if there is one thing to fault its the... the... I dont actually know, there are no faults in my opinion but I guess if you dont like randomized, punishing games it's not for you.", "timestamp_created": 1469629364, "timestamp_updated": 1469629364, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24415508": {"recommendationid": "24415508", "author": {"steamid": "76561198030903982", "num_games_owned": 188, "num_reviews": 4, "playtime_forever": 1352, "playtime_last_two_weeks": 0, "last_played": 1506880545}, "language": "english", "review": "YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING", "timestamp_created": 1468965328, "timestamp_updated": 1468965328, "voted_up": true, "votes_up": 5, "votes_funny": 4, "weighted_vote_score": "0.424708", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24307468": {"recommendationid": "24307468", "author": {"steamid": "76561197970622563", "num_games_owned": 263, "num_reviews": 3, "playtime_forever": 732, "playtime_last_two_weeks": 0, "last_played": 1506198916}, "language": "english", "review": "I thought this game was right up my alley. I like lovecraftian horror and FTL.\nBut I was so very very wrong. This game is just annoying. \nIt's a game of chance. You can do great but then the next dungeon just absolutely wrecks it and you have no chance to recover. FTL was more predictable and gave you more possibilities to stack the odds in your favor.\nAtmosphere and music are great but the descriptions tend to be overwritten and wordy.\nDefinitely regret my purchase.", "timestamp_created": 1468464804, "timestamp_updated": 1468464804, "voted_up": false, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.407105", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24243032": {"recommendationid": "24243032", "author": {"steamid": "76561198028575778", "num_games_owned": 166, "num_reviews": 4, "playtime_forever": 7, "playtime_last_two_weeks": 0, "last_played": 1454369700}, "language": "english", "review": "poor game", "timestamp_created": 1468195118, "timestamp_updated": 1468195118, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.191362", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24176446": {"recommendationid": "24176446", "author": {"steamid": "76561198009193170", "num_games_owned": 294, "num_reviews": 4, "playtime_forever": 424, "playtime_last_two_weeks": 0, "last_played": 1470676867}, "language": "english", "review": "Lukewarm recommendation, worth buying if it's on sale.\n\nI'm a long time fan of Yahtzee, both his videos and his games, and I know he can do better than this. The writing is uncharacteristically flat and straight forward, the art is thoughtfully stylized but Croshaw just doesn't have the skill to make it work as well as it should (why not hire an artist?).\n\nThe next problem is in the small amount of variation possible. FTL, which seems to be this game's main inspiration, provides much more variety and replayability. After 7 hours of play at the time of writing I feel I've got my money's worth, but I don't have any desire to go back to it. I've done less then ten runs, only got one of the major endings, unlocked two of five characters and only a fraction of the exhaustive achievements list, but I know when I replay I'm only going to see the same handful of scenarios I've already seen and the same extremely tiresome and repetitive dungeon design.\n\nThe RNG element is always a problem in these games, but this is worse than most. In FTL again you very occasionally get a bad draw but making it to sector 8 always feels like a struggle. In The Consuming Shadow you basically have a 50/50 chance to get screwed immediately or breeze to the end in less than an hour.\n\nAs it is, the Consuming Shadow is an okay way to sink a few hours, lots of glitches and rough around the edges but perfectly servicable. What's disappointing is that this is a shadow of what could have become a genuinely fantastic game, with more time in development and more people behind it.\n\nRating: 3/5", "timestamp_created": 1467964188, "timestamp_updated": 1470008898, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.544818", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24145621": {"recommendationid": "24145621", "author": {"steamid": "76561198073243199", "num_games_owned": 47, "num_reviews": 6, "playtime_forever": 372, "playtime_last_two_weeks": 0, "last_played": 1480124419}, "language": "english", "review": "Big fan of Yahtzee's work, brought to Consuming Shadow and his \"Chzo Mythos\" generally though his youtube series LPing games he's made.\n\nVery effective survival-horror, since it horrifies me as I try desperately to survive. Rogue-likey malarkey, no two playthroughs the same et cetera et cetera. Frustrating when you screw up or fail, motivating you to do better next time. Character unlocks and progression - always stuff to work towards, some funny achievement-hunting to be had as well.\nNew characters have substantially different gameplay feels with significant differences to the overall game and combat mechanics, requiring different tactics each time.\n\nTense, rewarding combat - easy to learn, middling difficulty to master. Ammunition scarcity forces you to choose between using your few bullets to defeat the monsters you face, or blat them in the face like the madman you will become.\n\nI spent like 12 hours over the weekend playing offline which doesn't show up in my record for some reason.\nFinally motivated to buy it when it dropped to half price in the Steam Summer Sale.", "timestamp_created": 1467847200, "timestamp_updated": 1467847200, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24097629": {"recommendationid": "24097629", "author": {"steamid": "76561198110543881", "num_games_owned": 136, "num_reviews": 3, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1468770077}, "language": "english", "review": "10/10 would feel like I've shat my pants again", "timestamp_created": 1467680922, "timestamp_updated": 1467680922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "24022319": {"recommendationid": "24022319", "author": {"steamid": "76561197991307641", "num_games_owned": 172, "num_reviews": 17, "playtime_forever": 222, "playtime_last_two_weeks": 0, "last_played": 1467488639}, "language": "english", "review": "Enjoyed the game", "timestamp_created": 1467480074, "timestamp_updated": 1467480074, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.472855", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23924803": {"recommendationid": "23924803", "author": {"steamid": "76561198007142965", "num_games_owned": 350, "num_reviews": 57, "playtime_forever": 1155, "playtime_last_two_weeks": 0, "last_played": 1467483062}, "language": "english", "review": "A fairly recent horror game without jump scares? How can this be?!\n\nThe Consuming Shadow is a fine blend of Lovecraftian horror, a handful random events (Hello, FTL fans!) and a rune system inspired by Eternal Darkness.\n\nYou start as a meagerly equipped scholar working for The Ministry of Occultism and it's your duty to learn about the evil ancient that is about to to invade our realm, hopefully banishing it in the process. There is no shame in failing though as there are plenty of dimensions to hone your demon fighting abilities. The choice is yours: will you be the mindless to-death-clubber, the cunning intellectual who turns the dark magick (Yes, the serious ck kind of magick!) against its creators or will the game force you to take choices against your will?\n\nStay sane and try not to die in vain!", "timestamp_created": 1467207410, "timestamp_updated": 1467207739, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23897962": {"recommendationid": "23897962", "author": {"steamid": "76561198072984208", "num_games_owned": 281, "num_reviews": 20, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1495647859}, "language": "english", "review": "The Consuming Shadow is a post Brexit England simulator where you play one of four people trying to stop the invading army (Which is obviously an allegory for the migrant crisis) from taking over the UK. Man, Yahtzee was way ahead of his time with the plot on this one.\nOn a side note, never trust Chzo.\nIn all seriousness, a very fun game to play, would reccomend. The rouge like elements are fun and the mystery aspect plays like Clue on steroids.", "timestamp_created": 1467131255, "timestamp_updated": 1467139758, "voted_up": true, "votes_up": 6, "votes_funny": 18, "weighted_vote_score": "0.543710", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23842963": {"recommendationid": "23842963", "author": {"steamid": "76561198027698290", "num_games_owned": 75, "num_reviews": 5, "playtime_forever": 279, "playtime_last_two_weeks": 0, "last_played": 1466971814}, "language": "english", "review": "[i]>1 SAN left[/i]\n[i]>freak out and get an urge to kill myself[/i]\n[i]>manage to fight it off[/i]\n[i]>[GAINED SANITY][/i]\n\n10/10 would try killing myself again to save my mind\n\n\n[i]The Consuming Shadow[/i] is a very minimalistic, Lovecraftian survival horror-adventure with randomized elements (no, not roguelike elements). An Old One and his m8 are about to enact Dark Souls PvP in real life by invading our planet and realm while another Old One gets salty at them. Are you a bad enough dude to battle unspeakable abominations and save humanity?\n\n[b]GOOD STUFF[/b]\n[list]\n[*][u]Neat investigation system[/u]: A little chart helps you track down various properties of the 3 Old Ones such as their name, colour and rune. Not only can you fill this up by finding notes that give you direct details, but you can also make educated guesses by, for example, observing the various runes you find in \"dungeons\", or even certain enemies. This detective work is much better than some similar examples that have been provided in high profile games, such as in the second game of a very popular RPG series about an old guy that hunts monsters.\n[*][u]Survival[/u]: Your resources, whether they are bullets, drugs or money, are actually quite limited on average. Advancing in a straight line, liberating towns tainted by the Old Ones' corruption and laying the smackdown to the big guy himself and getting back home in time for breakfast is a fantasy. Often you'll have to backtrack or sidetrack, trying to scavenge or buy new resources or equipment even if it's just to increase your odds of survival a little bit. Sometimes you might even be forced to let towns fall to the Shadow, or abandon a quest to save your life. Money can buy you weapons and health, but not sanity. And between unexpected encounters in dungeons or on the road, you may lose more of these than you expected. Planning ahead and not taking chances blindly is an important part of the game.\n[*][u]Horror[/u]: \"Return of the Old Ones\" kind of stories are overdone, yet in games they remain a good blueprint to use provided you can surprise the player from time to time. Thankfully there are some surprises here! Also while the game itself is actually not what I would call scary, it has very nice atmosphere and certain dungeon events manage to instill tension. The creatures encountered in the game are all suitably grotesque in appearance and sound, and there are quite a few of them to encounter over multiple playthroughs. Diary entries for each of them are available, the more you... spend time with them the more text you unlock in the entries. As customary in many Lovecraftian games, sanity loss induces hallucinations, loss of control or an urge to blow one's brains out. The latter is especially amusing as a low-sanity character's menu choices can suddenly turn into \"Kill myself\" and the player will have to stop his character from doing it. Also, the music and sounds are really nice as well.\n[*][u]Randomization and persistence[/u]: Each new game has of course 3 different Old Ones with differing characteristics, but also different cities that are already corrupted or that are safe, as well as different incantations for spells. In every playthrough you will also encounter randomized events while on the road and receive random quests. As stated above there are bestiary entries to fill out, as well as a the 30-something pages of the diary of a certain character to find. There are actually 2 more characters to unlock, and each of these gain levels as you succeed or fail your games. Leveling up enables you to assign a number of 'birth stars' that give you all kinds of bonuses, using charts that also change with each new game. There are a number of different endings to get. Last, there are challenge modes to unlock for each character as well as an infinite dungeon mode. These are add quite a bit of replayability to the game.\n[/list]\n\n[b]OK STUFF[/b]\n[list]\n[*][u]Combat[/u]: The game is played with KBM, and your characters have guns, but you can't aim them. Most of the time the auto-aim mechanics are fine, but sometimes it makes you waste your precious bullets for nothing. Pistol whipping enemies works fine, but perhaps there could be more animations when hitting enemies above or below your waist line.\n[*][u]Sanity gain and loss[/u]: Sanity is very fragile in this game, as it should be. However, it doesn't always get depleted in a logical manner, and recovering it is completely up to chance (unless you want to use DRUGS...) For example even leaving a room where an enemy is present reduces your sanity quite a bit, but doing things like killing a lot of monsters, dispelling magic, saving and helping civilians and the like does nothing to restore it. At least for sanity loss upon escaping there could be a condition such as not losing any sanity if you were in the room for less than 2 seconds. Or recovering a couple points upon successful dungeon completion. As it stands the most reliable way to gain some sanity is clicking the 'kill myself' button and not killing youself.\n[*][u]Art style[/u]: The super-simple graphics work really well for the game, but it's no [i]INFRA ARCANA[/i] (a game you must play if the combination of Lovecraftian horror, true roguelike mechanics and horrible difficulty sounds appealing) when it comes to its presentation.\n[*][u]Inventory[/u]: Your resources are limited in general, but they're a little artificially limited. For example your briefcase can hold tons of items like body armor and gas mask, but not more than one magazine for one bullet type for your pistol, and your car apparently doesn't have enough space for more than one medkit. Maybe a more realistic way of dealing with these could be found.\n[/list]\n\n[b]BAD STUFF[/b]\n[list]\n[*][u]Lore[/u]: Too little lore is uncovered within a session. Even when the identities of the Old Ones are uncovered, nothing substantial about them is known (at best you get some notes talking about spooky children's rhymes or elementals of ancient myths). Somehow making this deeper would have been good.\n[*][u]Binary choices[/u]: Too often random events present you choices that are too simplistic. For example, if you encounter a man that seems to be either possessed or in the throes of an illness, your options are to help him or to wait and see. Now in reality faced with such a situation you can choose the latter option and wait a little while to see if anything changes, but in the game choosing that option will make your character turn stone cold and just stare at the person until he dies (if that's the event you stumbled upon of course). Too often the choices in random events equate simply to coin flips. There is no reason why something like diving into a house on fire to look for a survivor has the same probability of a bad outcome as an event like described above, where you are in control.\n[*][u]Writing[/u]: Writing errors pop up now and then. Ben pls.\n[/list]\n\nAll in all, this is a very neat little horror game. It's fun to play, with progression that feels satisfying and fair difficulty. I definitely recommend.", "timestamp_created": 1466977697, "timestamp_updated": 1466978081, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23684115": {"recommendationid": "23684115", "author": {"steamid": "76561198041100695", "num_games_owned": 289, "num_reviews": 30, "playtime_forever": 80, "playtime_last_two_weeks": 0, "last_played": 1466143193}, "language": "english", "review": "Positives:\n\n>The game is gives of a scary ominous feeling that scared the heck out of me for a while.\n>Rogue-like mechanics to help you on additional playthoughs\n-Such as the Birthstars and the Random Encounters on the road \n-With rogue-like features comes replayability\n>Unlock a couple of different characters that have different playstyles\n>Something for the 100%'rs to fill a file bit-by-bit on monsters everytime you encounter them (like what Yahtzee said) \n>A nice \"fill your own\" table in the game to match clues and information about the gods\n>Can be unforgiving at times\n>Additional challenge modes that provide an interesting way to play the game in a couple of different ways\n>Constant time that makes you juggle between choosing destinations wisely and clearing a dungeon quickly\n>The author plays his own game and shows how brutal it can be\n\nNegatives:\n\nYahtzee is known to focus on gameplay and story over graphics and visual, this doesn't really bother me because to me a game is about its gameplay first and visuals second\n>But some aren't willing to look past the old flash-like graphics\n>A bit clunky controls when switching equipment and selection objects when in the car\n\nVerdict:\n4.5/5 Stars, ya gotta get this game. Its worth it!!", "timestamp_created": 1466508507, "timestamp_updated": 1466508507, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.515882", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23548642": {"recommendationid": "23548642", "author": {"steamid": "76561198062095328", "num_games_owned": 41, "num_reviews": 6, "playtime_forever": 478, "playtime_last_two_weeks": 0, "last_played": 1478791990}, "language": "czech", "review": "The Consuming Shadow is a GREAT game.\nIm amazed by just how its possible to create such a good roguelike game in Game Maker.\n\nI salute you \nGREAT WORK", "timestamp_created": 1465890764, "timestamp_updated": 1465890764, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23531450": {"recommendationid": "23531450", "author": {"steamid": "76561198027406332", "num_games_owned": 322, "num_reviews": 24, "playtime_forever": 1752, "playtime_last_two_weeks": 0, "last_played": 1507610765}, "language": "english", "review": "yes. lots of replayability. you will fail at first, but playing through again makes you stronger", "timestamp_created": 1465791878, "timestamp_updated": 1465791878, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23446642": {"recommendationid": "23446642", "author": {"steamid": "76561198143340867", "num_games_owned": 223, "num_reviews": 2, "playtime_forever": 294, "playtime_last_two_weeks": 0, "last_played": 1469492273}, "language": "english", "review": "I know this ooks like a standard terrible flash game, but this is genuinely terrifying. Its not jump scares or freaking out in VR, it's that tingling down your spine feeling that causes me to take breaks between failed runs while my heart races and I take deep breaths. BUY THIS NOW", "timestamp_created": 1465360789, "timestamp_updated": 1465360789, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.671870", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "23429009": {"recommendationid": "23429009", "author": {"steamid": "76561198008376282", "num_games_owned": 739, "num_reviews": 32, "playtime_forever": 2442, "playtime_last_two_weeks": 0, "last_played": 1488711634}, "language": "english", "review": "only issue is some keys have double uses causing people to waste ammo, lock picks and whatnot. asside from that the game is activly trying to make you blow your brains out so it gets a + from me.", "timestamp_created": 1465270885, "timestamp_updated": 1465270885, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "4.955446", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22597860": {"recommendationid": "22597860", "author": {"steamid": "76561198091220285", "num_games_owned": 129, "num_reviews": 6, "playtime_forever": 1347, "playtime_last_two_weeks": 0, "last_played": 1496799410}, "language": "english", "review": "With a simple idea in the back of my head, I bought this game because there was something to it that felt so well done. The graphics aren't something you'd find in your average horror game, but you will NEVER find a chilling sense of isolation as a lone hero. When I played this game, I got drawn into the idea of saving a dead world. As I drove from town to town in my car I loved bouncing around in my head what I had gathered toward the mystery so far and what my next plan was. While the horror in this game is not something that will give you terrors at night, the first time you crawl into a dungeon will be an experience, and if you want something immersive, this is what you want.", "timestamp_created": 1461449663, "timestamp_updated": 1461449663, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.500898", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22513906": {"recommendationid": "22513906", "author": {"steamid": "76561197993021470", "num_games_owned": 395, "num_reviews": 102, "playtime_forever": 1093, "playtime_last_two_weeks": 0, "last_played": 1464675557}, "language": "english", "review": "The Consuming Shadow strives to place the player into the role of a Lovecraftian investigator, with all the corresponding frustrations: combat is harsh and unrewarding, random encounters come with totally uncontrollable outcomes, and encounters with new enemies are often lethally unpredictable. The ubiquitous flavourful walls of text generally bear little significance to the mechanical details of the situation, although in spite of this the game’s deductive mystery element is perhaps my favourite feature – aside from the woefully underused simon-says style magic system.", "timestamp_created": 1461064435, "timestamp_updated": 1461064435, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503891", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22431545": {"recommendationid": "22431545", "author": {"steamid": "76561197997864396", "num_games_owned": 708, "num_reviews": 22, "playtime_forever": 635, "playtime_last_two_weeks": 0, "last_played": 1484236894}, "language": "english", "review": "Wow. Again I find myself frightened by the work of an internet comedian/writer. I've rarely played a game with the level of tension as this; driving frantically from town to town trying to find the last word for the banishing spell with only a few hours left, no bullets, and dwindling sanity ... it's an experience worthy of any horror fan. Special kudos for the soundtrack as well, as it leaves you feeling tense the whole way through.", "timestamp_created": 1460737892, "timestamp_updated": 1460737892, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22430230": {"recommendationid": "22430230", "author": {"steamid": "76561198014660882", "num_games_owned": 489, "num_reviews": 13, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1460727555}, "language": "english", "review": "I like Ben Croshaw and his body of work about as much as any reasonable person can. I don't always agree with his reviews or his style, but he has cheeky charm and a sense of old-school fun that I've come to enjoy. Mogworld was lovely and rather clever. Zero Punctuation is hilarious and often insightful. This game, however, is disappointing.\n\nTL;DR: There are better roguelikes and better Lovecraftian games for around the same price point. I would struggle to recommend this game even if it were on sale.\n\nThe Consuming Shadow succeeds in two areas: difficulty and a cursory sense of novelistic credibility. I admit, Croshaw definitely pays proper dues to Howard Phillips Lovecraft. I admire his attempt at crafting a \"literary\" roguelike. Yahtzee definitely TRIED to capture the atmosphere of cosmic horror, and he occasionally succeeds with a taut line now and again. On the other hand, despite the \"back-of-the-box\" claim that there are \"countless random encounters,\" there is little variety in the type of random events or in their textual prefacing. As of ~2 hours playtime, I have seen repetition of at least 3 of these random encounters (the hysterical woman on the side of the road, the businessman with a locked car, and the rescue of a person captured by cultists-- hilariously enough, the first time I shot the captive by accident, but the second time I was ready! Thanks, lazy programming!). \n\nLiterary though it may be, it fails to be genuinely interesting. Yes, Ben, you wrote some punchy sentences that, when jammed together according to certain scripts, make discernable paragraphs. None of these \"Mad Libs: Eldritch Edition\" entries are special nor particularly good. After trying very hard to enjoy the writing for some time, I began to skip virtually all of the text. It has made no difference in gameplay.\n\nLook, if you want to make a literary game, make the literature of the game important. I chuckled the first time I read \"I found a black market dealer willing to sell me goods,\" and the fellow was selling hollowpoint ammunition and SKATEBOARD PADS. I know I'm not supposed to take it entirely seriously, but narrative consistency from a published author shouldn't be a tall order.\n\nThe game succeeds in being difficult, although not often for the right reasons. Because of the two-dimensional viewpoint, some overlapping enemies will be completely obscured at the outset of combat. Sanity loss is expressed in hallucinations and control manipulation (left is right and right is left, sometimes your character disappears, etc.) This is fun in an old-school way but is poorly executed and unbalanced. Lost ~20% of your sanity? You may end up accidentally killing yourself when the game starts flashing a suicide option over your medkit button. No, I'm not complaining that this happens, I'm frustrated that this happens with so much sanity remaining. It doesn't make sense. Hit detection is poor, and it is impossible to manually aim. On several occasions, I was staring down two or three foes and found myself unable to aim at the most dangerous, difficult-to-avoid enemy. A simple targeting option? Strangely absent.\n\nThe Consuming Shadow clearly capitalizes on the replay value associated with roguelikes, but unfortunately it doesn't provide enough variety to make it worthwhile. What are you to expect from adding handicaps from the various challenges offered? More of the same. Even as I progressed, gaining more customization options with birthsigns, for instance, (options which give the player various stat bonuses) I never felt as if I were enjoying the game more nor that the options available genuinely added to my experience. It felt lazy, just as many roguelikes feel lazy. It seems that with many indie devs, if you can't write a good story or design a good level, you make a roguelike. \n\nAdditonal notes:\n\n-Achievements are basically broken: I have received achievements for collecting all diary pages (which I haven't), rescuing 20 unbrainwashed humans (haven't done that either) and completing 50 dungeons (definitely have not done that). \n\n-Even if you can hear and partially see an enemy, if you fire from too great a distance, your shot will be wasted. It is still unclear to me why a targeting system is unavailable.\n\n-All of the encounters are either a) fetch quests b) rescue quests or c) kill quests. All of the rooms in the game are roughly the same size, and all of the locations have the same meager handful of elements to work from. Outdoor environments have leafy walls instead of plaster ones, for instance.\n\nI cannot recommend this game despite wanting to love it. I have played many roguelikes, and this is by far the most disappointing. \n\nEdit: I am extremely grateful to Steam for granting my refund in spite of my 2.1 hours of playtime, the latter 20 minutes or so which I accrued by preparing for this review.", "timestamp_created": 1460733893, "timestamp_updated": 1461470898, "voted_up": false, "votes_up": 24, "votes_funny": -1, "weighted_vote_score": "0.544249", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "22031888": {"recommendationid": "22031888", "author": {"steamid": "76561197970230150", "num_games_owned": 823, "num_reviews": 7, "playtime_forever": 535, "playtime_last_two_weeks": 0, "last_played": 1498720251}, "language": "english", "review": "The Consuming Shadow is an interesting, and I think mostly successful, take on the roguelike, sidescroller and adventure genres. \n\nThe random nature of the mystery gives it replayability, as you can never know which elder god you're facing without knowing most of the clues and taking educated guesses. The exploration and sidescrolling parts of the game are very simple, though, and I can see it becoming monotonous since you're always facing the same enemies with the same abilities in environments with very little to distinguish between them. Some variety would improve the game, as every room looks pretty much the same as every other room and every highway looks the same as another highway. The sanity mechanic is done well; the encroaching static and the disturbing flashes of things you see when you're driving with low sanity add to the oppressive mood. \n\nI wouldn't say it's a scary game like Silent Hill or Fatal Frame, but there are surprises aplenty and the backstory is well-written and suitably Lovecraftian. I bought the game on sale and I'd say it was worth the time I've spent on it already", "timestamp_created": 1458860485, "timestamp_updated": 1458860485, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21879000": {"recommendationid": "21879000", "author": {"steamid": "76561198286727684", "num_games_owned": 50, "num_reviews": 1, "playtime_forever": 937, "playtime_last_two_weeks": 0, "last_played": 1496500044}, "language": "english", "review": "Its a game whre you can easily lose many times, yet keep on going to see if you can actually go and do it right just once. Then maybe, just maybe, you'll feel respected.", "timestamp_created": 1458175946, "timestamp_updated": 1458175946, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21763952": {"recommendationid": "21763952", "author": {"steamid": "76561198284268956", "num_games_owned": 338, "num_reviews": 7, "playtime_forever": 632, "playtime_last_two_weeks": 0, "last_played": 1505564132}, "language": "english", "review": "While I'm not a fan of the auto-aim system, where you're trying to hit the bastard ghost trying to kill you and instead you swat a fly, I'm really in love with this game.\nGraphics are 'mediocre', but very atmospheric.\nWriting's amazing.\nMusic's beautiful, even if it starts to get a bit samey over time.\nThe game's easy when you know what you're doing (banishing the big bad with over 20 hours to spare isn't hard if the RNG isn't actively hating you), but Challenge Mode will make sure you NEVER know what you're doing, which is perfect for players wanting a challenge.\nThe research 'minigame' is at times brainracking, and always very fun. That moment between casting the banishment ritual using the clues you'd gathered and the boss fight (or the lack thereof) is always incredibly tense, and it's euphoric being proven right (though this lessens with each playthrough). Sadly, none of the challenges do anything to try to make this aspect of the game harder - I'd love a mode where I had to decipher who the baddie was with the knowledge that there were FOUR gods in this fustercluck.\nThe game REALLY comes alive when you're close to losing (though this is true of everything, I think). When you're low on health and running away from a hunter, when you've got two minutes on the clock, are in stonehenge and have only half a banishment ritual, etc.\nOne extremely minor quibble I have (disregarding the first one) is that you can't just skip the astrology section once you've got birth stars. You HAVE to look for an empty space and choose it if you don't want any bonuses ruining your playthrough.\nIf I might suggest extra features, perhaps a hard mode where each astrology bonus comes with a penalty as well, or something - like, if you want +25 health, you have to take -25 sanity, or raising your medkit capacity means lowering your ammo-count, or something randomized.\n\nIf you want the game insultingly easy, and you've got some birth stars to spare, GET EXTRA AMMUNITION. Health and sanity are all well and good, but if you've got a tonne of ammo, you won't need to take hits to health or sanity at all. Once you maximize ammo capacity, you really only have to worry about your route and the clues - the game's extremely liberal with handing out ammo. \nAlternatively, increase Melee and keep ammo for bosses. (Almost) Every single minor enemy can easily be beaten through pistol-whipping, so just keep doing that and learn each enemy's pattern.", "timestamp_created": 1457696975, "timestamp_updated": 1457696975, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.456185", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21515505": {"recommendationid": "21515505", "author": {"steamid": "76561197991306990", "num_games_owned": 162, "num_reviews": 14, "playtime_forever": 365, "playtime_last_two_weeks": 0, "last_played": 1456721115}, "language": "english", "review": "Here are the drawbacks of this game:\n- Clunky combat controls\n- Somewhat unintuitive interface, could've been streamlined a little better\n- The prose, while well written, gets repetitive in subsequent playthroughs\n- A few loopholes can be exploited to break the game\n\nNotice how I didn't mention the graphics?  That's right, because the graphics fit the game perfectly.  The minimalist silhouettes twitching eerily across a miasma of oppressive darkness and seething fog combine perfectly with tritone-soaked sound design to create an atmosphere that really fires up the ol' imagination.  It's not pants-wetting terrifying, but that's not the point; the game manages to capture, in a very low-tech way, the dreadful feel of a Lovecraftian universe while somehow also pulling off interesting and addictive gameplay that evokes that \"one...more...turn...\" feel.  It's a genuinely unique, almost board-game like experience that I found to be very fun and will most certainly play again and again.\n\nIf you're on the fence because of the graphics, just hop off of it and give this game a try.  However, if you just can't get over the fact that the graphics aren't triple A quality, then you should STILL gave this game a try.  If you STILL can't get over the fact that the graphics aren't triple A quality, then I highly recommend that you stop playing computer games and watching movies/television, go buy a book (not an e-reader, a real book with real paper), read it and learn how to use that beautiful imagination of yours again.", "timestamp_created": 1456633678, "timestamp_updated": 1456633678, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499970", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21509167": {"recommendationid": "21509167", "author": {"steamid": "76561198040396340", "num_games_owned": 153, "num_reviews": 10, "playtime_forever": 1775, "playtime_last_two_weeks": 0, "last_played": 1512155656}, "language": "english", "review": "You'll get over the pixel art fast. Trust me. It's wildly addictive. The writing is fun and sets the tone well. There's this constant sense that everything is working against you. The dungeons are some of the most tense I've gone through in a game for quite a while. You'll learn to dread even the smallest monster for the entire game because every point in health/sanity counts. The problem is that once you've unlocked all the characters and gone through all the endings, there isn't much outside of a somewhat lacking 100% completion, and trying to unlock it all is pretty samey. Though to be fair, the diary pages are pretty cool, and worth getting and reading all of them. The challenges definitely help, but they may not be enough for you. The upside to that, however, is that it took me a damn long time to get to that point. It's well designed - especially for a solo project - and you'll get more than your money's worth.", "timestamp_created": 1456609277, "timestamp_updated": 1456609277, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500884", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21324724": {"recommendationid": "21324724", "author": {"steamid": "76561198025113393", "num_games_owned": 121, "num_reviews": 9, "playtime_forever": 752, "playtime_last_two_weeks": 0, "last_played": 1483678219}, "language": "english", "review": "With a mere four minutes until the country, nay THE WORLD,  is engulfed by Shadow I charged perilously into Stonehenge. I infiltrated the vile tomb, dodging gibbering monstrosities and crawling creatures who tried in vain to keep me from the inner sanctum of the sacred facility. Armed with an incantation, completed using iron-clad inductive reasoning, the sum of the clues I had uncovered, I stepped forth to put an end to this invasion! Unfortunately, I had banished the wrong God. Ashamed, as I'm sure you too would have been, I figured a quick gunshot to the head would be preferable to having my mind snapped by a multi-eyed monstrosity from beyond the veil of time and space.\n\n3nfur#lfh@erw%h9/10 - Would doom the planet and kill myself again", "timestamp_created": 1455913515, "timestamp_updated": 1455913515, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.499637", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21318913": {"recommendationid": "21318913", "author": {"steamid": "76561198048556706", "num_games_owned": 204, "num_reviews": 33, "playtime_forever": 1394, "playtime_last_two_weeks": 0, "last_played": 1480310608}, "language": "english", "review": "Spawned from the corners of a twisted, sarcastic and incredibly british man, The Consuming Shadow is best described as a detective-horror game with Cthulhian (Cthulian?) inspired mythos. Bit difficult to fully describe, to be honest, as there's a clash of game types going on here, but we have two major gameplay elements going through. Well, three technically, but there's some intermingling.\n\nFirstly, you begin the game as one of the four playable characters (the other three being unlocked over the course of playtime and challenges) with the goal of stopping a nebulous, eldritch god from invading the world and unleashing unspeakable horrors upon the people. To do this, you have your car and notebook; the first used (rather obviously) to drive around the English countryside, hitting town after town, with the intent of gathering information. Any information you find is added to your notebook, for you to peruse at your pleasure and have your own little wall of crazy to find out who the invading god is so you can adequately fight them.\n\nThe usual way you find clues and information is through the second game mode, which are a Dungeon-like environment. In these Dungeons, you'll fight against enemies spawned by the invading god, monsters and twisted horrors normally, though average folk make their appearances. The combat mechanics are extremely simple: A gun for ranged combat with three ammo types (Standard 9mm, Hollowpoint, Armour Piercing), the ability to pistol whip, and the ability to cast spells for various effects.\n\nStats in the game are also extremely simple: you get Health and Sanity, both obvious in and of themselves, although Sanity is a subtle nuisance that slowly grows bothersome throughout the game. Health is reduced by taking damage, while Sanity is reduced slightly by being damaged by monsters, by encountering terrifying or disturbing events, or by casting spells of the shadow. Effects of low sanity range from illusory monsters to dungeon doors and areas shifting, quite varied. The most dangerous mechanic, however, is in the overworld, where when you have an event or choice to make (such as in towns or when someone flags down your car), the choices may occasionally start shaking and change to \"Kill Myself\". Yes there's a suicide minigame, and if you fail it you die. Really encourages you to be paranoid and careful, which is what you would be when fighting eldritch horrors from another dimension.\n\nThe game's simplicity allows it to become complex through multiple playthroughs. The clues pile up after a while, and sorting through six pages of the blasted things, some of which are telling you the same information differently, becomes a logic puzzle on its own. So we know that Gnix is NOT the invading god, and the purple god hates the god of Fear, and the god of lust is identified by the EU rune, while the red god is the god of fear, that means Gnix is the purple god-wait, no, because the god identified by the EU rune is a friend of Gnix, or...\n\nIt gets confusing. And I like that.\n\nThe entire theme the game's going for is \"Darkness there and nothing more.\" You're fighting against something that, even when you see it, is nebulous and strange and unusual, and you can't quite put your finger on what it is, you just know it's wrong. It's a well made game, with an average play time of 20-30 minutes per run, and rather enjoyable. For 10$ it's very much worth the price.", "timestamp_created": 1455894447, "timestamp_updated": 1455894447, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499970", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21316532": {"recommendationid": "21316532", "author": {"steamid": "76561197964237640", "num_games_owned": 531, "num_reviews": 8, "playtime_forever": 881, "playtime_last_two_weeks": 0, "last_played": 1494558301}, "language": "english", "review": "A bit over-priced for what it is but worth a buy if you want something a bit different.\n\nInteresting take on Rogue-likes and an overall interesting Game, I hope someone uses the concept in an FPS as it'd make an interesting Shooter.", "timestamp_created": 1455885954, "timestamp_updated": 1455885954, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503343", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21246184": {"recommendationid": "21246184", "author": {"steamid": "76561197998475352", "num_games_owned": 599, "num_reviews": 8, "playtime_forever": 1000, "playtime_last_two_weeks": 0, "last_played": 1501225784}, "language": "english", "review": "This game. It has all the things that rouge-lites should have. Few are equal. It's fun even when its beating you. Hell, the creator even has a let's play he did with a friend on the store page. You clearly see what kind of game it is before even buying it. I swear to god you will never see a AAA title do the same. Combat is all about timing, You can go through a whole dungeon and not get hurt when you master the timing. You learn how much of a luxury your precious six bullets are very quickly if you think the gun is meant to be your primary means of offense, and people bitching about the diffculty do so because they think you can just power through it. You can't. You learn quickly that sometimes it is better to just run. Retreat is a valid tactic as the insanity effects are more then managable and serve to make the game even creepier. The game has a lovely Lovecraftian feel to it without having H.P.'s bizzarre racist overtones (not a joke- old H.P. was really fucking racist).\n\nAll in all, good game for the price and something that you will enjoy if you're not some dickweed who thinks games should hold their hand. It's nice to see the indie market has games that actually require you to learn how to play them.", "timestamp_created": 1455601156, "timestamp_updated": 1455601156, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499970", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21099322": {"recommendationid": "21099322", "author": {"steamid": "76561197969865290", "num_games_owned": 233, "num_reviews": 29, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1455407879}, "language": "english", "review": "The graphics and presentation are primitive, the combat (which is kindof a big part of the game) is pretty clunky.\nBut it's very cleverly put together and easy to lose yourself in it for a bit.\nEnjoyable and definitely worth a go if you're fond of unsettling scenarios.", "timestamp_created": 1455102546, "timestamp_updated": 1455102546, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.499970", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21051572": {"recommendationid": "21051572", "author": {"steamid": "76561198058178203", "num_games_owned": 144, "num_reviews": 9, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1457136847}, "language": "english", "review": ">low health\n>no sanity\n>bleeding\n>broken leg\n>2 hours until the end of the world\n>driving down the street\n>chances of survival look bleek\n>all hope lost\n>gets text message\n>\"You didn't think I'd forget your birthday did you? Here's 5 pounds.\"\n\n10/10 best birthday ever", "timestamp_created": 1454938435, "timestamp_updated": 1454938435, "voted_up": true, "votes_up": 7, "votes_funny": 18, "weighted_vote_score": "0.505644", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "21003514": {"recommendationid": "21003514", "author": {"steamid": "76561198108046049", "num_games_owned": 259, "num_reviews": 14, "playtime_forever": 1759, "playtime_last_two_weeks": 0, "last_played": 1507590857}, "language": "english", "review": "Wow, great game, honestly. I haven't even unlocked the last character yet, and I'm not even close to ending the game properly with all the other characters. The game has a lot of content, you see. I've been a fan of Yahtzee's for a while now, enjoying his earlier works, as well as the various series he does on youtube these days, so it comes as little surprise to me that he hits it out of the ball park with this one. The randomly generated nature of the game makes it different every time, and I've only ever once ran into an error with two assets not going together well and forcing me to restart the game. The writing, and  the themes of Lovecraftian cosmic horror in this game is pulled off fantastically.\nThe overarching puzzle mechanic of the game in which you must deduce who the invading god is is a fun little brain teaser. Nothing too brutal if you know what you're doing, but it can take you a bit at first.\nDon't get me wrong though, the game is brutal. Very much so. Each and every dungeon that must be explored to complete the game holds creatures spawned from the ancients. Rusted metal and deformed flesh is waiting inside to break your bones and.. make you go to a hospital. Speaking of that, the enconomy must be pretty damn good over there in the UK if you can get a set of body armor for a mere 20 pounds.\nThe dungeon sections are all enjoyable, and like I said, get pretty damn hard. But the combat is never something you can't win without practice. The dungeons are mostly exploration based anyway, and it's done well. The art style itself is, well, very reminscent of flash games, but the animation is enough to make up for it, I feel.\nPlay as Trilby, Gabe, or any of these other two random assholes and try to banish not-Czho-mythos-Chzo before he CONSUMES the world into his SHADOW.\nIf you like FTL, or you like Lovecraftian horror, definitely definitely definitely pick this one up. You'll be getting your moneys worth that's for sure.", "timestamp_created": 1454783284, "timestamp_updated": 1454783284, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20903233": {"recommendationid": "20903233", "author": {"steamid": "76561197960446706", "num_games_owned": 427, "num_reviews": 111, "playtime_forever": 629, "playtime_last_two_weeks": 0, "last_played": 1468626317}, "language": "english", "review": "This is a good game. It's one of those \"Huh, I'm enjoying this way more than I thought I would\" games. It's by Yahtzee and, as it's obvious through the text of the game, this is what he was doing instead of writing a third novel. COME ON WRITE ANOTHER!!!! Anyway, the game:\n\nPROS:\n+The game is set in Britian and you're supposed to go from town to town finding information relating to which of the three dark gods. One of them is invading and you, as the player, gotta figure it out. This alone is the primary reason why you'll buy the game because, as I discovered in my exprience, I really found myself hunting for information and second guessing my findings until I was certain which god was invading. Mix this with the time limit and frailty of the character, and it becomes a glorious thing.\n+When you die, you die. Actions have consequences and you will probably bleed out while driving to your next location.\n+The time limit really adds to the tension of the game. Whenever that BUM sound happens and the big 55 hours left on the screen hits, I feel the great lovecraftian horror slowly manifesting in our world.\n+The art style is minimum but works really well.\n+Sound and music are perfect, both adding to the atmosphere.\n+The other three characters which can be unlocked play differently than the first enough to justify them.\n+When successfully banish the correct god, you really, really, REALLY feel like you've won.\n\nMIXED:\n+/- The learning curve and constantly dying when you start the game (or start a new character) can be grueling. The \"Birth Stars\" really help later play throughs, but you only get them after dying.\n+/- Unlocking the other characters ranges from beating the game with a good ending to randomly doing a task that an online guide has to tell you about.\n+/- The cell phone messages are perfect with ONE minor problem: If you're using a controller, which I recommend since mouse aiming isn't neccessar, be careful pressing A. Sometimes you'll decline a message when, in reality, you wanted to read it. Just warning you.\n+/- While some inventory items are really useful, others are useless to the player. There's only one use for items outside of the dungeons and that's the random encounters on the road. See below.\n\n\nCONS:\n-Many of the random encounters found on the road are a literally coin toss regardless of what action you choose if they are negative or not. Many of them have a \"Run\" or \"Do something\" with \"Do Something\" risking a 50/50 chance of bad. Unless you have the correct invetory item, I'd almsot recommend ignoring all of them. I feel like the investigation portion of the game is lost on these, like there should be certain words or descriptions that would signel \"Run\" rather than stay.\n-One of the updates reset some of my achievement progress. BOOOOO!!!!!", "timestamp_created": 1454371956, "timestamp_updated": 1454371956, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20825991": {"recommendationid": "20825991", "author": {"steamid": "76561197987563033", "num_games_owned": 775, "num_reviews": 11, "playtime_forever": 1598, "playtime_last_two_weeks": 0, "last_played": 1510585419}, "language": "english", "review": "I'll be honest, if I didn't know the developer from his other works, I wouldn't own this game.\n\nI am glad I do own it however, under the rather simplistic graphics lies a very well made roguelike game that offers a whole lot of replay value, but unfortunately as it often is with many roguelikes it's a game that can have trouble justifying its price, other games can justify it by giving you a rough estimation of the time it'll take you to finish it, roguelikes has to ask you how long you think you'll be playing it, and you can't really answer that before giving it a try.\n\nAt the end of the day it's a nice game to kill some time, the game functions perfectly well and rarely feels flatout unfair, the addition of challenges extends the play time quite a lot and if you get into it you'll find it rather easy to get your money's worth.", "timestamp_created": 1454074794, "timestamp_updated": 1454074794, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20821440": {"recommendationid": "20821440", "author": {"steamid": "76561198085241550", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 563, "playtime_last_two_weeks": 0, "last_played": 1455292342}, "language": "english", "review": "The game does have some very telling issues: the visuals are less than flattering, the dungeon environments are repetitive, and the sound design is very average. I can hear the gap in the ambient audio loop when you visit an inflicted town, and the rain cuts out when you walk inside a house; in short, the sound design is basic, and - for the most part - is unnatural sounding. There are many minor details, apparently overlooked in development, which can take one out of the experience.\n\nDespite this, The Consuming Shadow is still largely a very immersive game. Very few games capture the heavy atmosphere of dread that is essential to survival horror, and this is something that the game does well. It is a genuinely tense and unnerving experience, with the pressure of time constantly weighing down on you as you evade enemies via the extremely clunky control scheme, exploring dungeons looking for clues so that you may potentially save the world. The puzzle system is very well designed, allowing you to hazard a guess at who the invader might be, in case you lack some information as the time runs out. It expects you to think for yourself from the information gathered, rather than simply gather clues and expect the answer to be handed to you once you've collected enough, which is rare and worth praising.\n\nPerhaps the strongest aspect of the game is the writing, and how the game treats writing as integral to the experience. It does lean somewhat towards the telling rather than showing, but the writing is solid nonetheless. Every piece of dialogue, monologue, fluff text, or any descriptions of any kind add to the overall atmosphere, and are more than barebones exposition.\n\nSo I would recommend this game; for the price it's worth checking out. It is an imaginative, tightly designed and highly atmospheric horror game that happens to be somewhat rough around the edges.", "timestamp_created": 1454054227, "timestamp_updated": 1454054227, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20817243": {"recommendationid": "20817243", "author": {"steamid": "76561198017246524", "num_games_owned": 876, "num_reviews": 52, "playtime_forever": 160, "playtime_last_two_weeks": 0, "last_played": 1453961832}, "language": "english", "review": "“Consuming Shadow is the best out of work Noir Detective who has to save the world from a paranormal invasion simulator available on steam. Just make sure you don’t go insane as you explore the procedurally generated dungeons and levels.”\n\nYou can hear the full review on the [url=https://youtu.be/oWlhLYupJ5M]Feed Me Pixels Youtube Channel[/url]", "timestamp_created": 1454032348, "timestamp_updated": 1454032348, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.495542", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20801340": {"recommendationid": "20801340", "author": {"steamid": "76561197987872190", "num_games_owned": 240, "num_reviews": 14, "playtime_forever": 715, "playtime_last_two_weeks": 0, "last_played": 1505689836}, "language": "english", "review": "It was a close call, but in the end--not quite good enough.  Definately not ten dollars good enough.\n\nIn many ways, the game succeeds.  It does evoke a feeling of despair and urgency.  Traveling from town to town and managing resources, health, and sanity is pretty fun and moody.  The proceedurally generated \"mystery\" is pretty fun to solve, but isn't challenging enough once you get the hang of it.  There are only three \"suspect\" Gods in each mystery, and its very easy to narrow it down to two gods--which gives you a 50/50 shot at closing the \"portal\" with a simple guess.  \n\nWhere the game really fails, though, is in the \"dungeons\".  You spend a large portion of the game exploring these urban dungeons looking for clues, and the gameplay here is an unfortunate, flash-based arcade sequence that doesn't fit well with the rest of the game and just plays poorly.  I didn't want to spend the bulk of this game playing an arcade sequence--and it isn't even a good arcade sequence.  The combat is very clunky and not very fun.\n\nI wish instead of including these arcade dungeon runs, more time and effort would have been applied to further developing the proceedural mystery and the resource management aspects of the game.  The dungeon runs would have been handled better as turn based combat rather than the weak arcade combat.\n\nWould like to see this developer take another crack at a similar game.  There is a lot to like here, and it is very evocative at times--it just doesn't quite make the cut for a thumbs up at ten bucks.", "timestamp_created": 1453973318, "timestamp_updated": 1453973318, "voted_up": false, "votes_up": 46, "votes_funny": 2, "weighted_vote_score": "0.652674", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20758131": {"recommendationid": "20758131", "author": {"steamid": "76561198071368944", "num_games_owned": 137, "num_reviews": 7, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1505754993}, "language": "english", "review": "its good", "timestamp_created": 1453772126, "timestamp_updated": 1453772126, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20705562": {"recommendationid": "20705562", "author": {"steamid": "76561198192042470", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1454014665}, "language": "english", "review": "The Consuming Shadow: A fantastic game if you enjoy the tabletop games like 'Arkham Horror/Mansions of Madness' of which this is directly influenced by (it being based on the lore of HP Lovecraft and all). Playing along alone, with a friend, or against a friend - it is a game you will keep coming back to with a different story to tell each time.\n\nIt really goes to prove that an enjoyable game with a deep absorbing narrative can occupy you for hours without the million quid graphics. It leaves a bit more to your imagination (Undertale is the same in this respect and look at the masses of fanart it has inspired). \n\nI don't think this will be a massive hit purely because of the subject material, but I it IS a golden nugget in the river that is Steam. Saying that, I think even those outside the Lovecraft circles, will still get enjoyment from this.\n\nAt 6.99GBP it is a steal and I think worth a bit more than that.\n\nYou will enjoy this if you enjoyed FTL.", "timestamp_created": 1453569405, "timestamp_updated": 1453569405, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20605697": {"recommendationid": "20605697", "author": {"steamid": "76561198040329240", "num_games_owned": 198, "num_reviews": 13, "playtime_forever": 911, "playtime_last_two_weeks": 0, "last_played": 1454378302}, "language": "english", "review": "It's actually pretty neat to play. Good atmosphere, good gameplay, good music (what little there is, it's mostly just ambience and stuff), and it can be legitimately nerve-wracking. Overall, it's good, though not without flaws (some of which can be attributed to Game Maker itself).", "timestamp_created": 1453127746, "timestamp_updated": 1453127746, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20534898": {"recommendationid": "20534898", "author": {"steamid": "76561197968988771", "num_games_owned": 298, "num_reviews": 24, "playtime_forever": 538, "playtime_last_two_weeks": 0, "last_played": 1497257636}, "language": "english", "review": "*smacks chops*", "timestamp_created": 1452836297, "timestamp_updated": 1452836297, "voted_up": true, "votes_up": 18, "votes_funny": 36, "weighted_vote_score": "0.514755", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20501050": {"recommendationid": "20501050", "author": {"steamid": "76561198131202516", "num_games_owned": 222, "num_reviews": 7, "playtime_forever": 1584, "playtime_last_two_weeks": 0, "last_played": 1504995258}, "language": "english", "review": "I absolutely love this game. I stream it sometimes, and get the audience involved in finding the correct invading god. Then again, I could be biased, as I loved the Chzo Mythos, and am a big Yahtzee fan, but when I was playing the game live, I had quite a number of people enjoying it too. :D\n\nIf you like figuring things out, if you like to think and put two and two together, plus you enjoy a little battle here and there, but you don't want battle to be your primary focus, then this is a great game to pick up. I recommend it, highly.", "timestamp_created": 1452669752, "timestamp_updated": 1452669752, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20472499": {"recommendationid": "20472499", "author": {"steamid": "76561198092914367", "num_games_owned": 220, "num_reviews": 40, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1467851890}, "language": "english", "review": "One of these days I'll bother to get all of the achievements, but not today.", "timestamp_created": 1452534561, "timestamp_updated": 1452534561, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499584", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20470299": {"recommendationid": "20470299", "author": {"steamid": "76561198014254879", "num_games_owned": 483, "num_reviews": 13, "playtime_forever": 752, "playtime_last_two_weeks": 0, "last_played": 1462455486}, "language": "english", "review": "This game has some technical issues - it was, after all, made in game maker. BUT if you are a fan of a lovecraftian atmosphere of unimaginable, otherworldly horrors; then this game is just for you(as are other, free games made by this author). I sure hope to see more games like this.", "timestamp_created": 1452526949, "timestamp_updated": 1452526949, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.505311", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20371675": {"recommendationid": "20371675", "author": {"steamid": "76561198010015996", "num_games_owned": 284, "num_reviews": 41, "playtime_forever": 841, "playtime_last_two_weeks": 0, "last_played": 1503085236}, "language": "english", "review": "Let me be clear on why I'm not recommending The Consuming Shadow. It's a solid game that's enjoyable for the price, but there's just not enough vanilla content to keep me replaying it which is a big selling point for a rogue-like.\n\nAfter a few runs learning how to play the game (roughly 1-2 hours) I managed to get ending grade A after another 1-2 hours. There's nothing more the game offers in terms of content other than challenges and the endless gamemode.\nI don't believe 100% completion counts towards content, as such once you've reached a grade A ending you've seen everything the game has to offer.\n\nAt this point any additional content would likely change this review into a recommended.", "timestamp_created": 1452164284, "timestamp_updated": 1452253679, "voted_up": false, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.563035", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20365783": {"recommendationid": "20365783", "author": {"steamid": "76561198043144661", "num_games_owned": 156, "num_reviews": 28, "playtime_forever": 870, "playtime_last_two_weeks": 161, "last_played": 1514273183}, "language": "english", "review": "Consuming shadow is the result if FTL: Faster than Light, and Clue gave birth to the Antichrist.\n\nand boy is it enjoyable", "timestamp_created": 1452134432, "timestamp_updated": 1452134432, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20344581": {"recommendationid": "20344581", "author": {"steamid": "76561197993984245", "num_games_owned": 113, "num_reviews": 1, "playtime_forever": 415, "playtime_last_two_weeks": 0, "last_played": 1487158862}, "language": "english", "review": "really great game really makes you feel the despair of a true lovecraftian horror.\n\n", "timestamp_created": 1452067865, "timestamp_updated": 1452067865, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20324226": {"recommendationid": "20324226", "author": {"steamid": "76561198001412176", "num_games_owned": 407, "num_reviews": 8, "playtime_forever": 405, "playtime_last_two_weeks": 0, "last_played": 1484071364}, "language": "english", "review": "If you can get past the low tech feel of the gameplay and graphics (and really, you should be able to you fucking snob), then you have the best horror game I've played since Amnesia: The Dark Descent.", "timestamp_created": 1452004684, "timestamp_updated": 1452004684, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.500756", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20278909": {"recommendationid": "20278909", "author": {"steamid": "76561197984269843", "num_games_owned": 700, "num_reviews": 43, "playtime_forever": 19, "playtime_last_two_weeks": 0, "last_played": 1451875961}, "language": "english", "review": "To express how I feel about this game:  it is sucktastic.\n\nWhat an absolute fraud any game made with Adobe Flash is!  It's difficult for me to describe how awful this game is.\n\nFirst of all -- the game has nothing whatsoever that could be compared with H.P. Lovecraft's work.  Reviewers who keep using this in their reviews should actually read Lovecraft's work to see how truly psychological his horror was.  There's nothing psychological or suspensful about anything in this game.  Period.\n\nNext, the combat mechanics are questionable and dated -- click click click, bang bang bang.  Oh, wait a minute, the interface forgot to tell you you don't have ammo.  Sorry about that.\n\nUsually, when I feel the need to comment on a game, I try to play it for at least two hours.  This game p*sses me off so much I can't stand wasting the precious moments of my life to get to two hours.  Would a tutorial help?  Yes.  Would it make me give a positive review of this game?  No way in hell.\n\nIt's hard to believe that a developer has such little respect for consumers as to make a pointless, thrill-less, meaningfull-less game that makes you question your own sanity for buying it.  An example:  a headless body hops towards you and you click randomly at it.  There is no actual aiming, because it's a flash game -- your character (seen in blackened profile) fires at the headless body (seen in blackened profile) can either point at a 90 degree angle or not at all.  So there it is, the headless body is kicking the crap out of you and so you duck into a side room.  You're notified that running away from monsters reduces your sanity.  Why?\n\nSuffice it to say that I question my own sanity for putting in .3 hours of my life into this game!\n\nThe more I play games on steam that claim they are \"Lovercraftian\" or \"atmospheric horror\", the more I begin to believe that the developer was lazy and didn't want to invest time in the graphics, or did not know how.\n\nAs a casual gamer who counts the moments of my life preciously -- family, career, responsibilties, the need to escape from frustration -- this game served only to make me feel stupid for spending $5.  That's a lot of money to me, believe it or not -- I have four kids and a grandkid that, like many of us, works hard to support.  If I had spent $10 I most likely would have written a formal apology to my wife for spending that much of my Christmas money on this crap.\n\nPlease, for God's sake, don't waste your money of this game.  If you do and you get as angry as I am -- don't say I didn't warn you.\n", "timestamp_created": 1451876701, "timestamp_updated": 1451876701, "voted_up": false, "votes_up": 6, "votes_funny": 5, "weighted_vote_score": "0.142870", "comment_count": "16", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20244536": {"recommendationid": "20244536", "author": {"steamid": "76561197970550187", "num_games_owned": 276, "num_reviews": 43, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1452221873}, "language": "english", "review": "[b][u]Bullet-Point Review [/u][/b]\n- Horror not gore. Atmosphere, tension, unexpected events and uncertain destinations.\n\n- Adventure in a bleak, doomed world that, somehow, ISN'T depressing thanks to the short play times (5-30 min or so per session) and innovative blend of entertaining mechanics and real in-game investigation.\n\n- The misanthropy and gloom of the best Lovecraftian mythos tales in a format you can interact with. Story-like action.\n\n- Not artsy, but well-crafted. Entertaining, atmospheric writing that draws you in and presents a bigger world in a fairly small game.\n\n- Investigation is key (as it should be). You must find the clues and make sense of them within 60 game hours or the world as we know it is doomed.\n\n- Numb your anxiety with eldritch magic.\n\n- Utilize resources wisely. Spend your ammo, health, time and sanity as best you can while you fight to stop the world from turning into a non-euclidian nightmare.\n\n- Try not to unload your last three bullets into a halucination.\n\n- Organize your information, reconstruct a mysterious diary, leverage the alignment of stars and cross your fingers. \n\n- Then, stave off sleep by sticking those same fingers into your car's cigarette lighter because taking the precious nap you obviously need would waste valuable time.\n\n- Adventure in a dark world where you might be the last hope for the human race and have fun doing it.\n\n- About as independently developed as you can get. That comes with all of the warts and diamonds that make such unique beasts well worth searching out. An this one surely IS worth getting your mits on!\n\n[b]Recommendation:[/b] Unreserved, for any fan of dark games, rouge-like progression, solid writing and pulp mysteries.\n\n[i]Happy gaming,\n\nM13[/i]", "timestamp_created": 1451800650, "timestamp_updated": 1451800822, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20190218": {"recommendationid": "20190218", "author": {"steamid": "76561197972425292", "num_games_owned": 443, "num_reviews": 60, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1453667690}, "language": "english", "review": "Awesome.  \n\nGreat atmosphere, great gameplay, highly recommended if you like roguelites or Lovecraftian horror.", "timestamp_created": 1451677286, "timestamp_updated": 1451677286, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20179327": {"recommendationid": "20179327", "author": {"steamid": "76561198020172214", "num_games_owned": 126, "num_reviews": 4, "playtime_forever": 6678, "playtime_last_two_weeks": 0, "last_played": 1486963520}, "language": "english", "review": "Trilby, Gabe, and two other pr!cks break into homes to fight Chzo and his mates.\nMore intense than trying to make love to a blender.", "timestamp_created": 1451655720, "timestamp_updated": 1451655909, "voted_up": true, "votes_up": 32, "votes_funny": 64, "weighted_vote_score": "0.551284", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20146700": {"recommendationid": "20146700", "author": {"steamid": "76561198079038123", "num_games_owned": 297, "num_reviews": 28, "playtime_forever": 82, "playtime_last_two_weeks": 0, "last_played": 1455553812}, "language": "english", "review": "Yahtzee is sick bud. Love him. Shitted my pants after two minutes of gameplay. Now I have to buy some extra underwear in order to go on with this game.\nVery challenging, Lavcraftian game. Must have for any fan of mystics and occult stuff!", "timestamp_created": 1451563183, "timestamp_updated": 1451563183, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.456116", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20141269": {"recommendationid": "20141269", "author": {"steamid": "76561198047858224", "num_games_owned": 207, "num_reviews": 9, "playtime_forever": 500, "playtime_last_two_weeks": 0, "last_played": 1501511433}, "language": "english", "review": "The consuming Shadow is a tense atmospheric roguelike game (developed by Ben Yahtzee Croshaw) that is worth the price and i will certainly keep playing this for quite a while and i recommend buying it for yourself.\n", "timestamp_created": 1451547139, "timestamp_updated": 1451547139, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502297", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20136800": {"recommendationid": "20136800", "author": {"steamid": "76561198057966907", "num_games_owned": 154, "num_reviews": 4, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1509497471}, "language": "english", "review": "I feel it utterly neccesary to open this review by saying that while the graphics are on the surface very poor in quality, I do not feel the improvement of the graphics could anyway actually improve the quality of the game and in fact the graphics style in many cases adds a sort of ambiguity to the creatures and environments that increases the scare factor.\n\nThis game is heavily entrenched in lovecraftian lore and like many of the most famous lovecraftian games, features a sort of detective element as the user (who plays as one of four characters with varying abilities for slightly different playstyles) must discover clues as to what the banishment ritual is to stop the invading god and who the invading god actually is.\n\nIt is this detective element that is one of my favourite parts of the game as using all the clues to work out the three gods and their varing details makes for its own subgame that keeps you going throughout.\n\nThe main gameplay is the dungeons which you are in so often that you would not be initially forgiven for thinking these would get repetetive but the constant threat of death or insanity, using the gameplay shifting and excellently implemented insanity mechanic, keeps the stakes up and stops any dungeon sequence from being boring.\n\nAs previously mentioned there is an insanity mechanic and unlike in other games where the changes are superficial and tend to encourage insanity accidently due to the interesting changes in this game you fear insanity and being insane actually really increases the difficulty forcing you to put insanity as a priority over health as health can be more easily recovered.\n\nLastly you will die in this game and as the game will tell you death is neccesary to get progression through the birthstar system to give you bonuses and as the story follows the multiverse theory all playthroughs are canon and there are even hints to the creators own Chzo mythos.\n\nOverall I must give it an 8/10 as for all the good things stated above there is a genuine problem of balance as the game is cruel and there are a few times that I looked at the game and got frustrated at the detective elements but they are almost always the fualt of the player but there are a few things that the creator could improve like the in car UI and better graphics would certainly appease some of the knats if not improve the game.", "timestamp_created": 1451532514, "timestamp_updated": 1451532514, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "20097802": {"recommendationid": "20097802", "author": {"steamid": "76561198040007324", "num_games_owned": 133, "num_reviews": 4, "playtime_forever": 1802, "playtime_last_two_weeks": 0, "last_played": 1506763677}, "language": "english", "review": "> be one of the few people capable of saving the world from an otherwordly abomination\n> have a very strict time limit\n> don't go above 30 mph\n> don't carry more than 18 bullets\n\nAn unpolished gem, with mostly good writing, Flash-tier graphics and GUI and tons of replayability. \n\nFTL in England with Chtulhu, 7/10.", "timestamp_created": 1451436147, "timestamp_updated": 1451436147, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19996864": {"recommendationid": "19996864", "author": {"steamid": "76561198073589336", "num_games_owned": 483, "num_reviews": 7, "playtime_forever": 622, "playtime_last_two_weeks": 0, "last_played": 1473642419}, "language": "english", "review": "This is a lovecraftian themed game the charaters are all in silouette and a lot of the things you fight look like something that dropped out of the sphinx's nose. The combat is a little clunky but what do you expect from a sidescroller. The game varies each time you play it you may find yourself either well stocked with lots of ammo or fighting for you life scavaging bins to get a couple of pee-shooter rounds. You get rated upon your death there is something satisfying about getting called a raving gun crazy detective. The game was created by ben yahtzee croshaw this for me elimates a lot of the atmosphere as i find my self reading everything in his voice its kind of like playing silent hill when all the characters are voiced by morgan freeman. well dont take my work for it by the game yourself its only a couple of quid and if you enjoy it you have potential to get quite a bit of gameplay out of it.", "timestamp_created": 1451224114, "timestamp_updated": 1451224114, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "4.975124", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19968276": {"recommendationid": "19968276", "author": {"steamid": "76561198075988666", "num_games_owned": 3006, "num_reviews": 73, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1451368181}, "language": "english", "review": "Greetings fellow gamers! This is Gamer Guy (In a Suit) from the Echo Army YouTube channel! Today I am bringing you a review of the Indie Adventure game The Consuming Shadow. The Consuming Shadow has been around for a while now, but was finally released onto Steam on November 20, 2015 by Developer/Publisher Ben \"Yahtzee\" Croshaw.\n\n(NOTE: This game was NOT reviewed using a key provided by the Developer and/or Publisher, it was a game I purchased for my own account)\n\n\nVideo Review: \n\n(NO video...Shadowplay would not record this...I'm kinda scared!)\n\nThe \"Too Long, Didn't Watch\" Review:\n\nLovecraftian Rogue-Like is as good as that sounds. Low-quality visuals, high-quality gameplay.\n4/5 and easily worth $10\n\nThe \"Meat & Potatoes\" Review:\n\nThe Consuming Shadow is a great Lovecraftian experience, gamers. This is good stuff here, if this is your kind of thing. Consider a blend between parts of Skyhill, FTL and the TV Show \"Supernatural\". That's essentially what you get here. You get texts and drive around in your car from town to town investigating events and essentially leveling (re: grinding) while finding the runes you need to succesfully cast a banishment ritual at Stonehenge to end all the evil chicanery. Good? Good. There are unlockable characters, different dungeon types, different missions, spells to learn, etc. The \"Insanity Edition\" on Steam adds some awesome play modes to increase replayability. There is an infinite dungeon mode known as \"The Descent\" and there are also Daily Challenges. This is going to be big with fans of Survival Horror, Rogue-Like Perma-Death Gameplay and especially Lovecraftian themes. The stories and events are fairly well done. The visuals are not the most modern and crisp, but aren't exactly what you are here for. To me, this is one of the only true cons. Also, if you do not like to read a bit or don't enjoy horror elements, maybe look elsewhere. All in all, a fantastic little Lovecraftian experience for me.  A solid 4/5 and hours can be lost to this little gem. Do not let it slip by! $10 is a good deal for this!\n\nHappy Gaming!", "timestamp_created": 1451151436, "timestamp_updated": 1451151436, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.452503", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19887227": {"recommendationid": "19887227", "author": {"steamid": "76561197971703354", "num_games_owned": 507, "num_reviews": 22, "playtime_forever": 1985, "playtime_last_two_weeks": 0, "last_played": 1500858003}, "language": "english", "review": "Like a hybrid of FTL and the Arkham Horror boardgame. Clever adaptation of simple silhouette sprites to capture Lovecraftian horror effectively, like a visual analogue of the writing technique of never quite giving a full description of the horrors piercing the veil of reality, leaving the details for the reader's imagination to invest with the necessary emotions by itself. Altogether worthy indie game - procedural generation is effective - characters to unlock and alternate endings offer replayability value - insanity effects and suicide mechanic is entertaining and generates dramatic moments better than scripting ever could. Challengingly groovy.", "timestamp_created": 1450905606, "timestamp_updated": 1480079938, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.488889", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19868499": {"recommendationid": "19868499", "author": {"steamid": "76561198011009456", "num_games_owned": 314, "num_reviews": 40, "playtime_forever": 88, "playtime_last_two_weeks": 0, "last_played": 1452091962}, "language": "english", "review": "Lets start off with the negative\n1. The gameplay is somewhat clunky.\n2. The visuals are not the best.\nAnd now lets get to the good things.\n1. The writing is great.\n2. The atmosphere is great.\n3. The investigative part is great\n4. The replay value is great.\nSo in conclusion if you want a lovecraftian roguelike then look no further because this is probably the best one.", "timestamp_created": 1450866809, "timestamp_updated": 1450866809, "voted_up": true, "votes_up": 17, "votes_funny": 0, "weighted_vote_score": "0.675131", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19862093": {"recommendationid": "19862093", "author": {"steamid": "76561198049840197", "num_games_owned": 167, "num_reviews": 93, "playtime_forever": 944, "playtime_last_two_weeks": 0, "last_played": 1507534474}, "language": "english", "review": "be sure to wear pants that are at least 3 sizes to big cause this game is going to fill them with gritt and terrified wee.", "timestamp_created": 1450845957, "timestamp_updated": 1450845957, "voted_up": true, "votes_up": 2, "votes_funny": 6, "weighted_vote_score": "0.490939", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19860782": {"recommendationid": "19860782", "author": {"steamid": "76561198079357294", "num_games_owned": 341, "num_reviews": 8, "playtime_forever": 327, "playtime_last_two_weeks": 0, "last_played": 1489887944}, "language": "english", "review": "Disturbing enemies,creepy locales and a unique clue system. 9/10", "timestamp_created": 1450841709, "timestamp_updated": 1450841709, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19807700": {"recommendationid": "19807700", "author": {"steamid": "76561198259972646", "num_games_owned": 28, "num_reviews": 2, "playtime_forever": 15, "playtime_last_two_weeks": 0, "last_played": 1449426605}, "language": "english", "review": "Very vauge story line, and wasn't clear on what the player was suppose to do. A lot of reading, and that can be very difficult to undestand when, you trying to figure out what this game is all about. If your into spoky, story lines, then this is the game for you, but i wasn't all that thrilled about it.", "timestamp_created": 1450632405, "timestamp_updated": 1450632405, "voted_up": false, "votes_up": 12, "votes_funny": 2, "weighted_vote_score": "0.204010", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19797206": {"recommendationid": "19797206", "author": {"steamid": "76561198005784495", "num_games_owned": 672, "num_reviews": 24, "playtime_forever": 20, "playtime_last_two_weeks": 0, "last_played": 1450590187}, "language": "english", "review": "Only completed one play through but it is surprisingly good. It combines depth with random levels and is actually quite atmospheric. Good work Ben.", "timestamp_created": 1450590271, "timestamp_updated": 1450590271, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19651133": {"recommendationid": "19651133", "author": {"steamid": "76561198036241124", "num_games_owned": 178, "num_reviews": 3, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1454213577}, "language": "english", "review": "used narcotics and became more sane. 10/10", "timestamp_created": 1449925509, "timestamp_updated": 1449925509, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19629189": {"recommendationid": "19629189", "author": {"steamid": "76561198038723091", "num_games_owned": 141, "num_reviews": 1, "playtime_forever": 619, "playtime_last_two_weeks": 0, "last_played": 1453566199}, "language": "polish", "review": "YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING YOU'RE DREAMING. 10/10", "timestamp_created": 1449834063, "timestamp_updated": 1449834063, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504951", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19552990": {"recommendationid": "19552990", "author": {"steamid": "76561198066353481", "num_games_owned": 200, "num_reviews": 94, "playtime_forever": 858, "playtime_last_two_weeks": 0, "last_played": 1463893464}, "language": "english", "review": "Ministery of Occultism, the T sign, the Trilby hat, poetic writing, yay it's Trilby! Oh and also the Wizard is the carbon copy of that boring robot lady from that space mistery adventure game. Brilliant game Yahtzee, best so far I would say.", "timestamp_created": 1449517521, "timestamp_updated": 1449517521, "voted_up": true, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.551907", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19541885": {"recommendationid": "19541885", "author": {"steamid": "76561198050804043", "num_games_owned": 236, "num_reviews": 3, "playtime_forever": 335, "playtime_last_two_weeks": 0, "last_played": 1449544887}, "language": "english", "review": "I highly encourage you not to look up play throughs or guides, as half the fun is discovering everything you can about the twisted world. It took a few short playthroughs where I died very quickly before I figured out enough of what was going on to be competent. I'll be playing this one a lot just to unlock more of the story!", "timestamp_created": 1449465258, "timestamp_updated": 1449465258, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19540433": {"recommendationid": "19540433", "author": {"steamid": "76561198080772755", "num_games_owned": 430, "num_reviews": 15, "playtime_forever": 828, "playtime_last_two_weeks": 0, "last_played": 1495609963}, "language": "english", "review": "I recommened this game for it's horror element's and use of sanity and insanity effects on the game.", "timestamp_created": 1449457282, "timestamp_updated": 1463913792, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19522452": {"recommendationid": "19522452", "author": {"steamid": "76561197984699801", "num_games_owned": 331, "num_reviews": 19, "playtime_forever": 175, "playtime_last_two_weeks": 0, "last_played": 1459512387}, "language": "english", "review": "Yeah... it's alright *outro music*", "timestamp_created": 1449398126, "timestamp_updated": 1449398126, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.499638", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19504191": {"recommendationid": "19504191", "author": {"steamid": "76561198076346059", "num_games_owned": 198, "num_reviews": 23, "playtime_forever": 343, "playtime_last_two_weeks": 0, "last_played": 1449428254}, "language": "english", "review": "The Consuming Shadow, developed by Ben Croshaw, is a side-scroller, dungeon crawling rough-like with a horror paint job. Now, if you’re an avid Steam user, you’d know how many dungeon crawler rough-likes there are on the market. They’re worth a dime a dozen at this point. So, I was more than pleased when I found this little gem. It's amazing how unique and promising this game is opposed to the other.\n\nPlot: A strange and horrific shadow is washing over Great Britain in full force. Cities have been ravished by otherworldly beasts, people have been melded into twisted shells of their previous selves, and in just three days, the country will fall… then the world. All mighty gods known as The Ancients are behind this mayhem, but it’s the player’s job to find out who’s to blame and banish them. You will travel from city to city, all across the UK in search of clues, answers, and knowledge. \n\nAs I mentioned before, The Consuming shadow really is its own game, and I doubt you can mistake it for another. Gameplay is rather straight forward, but it works great. You’ve got a plethora of items to find and collect, multiple ammo types, spells to master and more. Dungeons are grid based, and each one has its own objective. This may vary from securing an occult text, finding a missing person, destroying monster nests etc. And let me tell you, this game can be tough, and you will die. Monsters deal vicious damage and conserving ammo is not as easy as you might think. Driving also plays a big role in The Consuming Shadow. Driving from location to location takes time, so it’s important to set a predetermined path as to save every precious hour. But there’s a good chance you’ll bump into random events along the way. You’re usually given two choices to make, and more often than not, my decisions resulted in negative outcomes, like the loss of some health or sanity. There isn’t any pattern behind these events and making the right choice is based purely on luck.\n\nThere’s also a sanity meter that must be kept healthy. The madder you become, the more difficult the game is. But, unlike most games in the genera, dying isn’t a total lost. XP is still earned and built up through multiple playthroughs, and each time a player levels up, they’re given an array of buffs before they start their next run. \n\nNow, this is where a complaint of mine comes in. The max level is ten, and if you were to spend all ten of your buffs on health and sanity increases, it makes the game a bit underwhelming. If I’m sporting 456 health, it’s gonna take A LOT to kill me. It also makes your first bunch of playthroughs damn-near impossible, seeing as how you start off with such low stats.\n\nBut apart from that… there really isn’t much to complain about, here. The Consuming Shadows accomplishes what it aims to do with flying stars, and apart from a couple gripes, I’d say it’s definitely worth your money.", "timestamp_created": 1449332418, "timestamp_updated": 1449337404, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502175", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19446663": {"recommendationid": "19446663", "author": {"steamid": "76561198179979129", "num_games_owned": 44, "num_reviews": 3, "playtime_forever": 1115, "playtime_last_two_weeks": 0, "last_played": 1465571731}, "language": "swedish", "review": "I love this game! As I checked it out before purchase I did not expect it to have much of an effect on me, but boy was I wrong. This game uses excellent writing and audio to really enhance the terror your character feels.\n\nAs a huge fan of the Arkham Horror boardgame I well and truly recommend this game!", "timestamp_created": 1449093214, "timestamp_updated": 1449093214, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19430876": {"recommendationid": "19430876", "author": {"steamid": "76561198007371020", "num_games_owned": 420, "num_reviews": 60, "playtime_forever": 646, "playtime_last_two_weeks": 0, "last_played": 1510638119}, "language": "english", "review": "amazing horror game that takes everything amazing from the Cthulhu mythos and smashes it together with nice rouge-like elements. Who would have thought that Lovecraft and Rogue-likes would go so well together? As I've been getting farther and farther with each attempt, it actually gets scarier as dungeons get larger and boss enemies become standard enemies. on top of all of this, everything is randomly generated so you can never be certain what will happen.\n\non top of all of this, it has a Majora's Mask-esque countdown timer that always appears on screen during combat and pops in and out with drums while you drive. time is the real enemy as you do not have enough time to check every town under distress and restock on supplies.\n\nSome of my complaintsa re that you are unable to change resoultion, rebind keys, and the graphics are a bit unappealing (looking more like a flash game). The actual combat graphics are fine as every character is a silhouette, but the U.I. distracts me completely. You also get access to notes that you can fill out with a fill-in-the-blank microsoft excel style system. While it works nicely, I would have liked to have another section of notes to keep track of what information I do not know for certain and don't have automated notes for (e.i. symbols you find in dungeons, status of dead bodies in the area, etc).\n\ntl:dr awesome horror rogue-like. while graphics are simple and customization is minimal, its great generated story and gameplay make it fucking incredible.", "timestamp_created": 1449035532, "timestamp_updated": 1449035532, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19382819": {"recommendationid": "19382819", "author": {"steamid": "76561198013916101", "num_games_owned": 276, "num_reviews": 5, "playtime_forever": 1241, "playtime_last_two_weeks": 0, "last_played": 1478484131}, "language": "english", "review": "Pros: \n+High replayability\n+Authentic Lovecraftian experience where violence can only solve low level problems\n+Investigation oriented gameplay\n+Abundance of items balanced by shortness of storage and funding creates a game where you never know what the RNG will give you yet you will never lose because the game refused to let you play\n\nCons:\n-RNG can still delay you or speed you along in arbitrary ways\n-Spamming all your levelling up into sanity or health makes you OP\n-Most of the abilities you can put your levels into have little value, thus forcing you to become overpowered.\n\nOverall:\nIt's definitely a must purchase for anyone who wants a Lovecraftian game that actually feels Lovecraftian", "timestamp_created": 1448864670, "timestamp_updated": 1448864670, "voted_up": true, "votes_up": 49, "votes_funny": 2, "weighted_vote_score": "0.820630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19380488": {"recommendationid": "19380488", "author": {"steamid": "76561197995800735", "num_games_owned": 420, "num_reviews": 4, "playtime_forever": 1286, "playtime_last_two_weeks": 0, "last_played": 1500313970}, "language": "english", "review": "I played this back in its alpha stages. I loved it then and I love it now. It's a great horror-survival-meets-logic-puzzle kind of game with great atmosphere, writing, and sound. While the graphics lack a professional touch, I think the style is cohesive and looks exactly as good as it needs to.\n\nAll in all, I think The Consuming Shadow is engaging, unsettling, and fun and I highly reccomend it.", "timestamp_created": 1448852313, "timestamp_updated": 1448852313, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.500856", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19301251": {"recommendationid": "19301251", "author": {"steamid": "76561198041255332", "num_games_owned": 145, "num_reviews": 7, "playtime_forever": 344, "playtime_last_two_weeks": 0, "last_played": 1450427842}, "language": "english", "review": "I'm not usually a horror game person. So for all you crazies who play Five Nights or Amnesia or any other crazy make you piss your pants scare games maybe this won't be as bad for you but it's great for pansies like me.\n\nIt doesn't aim to jump scare you it's more sort of here's this very dingy dark feeling in the world it's going to end in three days unless you find everything you need to stop it.  The world is small and the towns are random wether they are \"happy\" heal yourself and scavenge for stuff or an evil dungeon for you to explore and hopefully not die or go insane in. \n\nFind clues to peice together which Shogoth evil extradimensional deity is trying to kill you and how to stop them. \n\nAs for the graffics they are fine, they are not spectacular but oh well they won't hurt you either, the insanity effects do but well they are supposed to. \n\nManaged to play it for 2 hours the first time before I was getting a bit too jumpy on my trigger finger and shot an innocent person, oops.", "timestamp_created": 1448600031, "timestamp_updated": 1448600031, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501891", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19291554": {"recommendationid": "19291554", "author": {"steamid": "76561198031988409", "num_games_owned": 18, "num_reviews": 1, "playtime_forever": 3917, "playtime_last_two_weeks": 0, "last_played": 1506866247}, "language": "english", "review": "If you want flashy graphics and large action set pieces, this game is not for you. Before you start The Consuming \nShadow you need to accept that you aren't paying for the tighest and sharpest pixels but you are paying for : an intriguing world to explore;masterful writing;interesting and refreshing gameplay mechanics ; a tense and sometimes horrifying atmosphere and an all around hardcore rougelike experience. \n\nThis game is not for the faint of heart or easily frustrated. You will die over and over again, It's entirely possible to have 'lost' a playthrough in the first 5 minutes. However, every playthrough grants you a greater understanding of what you need to accomplish and how you are going to do it. The 'Birth Star' or levelling system allows you to customise a characters skills and abillities before a game even starts. Each character is different, with their own playstyles, endings, backstories, pros and cons. \n\nYou'll also find yourself in some very uncomfortable situation as you traverse England and Wales in the days leading up to the apocalypse. Do you attempt to save a child from a burning car, injuring yourself? Do you leave your car to join a congregation, only to find that they are minions of the very evil you are trying to banish? \n\nMy one nitpick is that the randomness of events,encounters and resource avaliabillity can often lead to certain tasks becoming nigh impossible to complete. It can lead to some frustration but overall it hardly detracts from the overall experience. \n\nIf you enjoy rougelikes, Lovecraftian horror and a rich atmosphere and world, you owe it to yourself to pick up this game.", "timestamp_created": 1448562991, "timestamp_updated": 1448562991, "voted_up": true, "votes_up": 9, "votes_funny": 0, "weighted_vote_score": "0.613669", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19287683": {"recommendationid": "19287683", "author": {"steamid": "76561198071221914", "num_games_owned": 1473, "num_reviews": 30, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 1467689922}, "language": "japanese", "review": "[h1]Yahtzee is GOD. GO is not GOD.[/h1]\n\n<概要> \n異世界の神がこちらに侵略しようとしてきているので、止めなくてはいけない\n侵略を止めるには所定の場所で侵略者を追放する呪文を詠唱する必要がある\n間違った神を追放したらこの世界は終わり\n残された時間は60~24時間(キャラクターに依存)\n疑わしい神は3つ\n・3つのうち1つは侵略者\n・3つのうち1つは侵略者の味方\n・3つのうち1つは侵略者の敵\n\nじゃあ頑張ってイギリス中行脚して証拠集めて、はーいよーいスタート\nめんどくさいから、パパパッと自殺して、終わり！\nhttps://www.youtube.com/watch?v=lKIv4HKlqMs\n\n<いいとこ>\n1.ほとんど上昇しないSAN値\n　・神の眷属を倒さずに部屋を出るとSAN値が下がる\n　・ダメージを食らうとSAN値が下がる\n　・足をくじいた状態で走るとSAN値が下る\n　・呪文を詠唱するとSAN値が下がる\n　・運転中に怪しいメールを受信してSAN値が下る\n　・違法薬物を注射[strike]してダイナモ感覚[/strike]すると一時的にSAN値が最大まで上がる\n　　(でも時間経過で徐々に下がる) \n2.SAN値減少時の影響がUIにまで及ぶ\n　・画面がちらつく\n　・画面に黒い染みが出るようになる\n　・幻覚が見える\n　・幻覚だと思ったら本物だった\n　・画面がポケモンショック並みに激しく点滅する\n　・プレイヤーキャラクターが見えなくなる\n　・選択肢がいきなり「Kill myself」に変わる(選んだら即死)\n　・文字がちゃんと表示されなくなる\nhttp://steamcommunity.com/sharedfiles/filedetails/?id=560145766\n3.死にゲー\n　SAN値の影響もあってよく死ぬ\n　とはいえ、スコアによってプレイヤーキャラクターも成長し、\n　ステータスにボーナスが乗せられるようになるので、何度も死ねばそのうちクリアできるようになる\n　上手く行っている時に限って「Kill myself」で死ぬのはご愛嬌\n\n<わるいとこ>\n1.要英語力\n　ゲーム内の英文がやたらと長文なので、パッと見でアレルギー反応が出る可能性は高い\n　でも何回か死ぬうちに要点はわかってくるので、実は読めなくてもそれほど困らないと思われる\n　ただし全く英語がわからないと追放する神が推理できなくて詰むため、そういう人にはお勧めできない\n2.それほどホラーじゃない\n　神の眷属は一部を除いてそこまで強くはなく、弾薬もケチってると無駄になる程度には見つかり、\n　装備品でダメージやSAN値の減少を抑えることができるため、あんまりホラーホラーした感じではない\n　ドッキリ描写もそこまで多くないため、SAN値低下時の描写がなかったら比較的普通のゲームだったかもしれない\n\n<総論>\nじわじわとSAN値に苦しめられたい人向け", "timestamp_created": 1448551689, "timestamp_updated": 1448551780, "voted_up": true, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.370224", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19280087": {"recommendationid": "19280087", "author": {"steamid": "76561198083568124", "num_games_owned": 106, "num_reviews": 18, "playtime_forever": 657, "playtime_last_two_weeks": 0, "last_played": 1509932245}, "language": "english", "review": "Another awesome game by Yahtzee Croshaw. You should definitly buy it, and try not to kill yourself.", "timestamp_created": 1448517358, "timestamp_updated": 1448517358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19252659": {"recommendationid": "19252659", "author": {"steamid": "76561198065726632", "num_games_owned": 121, "num_reviews": 2, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1457732146}, "language": "english", "review": "The way the game has you deduce the identity of the gods means that it is entirely possible to fuck it up, as indeed you will sometimes do. The game is amazingly replayable with the independant character leveling, and challenges. Unlocking the characters is something that is really quite intersting, you have to throw the curent game. Maybe throw is an exagetation, but the game certanliy dosent hand you the unlockable ones. You need (for 2 of the characters anyway) to have a specific item and to go to a town, fight though the level and then continue with the game. The rogue like elements certanly help you feel like a poor, tired, bastard as you try and gather clues, items, and weaponry. The hours that count down as you travel around the cities are nerve racking.", "timestamp_created": 1448385882, "timestamp_updated": 1448385882, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.498692", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19240120": {"recommendationid": "19240120", "author": {"steamid": "76561198041717774", "num_games_owned": 1681, "num_reviews": 44, "playtime_forever": 260, "playtime_last_two_weeks": 0, "last_played": 1448510347}, "language": "english", "review": "+Investigating and putting clues together to complete your overall objective\n+Solid atmosphere and silhouetted characters/enemies provides style\n+Insanely survival-esque gameplay, manage your supplies well or else\n+Lots of endings, unlockables and other modes\n\n-Overall quality is about that of a flash game\n-Sound is middling\n-Each game is quite short\n-Can be overly difficult at times", "timestamp_created": 1448313288, "timestamp_updated": 1448313288, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.547519", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19239481": {"recommendationid": "19239481", "author": {"steamid": "76561198013989826", "num_games_owned": 204, "num_reviews": 5, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1448640863}, "language": "english", "review": "p̶͇͖̭l̜̽ͣȅ̲̯͕̃̂a̩̻̯̰̗ͦ̀͢ͅs̫ͅe̘̩͕̮ͨ̄͊ ̑ͫ͋͂͏̘͇ͅḧ͍́̓̍̈̋̋͗e̩̣͖͓͋̍̿̃ͮ̅̇͢ͅl̥̫͈͍̉̿͆̀̕ͅp̘̪̻ͪ̔ͫ̋ͥ͡ ̴̙̻͈͙̙̟m̅́͆ͥ̉̍͏̣̹̟̹è̢̻̄̆̇̄̌͒\n̢̠͉̲̰̟͛ͩ͆̏̿̚t̲̿ͥ̿͂̆̌͠h̤̟e̷͍͚̜̟̗̯ͯ̿ͦͭr̔̓̾̊ͦ̃̓e̺ͭ'͙̺͇̰̳̠̈́s̗͚̘͙̮͌̿̿ͅ ͙̞̪̝̹̬͙͋ͧͮ̔ͧ̾̉s̜̥̳̱̱̺̽ͥͨͭ̆o̺͓͙̺̯ͨ͡m̦̀e̩̮̝̹̲̖͐̅̅̃ťͨh̸͓̣̼̗̼ͦ̾i̶̦̘̺̳̦̻ͦ̆n̫̰͈̣̪̅̈͛͑gͮ̓̌̚ͅ ̎ͪ̎̈̏c̬̋̔̇ͭh̎̓̆̉ͬ̑̅҉͚a̻̤̗̯̘s̗̹͓̥̝̫͋ͦ̋i̋̓ͦ͛̇̉͏̘̼̲̜ǹ̷̫̗̰͎̯g͚̭͑̓͌́̚ ̎̃ͭ̇m̢̹̗͈̤e̘̪̭͖̱̣̠̔̈\nͥ̐͢ĩ̛͚̻̱͕̊̆͌ ̢͕̻ͭ͐ͮ̾͆ć̘̟̮͖͕̰̰̍ͮ̏̅̒ͥä̧̟̻̳̼̬n̿̇͗͆͏̤͙̱͖̠͍n̴͛͗̇ͨ̎o͎̯͓̝̟̹̓͐ͫ̄͊t̸̪́̚ ̛͖̯ṛ̸̝̜̻̪u͉̼̘̦̯͈͎͐ͧ͘n͉̱͛ͣ̏ ̘̝̖̦͢f̬̞̣̝́͌ͭ̅̏͗̔͠o̾̔̏̄̋ͥ͋̀r̞̝͉̻̔̽ev̝̹̳ͫͮͨ̈́ͬ͑̚ͅe͆̾͏r̶̲̲̠̅̓̍̈́ͥ̽̚", "timestamp_created": 1448310780, "timestamp_updated": 1448310780, "voted_up": true, "votes_up": 5, "votes_funny": 5, "weighted_vote_score": "0.503991", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19230821": {"recommendationid": "19230821", "author": {"steamid": "76561198017961272", "num_games_owned": 319, "num_reviews": 31, "playtime_forever": 756, "playtime_last_two_weeks": 0, "last_played": 1467163670}, "language": "english", "review": "A chilling rouguelike Survival Horror game, erring more on \"survival\" rather than \"Horror\". An ancient god plans to invade the world, so you have to find parts of an ancient banishment ritual to stop them. Delve deep into infested monster dens, take drugs, do whatever you need to in order to save the world.\n\nOr die trying. That will happen a lot.\n\nPros:\n-Many aspects of the game are randomized every time. While you may explore similar locales, there's enough to spice things up every time.\n-Real survival horror gameplay. The enemies and atmosphere are oppresive and stressful, but trying to keep your health and supplies up to combat it can be equally stressful. Difficult but rewarding!\n-Unlockable characters, challenge modes, beastiary, this game is a Completionist's dream.\n-Despite the game's randomization, there aren't any truly \"overpowered\" item combinations. You'll be clawing your way through this game no matter what!\n\nCons:\n-Like many other rougelike games, you can get some really bad RNG. Be it a map full of monster-infested towns when you desperately need supplies, unfortunate monster spawns, or random events that conspire against your current run. be ready for lots of stress.\n-Graphics are simplistic by design. Think of something like Undertale: Not hyper-detailed, but it gets the job done. While I personally don't find this a dealbreaker, I can understand why it might be for others.\n-Another \"mixed bag\" criticism is the game's levelling system. As you complete (or fail) runs, you gain experience, unlocking new perks that can improve future playthroughs. While this is very encouraging, it makes early runs feel like you have an unfair disadvantage.\n\nConclusion:\nA great rougelike game that keeps you on the edge of your seat every time you play it. It's not slow-paced like FTL, but it's not as twitchy and fast as Spelunky; it finds a happy middle-ground of slow, methodical gameplay, along with plenty of monster fighting. This game can be very stressful, but I find it very rewarding.", "timestamp_created": 1448268766, "timestamp_updated": 1448268766, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.575718", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19222117": {"recommendationid": "19222117", "author": {"steamid": "76561198111597298", "num_games_owned": 147, "num_reviews": 3, "playtime_forever": 2284, "playtime_last_two_weeks": 0, "last_played": 1501514027}, "language": "english", "review": "I love this game and its creator.", "timestamp_created": 1448221752, "timestamp_updated": 1511429613, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.497280", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19214410": {"recommendationid": "19214410", "author": {"steamid": "76561197971230354", "num_games_owned": 470, "num_reviews": 22, "playtime_forever": 87, "playtime_last_two_weeks": 0, "last_played": 1448196242}, "language": "japanese", "review": "毎回冒険の内容が変わる、ランダム生成の横スクロールアドベンチャーゲーム。\nジャンルはサイコロジカルホラー＋コズミックホラー。\n\nストーンヘンジから表の世界に侵入しようとする古の神を止めるために、60時間（キャラによっては24時間）の間にイギリスの田舎をを旅して古の神に対抗するための詠唱（ルーン4つ）を見つけ出し、ストーンヘンジの最深部で唱えるのが最終目的。\n\n時間経過と共に広がる狂気と闇、減ってゆく回復アイテムと弾薬、0になるSAN値…　身体・精神共に健全なまま古の神に対抗できるかは、プレイヤー次第。", "timestamp_created": 1448197545, "timestamp_updated": 1448197545, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507021", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19210197": {"recommendationid": "19210197", "author": {"steamid": "76561198003106938", "num_games_owned": 139, "num_reviews": 9, "playtime_forever": 370, "playtime_last_two_weeks": 0, "last_played": 1456294326}, "language": "english", "review": "I just wanted to go into space/10", "timestamp_created": 1448180246, "timestamp_updated": 1448180246, "voted_up": true, "votes_up": 67, "votes_funny": 173, "weighted_vote_score": "0.524774", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19207273": {"recommendationid": "19207273", "author": {"steamid": "76561198086586626", "num_games_owned": 292, "num_reviews": 22, "playtime_forever": 1411, "playtime_last_two_weeks": 0, "last_played": 1473104404}, "language": "english", "review": "Where is my mind? ~~♪", "timestamp_created": 1448164482, "timestamp_updated": 1448164482, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.476515", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19203439": {"recommendationid": "19203439", "author": {"steamid": "76561198026782701", "num_games_owned": 527, "num_reviews": 89, "playtime_forever": 47, "playtime_last_two_weeks": 0, "last_played": 1448145775}, "language": "english", "review": "At its core, this game is very simple. A Lovecraftian procedurally generated CYOA with action sequences, simple shadowy graphics and a horrific plot.\n\nBut that simplicity in and of itself is what makes it so good. What it does, it does well. \n\nYou are the standard Lovecraftian \"scholar of the occult turned bastion against the darkness, sacrificing your very self and mind to save the world from the mind tearing evil beyond\". \n\nIn the main game mode you have 60 \"hours\" to find the keys to complete the banishment ritual to stop the dark god from entering the world through Stonehenge and warping all creation. To do this, you travel around the UK in your car, stopping at various towns. Some are peaceful and untainted, while others have been infested with the Shadow. In those you may investigate where the infection is and shut it down. Random text messages arrive, both people providing advice and cheering you on, and the Dark Forces taunting you (Cthulu has taught its minions to use SMS, I see...). Theres also random events as you travel around, sometimes leading to more investigation sequences.\n\nAll this comes at the cost of your own life and sanity, of course. In the action sequences the game turns into a 2d room by room maze, randomly generated. Search the rooms to find clues to which dark god is trying to get through stonehenge, and items and magic spells to help you in you journeys. Shoot horrid shadow monsters with your trusty gun, or just pistol whip the hell out of them, as you dont have many bullets. After completeting whatever it was that sent you there, sometimes you got to RUN as the dark forces dont like being thwarted. Fortunately theres a handy minimap in the corner that shows where youve been.\n\nOnce you have gathered enough clues to piece together which dark god is trying to f'up the earth, get to stonehenge and cast the banishment ritual (magic is used by quickly selecting symbols with RS) to keep it out. \n\nKind of like a game of Clue, only with much more insanity, Ia Ia Cthulu fhtagn-ing, and terror.\n\nThe sanity meter is cool. As you start going insane, weird things start happening on screen. Doors move, things vanish, all hell breaks loose (literally). And in the CYoA text segments, the words in the selection boxes start flicking back and forth between what you are trying to do (ie \"Investigate Further\", \"Return to Car\") and \"KILL YOURSELF\". You can imagine the end result of that one.\n\nThe writing in the CYoA segments is *awesome* and totally captures that Lovecraftian feel of flickers at the edge of vision, all consuming darkness, and incredible wrongness, and you are the only one who can stop it, although youd rather just curl up in a corner and die. Graphics are simple, but this game is proof positive you dont need ultra detailed gore to be creepy. In the action sequences you and the monsters are just shadows against a backdrop (rendered appropriately for the area graveyard/park, house, abandoned building etc).\n\nIt also has persistant unlocables to aid you in your quests. Extra abilities, items, diary entries, game modes and more unlockable characters provide a feeling of completion, even after watching the last nameless scholar slowly bring his gun to his head to end the madness within for the 10th time.\n\nMy only compaint is the XBox controller isnt perfect. Ive had issues getting it to register what I'm doing, randomly shutting off and so forth. Playing keyboard isnt an option for me because of physical issues, so I cant say if the k+M setup has the same control issues. But they are minor issues.\n\nLovecraft fans will love this one. I'd recommend it to anyone whos far more into psychological horror than gore and jumpscares horror because there isnt any of that (thank f'n god).", "timestamp_created": 1448147893, "timestamp_updated": 1448147893, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.506888", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19196839": {"recommendationid": "19196839", "author": {"steamid": "76561198079698521", "num_games_owned": 132, "num_reviews": 2, "playtime_forever": 146, "playtime_last_two_weeks": 0, "last_played": 1448234172}, "language": "english", "review": "good game. captures the eldritch horror athmosphere pretty good too. and it also has a sweet moral to the story, do. not. visit. england.\ni'll definetly come back to this game the next time i'm in the mood for some good ol' fashioned cosmic horror", "timestamp_created": 1448126606, "timestamp_updated": 1448126606, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.526675", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19196461": {"recommendationid": "19196461", "author": {"steamid": "76561198068217998", "num_games_owned": 243, "num_reviews": 4, "playtime_forever": 838, "playtime_last_two_weeks": 0, "last_played": 1469646008}, "language": "english", "review": "Had a huge amount of fun until now \nIt's like Eternal Darkness, Silent Hill and Faster then light had a kid.\nGraphics are verry ''Basic'' so if your after that, don't buy it, but you should know that from the Screenshots\n\nOther then that one of my favorite games this year.", "timestamp_created": 1448125395, "timestamp_updated": 1487947308, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.546506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19195042": {"recommendationid": "19195042", "author": {"steamid": "76561198026495852", "num_games_owned": 43, "num_reviews": 1, "playtime_forever": 5, "playtime_last_two_weeks": 0, "last_played": 1448120858}, "language": "russian", "review": "херня", "timestamp_created": 1448120904, "timestamp_updated": 1448120904, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.284993", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19186849": {"recommendationid": "19186849", "author": {"steamid": "76561197988554592", "num_games_owned": 99, "num_reviews": 3, "playtime_forever": 486, "playtime_last_two_weeks": 0, "last_played": 1495335557}, "language": "english", "review": "Huh? Write a review for it?\n\nSounds like a drag.\n\n*Commit Suicide*\n\nSeriously, though, it's great. It's psychological and subtle horror, with both the obvious and the not-so-obvious thrown together to make a great amalgamation. No bullshit jumpscare horror, no shitty Unity Asset leaping out at you from the ceiling. It's good old psychological horror as H.P Lovecraft intended.\n\nAnd it's fucking amazing. Take notes and learn, AAA developers.", "timestamp_created": 1448086614, "timestamp_updated": 1448086614, "voted_up": true, "votes_up": 18, "votes_funny": 3, "weighted_vote_score": "0.612441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19181380": {"recommendationid": "19181380", "author": {"steamid": "76561198044277874", "num_games_owned": 109, "num_reviews": 8, "playtime_forever": 1281, "playtime_last_two_weeks": 0, "last_played": 1476929870}, "language": "english", "review": "Fun fun fun.\nIs the game worth playing? Yes\nIs it worth 10 bucks? Ehhhhhhh... That'll be up to you, of course.\n\nIt's a very well written and designed game. Not scary, nor particularly distrubing, but it is very very creepy. The art direction, although very simple, is also perfectly fitting. Even the text assets are acceptable despite being default plaintext, seeing as the character is either typing it out or reading it on typed paper.\n\nThe gameplay is uniqe, as far as I know. You simply walk left and right through procedurally generated dungeons and events, shooting, bashing, looting, running, and incanting your way past your foes. You have both health and sanity to monitor, of course. What makes it fun is whodunit take on figuring out which evil entity to banish, piece by piece assembling the know how to save the world. The fittingly abiguious yet descriptive writting also helps. Yes I know that's oxymoronic, but it just works. \n\nThe challenge is tight. At first I was sceptical of the difficulty. Then I realized you drain your health kit like a bullet hole riddled tub drains water. Then I couldn't find a way to permenantly restore sanity. Then I had broken legs, a panic attack, an was gushing blood, and proceded to clear three more towns that way before dying. Shit was tense.\n\nReplayability also seems very high, which is good for a session based game like this. If you've played FTL, you'd probably find Consuming Shadow's game sessions similar in length. Besides the main gameplay supported story and unlocks, you also have a daily challenge generator, and an endless dungeon mode. The list of individual challenges you can also unlock is short, but the game makes up for it in other unlockables. It has a diary you can rebuild, page by page. It also has a typical 'bestiary', but one that unlocks word by word, creating a more rewarding 'bestiary' to fill than most every other game has.\n\nIn conclusion, sure, the game has problems. The obvious \"how did they miss that\" graphical bug, the graphics that obviously auto-scale for bigger monitors, and keys can't be rebound in the options. These little problems pale in comparison to everything it does right. Overall, I'd ask you to overlook the rough edges and buy this game if it interested you in any way.", "timestamp_created": 1448058735, "timestamp_updated": 1448058735, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.576141", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19176888": {"recommendationid": "19176888", "author": {"steamid": "76561198119501258", "num_games_owned": 312, "num_reviews": 64, "playtime_forever": 378, "playtime_last_two_weeks": 0, "last_played": 1482773650}, "language": "english", "review": "Quite good, with well done atmosphere. There is occasionally some unfair RNG, and there is a bug when you pick something up and then immediately move, your walking animation stops. However, it is well designed with very few flaws, with a lot of replay value. Recommended at full price.", "timestamp_created": 1448040729, "timestamp_updated": 1448040729, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.527271", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19176742": {"recommendationid": "19176742", "author": {"steamid": "76561198000804791", "num_games_owned": 275, "num_reviews": 24, "playtime_forever": 152, "playtime_last_two_weeks": 0, "last_played": 1460451871}, "language": "english", "review": "Pretty good so far, will update the review when I get further and/or finish one playthrough.\n\n\nSeems to be locked at 20fps, not that I mind, its just a weird cap if you ask me.\nWhen the game is fullscreened it is kinda blurry, seeing as its upscaling the game.\nAt this point I dont think I have found a way to edit the bound keys, its not something I mind since all keys are mapped to several keys and are mapped to \"generally used\" keys. Keys like movement on both WASD and arrow keys, etc.", "timestamp_created": 1448040131, "timestamp_updated": 1448040131, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.457788", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19175227": {"recommendationid": "19175227", "author": {"steamid": "76561198060463669", "num_games_owned": 145, "num_reviews": 8, "playtime_forever": 97, "playtime_last_two_weeks": 0, "last_played": 1448402648}, "language": "english", "review": "Having a lot of fun with it already, and is legitimately creepy.", "timestamp_created": 1448033874, "timestamp_updated": 1448033874, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.454630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19173349": {"recommendationid": "19173349", "author": {"steamid": "76561198151038798", "num_games_owned": 199, "num_reviews": 3, "playtime_forever": 325, "playtime_last_two_weeks": 0, "last_played": 1494325526}, "language": "english", "review": "whatched the ego review of it looked good played it and posibly Yahtzee's best game yet", "timestamp_created": 1448025141, "timestamp_updated": 1448025193, "voted_up": true, "votes_up": 7, "votes_funny": 2, "weighted_vote_score": "0.391661", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "19173029": {"recommendationid": "19173029", "author": {"steamid": "76561198120554514", "num_games_owned": 221, "num_reviews": 6, "playtime_forever": 14, "playtime_last_two_weeks": 0, "last_played": 1452452467}, "language": "english", "review": "I dont know how to start describing how good this game is. This is a genuinely creepy game. You dont need fancy graphics to make a game scary you need great atmosphere and this game has it in spades. Playing this game in a dark room with headphones will have you constantly looking over your shoulders. Just buy it the ten bucks will be well spent.", "timestamp_created": 1448023469, "timestamp_updated": 1448023469, "voted_up": true, "votes_up": 22, "votes_funny": 2, "weighted_vote_score": "0.599755", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}}}
