{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 160, "total_negative": 4, "total_reviews": 164}, "reviews": {"38721373": {"recommendationid": "38721373", "author": {"steamid": "76561198126715104", "num_games_owned": 144, "num_reviews": 11, "playtime_forever": 300, "playtime_last_two_weeks": 300, "last_played": 1514351903}, "language": "english", "review": "This is seriously one of the best roguelikes I've ever played.  So many ways to play, and so much to learn.  I'm only 4 hours in and I can tell that I'm no where close to seeing it all.  Get this game!", "timestamp_created": 1514343346, "timestamp_updated": 1514343346, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38715881": {"recommendationid": "38715881", "author": {"steamid": "76561198012450898", "num_games_owned": 137, "num_reviews": 5, "playtime_forever": 648, "playtime_last_two_weeks": 0, "last_played": 1509828700}, "language": "english", "review": "Fun roguelike. Gorgeous ASCII art (a phrase I don't think I'd ever type). Great design, and I'm keen to play it a lot more :)", "timestamp_created": 1514329899, "timestamp_updated": 1514329899, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38710785": {"recommendationid": "38710785", "author": {"steamid": "76561197985727392", "num_games_owned": 224, "num_reviews": 10, "playtime_forever": 358, "playtime_last_two_weeks": 358, "last_played": 1514354538}, "language": "english", "review": "First impression is that this is the roguelike I'd always dreamed of. Seriously; I've contemplated making something much like it for around the last fifteen years, but I'm so glad someone else has both saved me the trouble, as well as shown more imagination than I know I could have. :)\n\nMy only complaint is that it seems like floors could stand to either be slightly smaller, or have slightly more variety in terms of what can be discovered/encountered. The game is still in early access though, so there's plenty of time for that to be rectified.", "timestamp_created": 1514320201, "timestamp_updated": 1514320201, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38660172": {"recommendationid": "38660172", "author": {"steamid": "76561198057816828", "num_games_owned": 77, "num_reviews": 2, "playtime_forever": 15827, "playtime_last_two_weeks": 4738, "last_played": 1514319316}, "language": "english", "review": "Cogmind is a roguelike game, where you constantly build and rebuild your character. Your capabilities are defined by the items you acquire. There is no experience (no grinding!), you gain 'levels' by climbing to the next floor. This system makes various builds equally viable: combat, speed, stealth, all sorts of hybrids and so on. \n\nItems are not just stats +X. You will balance energy output, heat generation and support with your combat capabilities, speed and information gathering capabilities. There are over a thousand different items: weapons, power sources, cooling, propulsion, sensors, armors, shields, hackware, build and repair utilities and many, many more. Each item has a cost to use it, with more powerful items typically having bigger costs. There are various synergies and you can get some sick combos! But don't get too attached to the components you currently own, because sooner or later they WILL get destroyed. That's why you constantly need to acquire new parts (they are everywhere!) to rebuild yourself, sometimes completely respecializing to a different build type (You were a heavy tank, machine of destruction, but after a particularly tough fight not much is left of you? Time to become an ultra light jet that zips past enemies before they get a chance to act!).\n\nLevels are procedurally generated, parts you find are randomly chosen, encounters are random (reasonably!). Each playthrough will be different and you will never get bored of it. Even veterans find early levels non-trivial and thus replaying the game is interesting, challenging and fun at all times.\n\nThere is an exciting backstory which you discover as you play. With each run you find something new and new things just keep coming! It's actually really fun to hunt for these lore pieces as you play.\n\nThis game is 'turn based', but you're not waiting for your opponents to move between your turns. Everything happens immediately. If you can click fast enough, you could do a 100 turns per second. Only when you need more time to make a decision (or contemplate your inevitable doom) the game will slow down for you. Think of this 'turn based' system more like an active pause - you get as much time as you want when you want it, but otherwise game moves forward smoothly. Even better - you can fast-forward less exciting parts like exploration (when nothing of interest is found) or waiting for that patrol to pass by.\n\nI love this game: it's unique, it's challenging, I get to manage the risks I take, story is awesome and game is hugely replayable!\n\nThis game however is not for everyone and here I'd like to point out some common reasons not to buy this game (if applicable to you; you are the final judge):\n[list]\n\t[*]Randomness - there's a lot of randomness: floor layouts, encounters, parts you find. It's not a slot-machine-kind random. It's more like some card games randomness (i.e. Hearthstone). You get to make your choices and manage your risks at all times. You are guaranteed to get something and if you're versatile enough, you will get something useful. But hoping to get a very specific item will not get you this specific item most of the time. \n\t[*]Permadeath - you will die a lot and then you will need to start from a scratch. Game is designed around this, so that repeating early levels is not boring, but still challenging even after dozens of times. Having fun in such games is a matter of mindset. Remember: you are not supposed to win this game. Have fun trying out new builds and optimizing old ones. Think how can you improve, what tactics and strategies can you deploy. Learn from your loss. Try beating your previous score. I'll repeat: you are not supposed to win. Thinking otherwise will bring disappointment to you.\n\t[*]Graphics - you can see it in the screenshots and it's a common thing to drive players away from games like this one. Decide whether you're fine with it.\n\t[*]Font size - BIG WARNING HERE: UI is designed to have a certain minimum number of rows and many smaller screens (including some laptops) cannot fit this many rows of readably large font. Check this [url=http://www.gridsagegames.com/cogmind/ui_preview.html]link (provided in the game description as well)[/url] to see how this game will look on your screen.\n\t[*]Keybindings - There are multiple predefined control schemes, including pure mouse, pure keyboard, Vi keys. Custom keybindings [strike]are not a thing[/strike] require manually changing files and some players are complaining about it.\n[/list]", "timestamp_created": 1514212553, "timestamp_updated": 1514242188, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.525862", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38638434": {"recommendationid": "38638434", "author": {"steamid": "76561198073282866", "num_games_owned": 24, "num_reviews": 2, "playtime_forever": 2422, "playtime_last_two_weeks": 2422, "last_played": 1514152235}, "language": "english", "review": "I absolutely love this game!  I've enjoyed roguelikes for a while and am always impressed by the diverse concepts the indie scene nutures.  I love this style of game where you build yourself up from your fallen foes, or sneakily procure enquipment with your handy servo-mounted discount (you pilfer).  Imagine waking up in a small room with scrap parts all around.  All you know is you have to mining-claw and EM Pulse Cannon your way out of a massive complex of machines that mostly want to disassemble you (like Johny-5).  You find goodies everywhere, and mostly by taking out pesky defender driods which stand in your way.  The levels are awesomely generated and its never the same game twice.  You have to adapt to whatever surroundings you encounter.  Sometimes you get swarmed by nasty little auto cannon droids, sometimes railgun commando robots.  That's ok!  You are cogmind.  You adapt, you survive, wading through scrap heaps where your enemies used to be.  Personally, I've never seen such care and love put into a game.  Everything has its own sound.  Everything has its own animation, and they are all done beautifully!  You need to check this out.\n\nTLDR\nWhat it has:\n\nRPG style leveling up of you cogmind\nTons of Guns\nTons of equipment\nThe robots have their own ecosystem (sort of) that you can take advantage of\nYou can haxorz your way through\nYou can blast your way through\nSatisfying: Explosions, Animations, Sound Effects\nPlay casual, or play seriously\nStats galore on everything (if you are like me and enjoy that sort of thing) but its all discernable at a glance and easy to understand", "timestamp_created": 1514154596, "timestamp_updated": 1514154596, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.520000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38637903": {"recommendationid": "38637903", "author": {"steamid": "76561198063447395", "num_games_owned": 61, "num_reviews": 13, "playtime_forever": 468, "playtime_last_two_weeks": 0, "last_played": 1510011332}, "language": "english", "review": "Awesome addition to the roguelike genre!", "timestamp_created": 1514153243, "timestamp_updated": 1514153243, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38568720": {"recommendationid": "38568720", "author": {"steamid": "76561198036345543", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 9529, "playtime_last_two_weeks": 382, "last_played": 1514109742}, "language": "english", "review": "This is my personal GOTY 2017, without question. I never played a rogue like before, but the first time I saw the promotional gifs I was completely hooked: those were cool animations with ascii art! But once you start playing, the feeling of immersion is  so deep, so accomplished it blows my mind. I played a lot of hours and haven't reach the final levels yet, and, honestly, I don't want to finish this game, I want to keep having that feeling of \"ok, let's start from zero again and see where we get!\"", "timestamp_created": 1514020196, "timestamp_updated": 1514020196, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38565459": {"recommendationid": "38565459", "author": {"steamid": "76561197993930568", "num_games_owned": 4459, "num_reviews": 350, "playtime_forever": 770, "playtime_last_two_weeks": 2, "last_played": 1514013574}, "language": "english", "review": "The action on screen is a bit small and strains the eyes even at the maximum font size. There is no zoom facility.\n\nThe keys cannot be reconfigured in the program itself (you have to use ini files) and I swore never to give a positive review to a game that doesn't let you easily configure the keys.\n\nI held back from reviewing this game because I knew my review would have to be negative and I respected the dev. Recently however the dev lost my respect by promising that the game would not go more than 10% off during Early Access but then going back on his word and putting it 25% off because Valve promised him if he did this he could be featured on the front page, leading to more sales. He has attempted to justify this with a whole variety of reasons but it makes no difference.\n\nI would also suggest taking positive reviews of this game with a pinch of salt as the community is fanatical and willing to overlook any negative thing.", "timestamp_created": 1514014005, "timestamp_updated": 1514014005, "voted_up": false, "votes_up": 8, "votes_funny": 2, "weighted_vote_score": "0.244412", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true, "timestamp_dev_responded": 1514205962, "developer_response": "For clarification on the discount situation, I suggest reading my [url=http://steamcommunity.com/games/722730/announcements/detail/1578940707947408906]last weekly update[/url]. This was not a unilateral decision--I openly asked the community to help decide whether I should change the rate, and the community expressed strong support for that decision since it would be good for the future of the game.\n\npango, I also spent an afternoon adding a new feature to the latest release (Beta 4) specifically for you in order to make it more readable, with offers to make more additions and adjustments if necessary, but never got any feedback.\n\nNote: Everyone potentially interested in Cogmind should check the System Requirements, which link to the page of extensive UI previews I put together to help determine whether it's the right kind of game for your particular gaming setup: http://www.gridsagegames.com/cogmind/ui_preview.html\n\nUI improvements are included in every major release of Cogmind, largely at the request of players. An easier method of modifying the control scheme is something I'm looking into, but for now I've added presets for keyboards of different regions, and the most recent release added a WASD preset at the request of a single player."}, "38520576": {"recommendationid": "38520576", "author": {"steamid": "76561198097944841", "num_games_owned": 329, "num_reviews": 13, "playtime_forever": 11, "playtime_last_two_weeks": 0, "last_played": 1511654217}, "language": "english", "review": "This is a masterpiece. Best rogue-like i have ever played. period.\n", "timestamp_created": 1513926803, "timestamp_updated": 1513926803, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38503404": {"recommendationid": "38503404", "author": {"steamid": "76561198081649459", "num_games_owned": 1534, "num_reviews": 4, "playtime_forever": 100, "playtime_last_two_weeks": 24, "last_played": 1513996982}, "language": "japanese", "review": "ジャンルはSFだが、ADOMやCaves of Qud、TOME4などと同系統の本格派ローグライク。\n各種パーツを取り替えて自身を強化したり、敵のマシンをハックして仲間に加えたりと自由度が高く、さらには、データ量が豊富で奥も深い。それでいてバランスも取れており、一手一手じっくり考える詰め将棋的な楽しさもある。\nそして、UIがお洒落で非常に素晴らしい。すべての操作をマウスのみで行えるのはもちろんのこと、オブジェクト右クリックで詳細な説明を表示したり、メニューからアイテムを枠外にドラッグするだけでその場に捨てることが可能だったりと、数あるローグライクの中でも群を抜いて優れていると感じた。\n本格的なローグライク好きで、世界観が合う人は満足できる出来だと思う。\n\n12/23 修正と追記\n紆余曲折ありましたが、納得のいく説明がされ不安が解消したのでレビューを変更しました。\n現時点では、特に不満はありません。ゲーム自体は元から面白かったですしね。\nあえて言うなら、字が小さめでモニタに必要以上近づかなければならない点くらいでしょうか(笑)\n制作者さんと少しやり取りしましたが、自分のゲームに相当の自信を持っているようで愛も感じられました。\nなにせ制作期間が4年ですからね。(ブログに制作記があります)\n言語の壁もあるのに、誠意を持って対応してくださったのが好印象です。\n\n今後のプランもいろいろと考えているようでこれからが楽しみなゲーム。\nあとは、しっかりと更新を続けて完成させてくれることを願います。\n\n\nEAには、何度も煮え湯を飲まされているので警戒せざるを得ない。。\nなら買うなと言われそうだが、見てると欲しくなるんだから仕方ないじゃない！", "timestamp_created": 1513889085, "timestamp_updated": 1514093976, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518441", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38404117": {"recommendationid": "38404117", "author": {"steamid": "76561198263387850", "num_games_owned": 26, "num_reviews": 1, "playtime_forever": 2713, "playtime_last_two_weeks": 2713, "last_played": 1514224058}, "language": "english", "review": "This game is awesome.", "timestamp_created": 1513619879, "timestamp_updated": 1513619879, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.447625", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38390084": {"recommendationid": "38390084", "author": {"steamid": "76561198178490475", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 1686, "playtime_last_two_weeks": 949, "last_played": 1513837731}, "language": "english", "review": "This is my first Roguelike and I'm enjoying it quite a bit. Because the levels are procedurally generated, every time I play it feels new but there are strategies and interesting choices to make every time.\n\nDespite the simple graphics, there is some interesting world-building behind Cogmind and that is certainly part of what brings me back to it.\n\nThis and Darkest Dungeon are the games I've been playing the most lately.", "timestamp_created": 1513558609, "timestamp_updated": 1513558609, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.521739", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38311937": {"recommendationid": "38311937", "author": {"steamid": "76561198038892438", "num_games_owned": 69, "num_reviews": 5, "playtime_forever": 1998, "playtime_last_two_weeks": 134, "last_played": 1514343214}, "language": "english", "review": "Summary\nCogmind is a traditional turn based rogue like where you manage your robots inventory and components. You can equip your bot to be a fast flying hacker, or a tank treading missile launcher and many more!\n\nThis game does not feel like an Early Access or Beta. It is fully playable, fun, with no bugs (as far as I have seen).\nIt is an amazing traditional Roguelike with modern design and usability.\nIt is deep, full of theme, great animations and sound.\n\nPros\n- Active and transparent developer.\n- User friendly UI\n- Deep gameplay mechanics\n- Lots of surprises if you can live long enough to find them\n- Story and lore to keep you coming back to learn more\n- Very challenging\n\nCons\n- Small font might make it inaccessible to some people.\n- So far there is not much music (plenty of great sound effects though)\n- Very challenging (this could be a pro or con depending on your tastes)\n\nLong review.\nI first heard about this game on Steam and quickly starting looking in to Let's Plays and reading about it.\nI have had a hard time finding a traditional Roguelike that I enjoyed. Most had bad UI or bad controls or just did not provide enough of something new each time to interest me. I very much enjoy many modern rogueLITES (ftl, dungeon of the endless, steredenn, enter the gungeon etc..) So the ideas of traditional roguelikes are very appealing to me but most have failed to provide the experience I was hoping for.\n\nCogmind has since changed that. It provides a great focus on usability and player feedback. Animations and sounds all provide the player with the theme and feedback that makes it \"feel\" polished. Each time I play I find a bit of lore or an npc or surprise event that I have never experienced before. This really encourages that \"one more turn/floor\" feeling.\n\nCogmind requires a lot of inventory management and you will be constently making decisions on what to keep and how to \"build\" your robot. There are many \"systems\" that interact with each other and learning how everything works is a big part of Cogmind (and roguelikes in general).\n\nTrying new and weird things is encouraged by this game. After each death (and there will be many) I always think of what new \"thing\" I could try.  New robot build, new tactic, new path through the world, how do I get back to that awesome event that I just found...\n\nThe developer has been working for several years and has released a fully playable game. Why it's even early access I don't know. Just know there is more \"stuff\" to come.\n\nI feel comfortable recommending this game in Early Access at Full Price! It is well worth it. You can also check out the Gridsage game website to provide the dev with more support if you are able.\n\n", "timestamp_created": 1513293368, "timestamp_updated": 1513293368, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38284649": {"recommendationid": "38284649", "author": {"steamid": "76561198032830606", "num_games_owned": 195, "num_reviews": 6, "playtime_forever": 5076, "playtime_last_two_weeks": 2129, "last_played": 1514318472}, "language": "english", "review": "Что тут можно сказать, товарищи, игра замечательная! Рогалик нашего времени на лицо, не похожий на многие из них, уникальный во всех смыслах этого слова, если вы не играли никогда в рогалики то это ваш шанс вступить в наши ряды, а если же играли, то крепитесь - качаться здесь вы будете совершенно по-другому.\n\nКоротко перечислим плюсы и минусы данного шедевра.\nИз плюсов:\n-Как игра выглядит внешне. Да, как вы могли заметить по трейлеру (который я очень советую посмотреть, он может освободить вас от моего нудного обзора), игра прямо-таки играет красками и цветами! Красивая анимация, отличное звуковое сопровождение м просто легкое, грубокое и непринужденное погружение в игру (кому-то может показаться в тягость отсутствие музыки, но поверьте, вам и без нее понравится). Есть режим ASCII и тайлов.\n-Механика. Это игра совершенно не похожа на классические рогалики как DCSS, ADOM, Nethack и многие другие, кроме разве что пошаговости. Здесь нет ни уровней, ни опыта, ни навыков. Все здесь построено на частях вашего робота, которые в свою очередь разделены на 4 группы: источники энергии, двигательные установки , различные вспомогательные устройства и наконец оружие.\n-Пользовательский интерфейс. Здесь все особенно круто, все, что вам нужно вы поймете и получите смотря на экран не читав всякого рода инструкций (которые здесь очень четко описаны и позволяют ответить на все непонятные для вас вопросы). Все необходимые на ваше усмотрение вещи можно вывести на экран, а можно и спрятать; есть специальный продвинутый режим, в котором информация отображается детальнее (например расчет точности выстрела как формула). В начале вам предлагается играть с мышкой, но необязательно ее использовать, здесь есть клавиатурный режим по нажатии клавиши F2, ветеранам пригодится.\n-История aka лор. Эта игра далеко не просто стрелялка-бежалка. На фоне всего этого стоит довольно-таки глубокая история, в которой вам придется изрядно покопаться, ведь она здесь не просто для галочки, в ней содержится куча подсказок и получить все за раз вы не сможете, только маленькими кусочками. Вы всегда можете приостановить игру, чтобы посмотреть интересующую вас информацию.\n-Контент. Хоть вышла эта игра в Стим относительно недавно, на деле же разрабатывается более четырех лет. За это время здесь накопилась куча контента и перечислять я его могу очень долго. Из наиболее значимых: огромное множество оружия (автоматы, пушки, гранатометы, ракетные установки, магнитные установки, расщепители материи и много-много прочего), такое же количество всяческих утилит, генераторов и двигательных установок; прилично количество уровней (есть главные и есть ответвления). Все это вы можете исследовать сами, здесь есть варианты для неспешной игры и наоборот, для быстрой.\nСам разработчик при этом активно общается с игроками и участвует в сообществе и не думаю, что в скором будущем у него закончатся идеи.\n\n\nИз минусов:\n-Порог вхождения. Хоть игра и имеет достаточно внятный туториал, придется умирать и возможно даже множество раз :( Да, игра сложная (но есть уровни сложности для новичков), думаю те, кто имели опыт в играх с тактической тематикой как XCOM смогут здесь лучше обустроиться. В то же время это может оказаться плюсом, в игру вы будете входить постепенно, не торопясь и анализируя свои предыдущие ошибки.\n-Отсутствие локализации. К сожалению для многих этот пункт может оказаться решающим, без минимальных знаний английского вы врятли чего поймете и локализация в не планируется (и в принципе невозможна).\n-[НЕ ИГРОВОЕ]Цена для русского покупателя может кусаться, хоть у нас и так в основном все гораздо дешевле в сравнении с USD вариантом.\n-[НЕ ИГРОВОЕ]Ранний доступ. Для тех, кто пострадал от подделок в этой области может кольнуть в боку, но я вас уверяю, эту игру можно выпускать в релиз, хоть она и активно дорабатывается.\n\nНЕ ЧИТАЛ ЛИСТАЮ ВНИЗ: покупайте этот шедевр, поддержите разработчика и наслаждайтесь рогаликом 21 века!\nВы также можете купить игру [url=http://www.gridsagegames.com/cogmind/buy.html]на официальном сайте[/url], так он получит больше денег с нее.\n\nI may review this in English later.", "timestamp_created": 1513186989, "timestamp_updated": 1513187011, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.514011", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38281143": {"recommendationid": "38281143", "author": {"steamid": "76561197974048153", "num_games_owned": 559, "num_reviews": 6, "playtime_forever": 7112, "playtime_last_two_weeks": 687, "last_played": 1513984249}, "language": "english", "review": "244 positive reviews thus far. 3 Negative Reviews.\n\nThe proof of this game's success is in the pudding. I'm no review master, but, at 107.1 hours thus far I believe I can give you my 2 and half cents.\n\nPro's:\n-Difficult but has easy and easier modes selectable for those who are less inclinded to the harsh world of rouge likes.\n\n-ASCII or Tilesets\n\n-Nicely animated graphics\n\n-TONS of lore\n\n-TONS of weapons\n\n-You can't just run and gun to the end\n\n-Terminal hacking\n\n-Amazing mouse support (Seriously, I hardly every have to use a key)\n\n-supports 1440p\n\n-Sound effects are REALLY nice and some are very unique.\n\n-You may actually fall in love with a weapon just because the way it sounds and it's animation\n\n-Developer is active in the community and can be reached via forums or discord, and does respond to players / offer help.\n\nCon's:\n\n-It's hard (But has selectable \"easy\" and \"easier\" modes. which is a pro.)\n\n-Bit of a learning curve. Combat runs can be very hard if you don't know what your doing and just shoot everything on \nsight (I recommend a combination of guerilla tactics and hacking terminals)\n\n-No ambient music as of yet (I have read the developer is hard at work on this with someone he has been working with, just use spotify and a nice techy/space ambient playlist)\n\n\nTL;DR:Get it! You will not be dissapointed in this game. It is well worth the 20 dollars. Thats what, two pizza's, a soda, and some breadsticks? Skip pizza and have a chicken dinner or mom's speghetti one evening and this amazing game is yours.", "timestamp_created": 1513176363, "timestamp_updated": 1513176363, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.506128", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38258302": {"recommendationid": "38258302", "author": {"steamid": "76561198076394948", "num_games_owned": 173, "num_reviews": 21, "playtime_forever": 788, "playtime_last_two_weeks": 257, "last_played": 1513986387}, "language": "english", "review": "A brilliant roguelike with sleek controls and a great interface.\n\nOther roguelikes can seriously stand to learn from COGMIND, it is complex but not overwhelming, it is deep but easy to pick up. Imagine DF adventure mode, except you are a sentient robot that builds itself out of the scrap of others in a mad dash/rampage to freedom.\n\nI highly recommend it.", "timestamp_created": 1513090261, "timestamp_updated": 1513090261, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38199539": {"recommendationid": "38199539", "author": {"steamid": "76561197972310964", "num_games_owned": 367, "num_reviews": 4, "playtime_forever": 388, "playtime_last_two_weeks": 0, "last_played": 1512928426}, "language": "english", "review": "The slickest hardcore roguelike since Brogue, with heart and style.  Exploring gameplay, mechanics unvealing themselves like a lotus in bloom.  This is why I game baby.", "timestamp_created": 1512880184, "timestamp_updated": 1512880184, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38192197": {"recommendationid": "38192197", "author": {"steamid": "76561197962958145", "num_games_owned": 374, "num_reviews": 3, "playtime_forever": 35, "playtime_last_two_weeks": 0, "last_played": 1511818579}, "language": "english", "review": "Fantastic fresh roguelike game with an extremely fluid and well designed UI.  Interesting concepts that depart from some more traditional roguelike holdovers but open up the door to a different run each time.  Build your bot from the remains of foes who stand in your way.", "timestamp_created": 1512855006, "timestamp_updated": 1512855006, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38191900": {"recommendationid": "38191900", "author": {"steamid": "76561197970471279", "num_games_owned": 612, "num_reviews": 6, "playtime_forever": 414, "playtime_last_two_weeks": 0, "last_played": 1512853998}, "language": "english", "review": "Great roguelike game, seems more approachable than many roguelikes but seems to have lots of depth so far in terms of all the different ways you can mod your robot.", "timestamp_created": 1512854204, "timestamp_updated": 1512854204, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38190374": {"recommendationid": "38190374", "author": {"steamid": "76561197968598435", "num_games_owned": 1227, "num_reviews": 45, "playtime_forever": 1621, "playtime_last_two_weeks": 0, "last_played": 1508965882}, "language": "english", "review": "Cogmind is a creative and well executed roguelike with some great animations and art. \n\nI especially like the simple but sweet character development model - levels get you more item slots (you pick what slots you want on levelup) and you only get levels for progressing to the end of the game. The items you need to put in the slots tend to be fairly common or easy enough to find. For these and other reasons, there's no reason to grind. This means that every move you make is a tactical or strategic choice, never a chore you have to get out of the way before the real game begins.\n\nIt's slightly easy and short compared to other roguelikes, but I think that's a very good thing considering that I've never actually beat any roguelike games (and I've only come close to beating Cogmind, so far). There are also alternate endings, a scoring system and online leaderboards, and secret things you can do to extend replayability, so don't let the potentially short length scare you off.", "timestamp_created": 1512850211, "timestamp_updated": 1512850211, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.577988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38179386": {"recommendationid": "38179386", "author": {"steamid": "76561198025568484", "num_games_owned": 166, "num_reviews": 1, "playtime_forever": 5610, "playtime_last_two_weeks": 0, "last_played": 1512925521}, "language": "english", "review": "I dont like early access, I dont like ascii graphics and I dont like doing reviews but I saw a few play throughs on youtube and I broke my own rules (im just a rebel at heart) and brought the game...I havent regretted a moment of it. Im tottally hooked but have had to take a step back for a while as I got \"just one more go\" syndrome pretty bad. Im now breaking my final rule just to share this with you all. Hope you enjoy it as much as I do.", "timestamp_created": 1512824496, "timestamp_updated": 1512824496, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.689803", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38150816": {"recommendationid": "38150816", "author": {"steamid": "76561197960445532", "num_games_owned": 540, "num_reviews": 13, "playtime_forever": 33, "playtime_last_two_weeks": 0, "last_played": 1510294850}, "language": "english", "review": "It's no Nethack.", "timestamp_created": 1512732681, "timestamp_updated": 1512732681, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.230493", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38045958": {"recommendationid": "38045958", "author": {"steamid": "76561197988476980", "num_games_owned": 384, "num_reviews": 6, "playtime_forever": 879, "playtime_last_two_weeks": 137, "last_played": 1513195283}, "language": "english", "review": "This game is hard as hell and that's good, get this if your not scared of a challenge.", "timestamp_created": 1512344511, "timestamp_updated": 1512344511, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.464773", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38044607": {"recommendationid": "38044607", "author": {"steamid": "76561198006841109", "num_games_owned": 196, "num_reviews": 4, "playtime_forever": 571, "playtime_last_two_weeks": 1, "last_played": 1514145945}, "language": "english", "review": "If you're new to roguelikes I would recommend this. You can easily play mostly with a mouse without a problem. Has a very good looking tileset than most roguelikes, and has some very interesting mechanics like: Hacking terminals for lore, hacking terminals for blueprints to make weapons later on into the game, weapons that feel very different in terms of affects (Lasers doing heat damage, shock giving a chance to instantly explode an enemy, normal damage with projectile weapons.), and much much more. I would give it a 8.5/10 out of all roguelikes I've played.", "timestamp_created": 1512339161, "timestamp_updated": 1512339161, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38016759": {"recommendationid": "38016759", "author": {"steamid": "76561197994311164", "num_games_owned": 116, "num_reviews": 15, "playtime_forever": 1014, "playtime_last_two_weeks": 0, "last_played": 1508442572}, "language": "english", "review": "Game is in late stages of EA. All that's left is some spit & polish.\n\nVets tell me once you get past the steep learning curve, the fun starts to kick in. Never got past that curve and the journey towards that goal wasn't any fun. As far as difficulty, it's hard but not in a good way. Cheap and too much RNG based. The take away feeling I got from failed runs with this is \"Better luck next time, chump\".", "timestamp_created": 1512253831, "timestamp_updated": 1512253941, "voted_up": false, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.464431", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37942983": {"recommendationid": "37942983", "author": {"steamid": "76561198048886915", "num_games_owned": 152, "num_reviews": 5, "playtime_forever": 35, "playtime_last_two_weeks": 0, "last_played": 1512007364}, "language": "english", "review": "I watch rick and morty, so I'm smart enough to understand how this game works. If you haven't watched rick and morty then do not buy this game, It will be too hard for you to play. I've played over 4000000 ours on this game and it's really good.", "timestamp_created": 1512008805, "timestamp_updated": 1512008805, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.382506", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37886942": {"recommendationid": "37886942", "author": {"steamid": "76561197972150531", "num_games_owned": 446, "num_reviews": 83, "playtime_forever": 1183, "playtime_last_two_weeks": 9, "last_played": 1513184305}, "language": "english", "review": "Very stylish, cool theme, new ideas, very good job. Pick this up even for the price it is better than a lot of roguelikes", "timestamp_created": 1511880240, "timestamp_updated": 1511880240, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.486517", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37845283": {"recommendationid": "37845283", "author": {"steamid": "76561198068174100", "num_games_owned": 77, "num_reviews": 1, "playtime_forever": 5139, "playtime_last_two_weeks": 0, "last_played": 1512422916}, "language": "english", "review": "Came for the premise, stayed for the lore. It's a masterpiece.", "timestamp_created": 1511837309, "timestamp_updated": 1511837309, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.458048", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37751352": {"recommendationid": "37751352", "author": {"steamid": "76561198014654537", "num_games_owned": 172, "num_reviews": 3, "playtime_forever": 3406, "playtime_last_two_weeks": 92, "last_played": 1514085201}, "language": "english", "review": "Everything about this game is pretty much amazing. The setting, sparse lore (somewhat like Dark Souls the plot is revealed in small snippets and item or environmental clues, very little is forced on you), and mechanics are all master classes in design and implementation.\n\nThe game is hard, you will die a lot. When you're first beginning and are still learning the mechanics it will often seem completely random when you perish. Fret not, as soon as the mechanics start to make sense and you figure out how the gear works you'll realize that there are a plethora of resources available. If you've played Don't Starve it mirrors that beginner's experience in a lot of ways. At first it seems almost impossible to scrape through winter, or the first 3 levels of Cogmind, but after a little experience you'll see resources everywhere. Unlike the traditional rogue-likes, games like Nethack or Dungeon Crawl Stone Soup, Cogmind has much better balance and there's not really any filler gear that isn't very useful. Moreover, the awesome mechanics of the game allow an insane amount of characer customization without using experince points or needing any grinding. Its a hard mechanic to describe and you'll have more fun figuring it out yourself so I'll leave it at that. \n\nThe interface makes you feel like an operator in the Matrix, the whole aesthetic is simply awesome. While the game has no music at the moment the sound effects and visual animations are excellent while still adhereing to the ASCII asthetic that the game is a clear homage to.\n\nAll in all this is a fantastic title that has managed to be the best RPG and strategy/tactics game I've played this year, the story is gripping and gives me a good reason to dive back in even if all I manage to do is unlock a couple extra lore pieces. There are also a lot of factions with different agendas in this game and ambient robot ecosystems going on that give the world a deeply immersive feel.", "timestamp_created": 1511761617, "timestamp_updated": 1511761617, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37734148": {"recommendationid": "37734148", "author": {"steamid": "76561198006984808", "num_games_owned": 228, "num_reviews": 2, "playtime_forever": 86, "playtime_last_two_weeks": 0, "last_played": 1509382685}, "language": "english", "review": "Fun game with an interesting interface design that becomes better as you play.", "timestamp_created": 1511742616, "timestamp_updated": 1511742616, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37705089": {"recommendationid": "37705089", "author": {"steamid": "76561197998899422", "num_games_owned": 98, "num_reviews": 5, "playtime_forever": 1425, "playtime_last_two_weeks": 0, "last_played": 1512059537}, "language": "english", "review": "Cogmind is a tasty, quick roguelike (turn-based, permadeath) with a futuristic flavor and savory text-mode (with tileset) graphics (awesome explosions!) based not on leveling abilities but combining scavenged items to construct a winning character.   Procedural levels with a huge array of loot make for high replayability.   Very easy to get into and pick up whenever (lunch-mode, save/resume anytime).   Fully configured for keyboard and/or mouse control.  Still in Early Access but polished and well supported by the developer and community.", "timestamp_created": 1511722022, "timestamp_updated": 1511724288, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37682387": {"recommendationid": "37682387", "author": {"steamid": "76561197976402862", "num_games_owned": 372, "num_reviews": 2, "playtime_forever": 329, "playtime_last_two_weeks": 0, "last_played": 1511680802}, "language": "english", "review": "One more run!", "timestamp_created": 1511709988, "timestamp_updated": 1511709988, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37414728": {"recommendationid": "37414728", "author": {"steamid": "76561198006882314", "num_games_owned": 55, "num_reviews": 2, "playtime_forever": 1150, "playtime_last_two_weeks": 416, "last_played": 1514313315}, "language": "english", "review": "best get swarmed by pests and die game ive ever played 10/10", "timestamp_created": 1511556648, "timestamp_updated": 1511556648, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.446194", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37256707": {"recommendationid": "37256707", "author": {"steamid": "76561197981915849", "num_games_owned": 565, "num_reviews": 2, "playtime_forever": 627, "playtime_last_two_weeks": 0, "last_played": 1511494622}, "language": "english", "review": "Really fun game.", "timestamp_created": 1511494586, "timestamp_updated": 1511494586, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.467033", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37222740": {"recommendationid": "37222740", "author": {"steamid": "76561198005285810", "num_games_owned": 113, "num_reviews": 10, "playtime_forever": 67, "playtime_last_two_weeks": 0, "last_played": 1511477043}, "language": "english", "review": "This is a beautiful looking ASCII art that gives pixel art and cel-shading a run for their money. The game has a lot of depth and complexities that will take me a while to fully grasp. Definitely worth playing for those who love classic style hacking, terminals and a cyberpunk turn-based combat experience.", "timestamp_created": 1511477203, "timestamp_updated": 1511477203, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36989925": {"recommendationid": "36989925", "author": {"steamid": "76561197979935825", "num_games_owned": 434, "num_reviews": 3, "playtime_forever": 3106, "playtime_last_two_weeks": 0, "last_played": 1513025785}, "language": "english", "review": "Absolutely wonderful Roguelike.\n\nBrilliant graphics that leave you giddy each time you create an explosion that creates a delightful chain reaction of more explosions. Cogmind also features a vast array of sound effects that genuinely immerse you in the robotic world around you.\n\nThe developer is also very active within the roguelike community.", "timestamp_created": 1511428170, "timestamp_updated": 1511428170, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36894304": {"recommendationid": "36894304", "author": {"steamid": "76561198067530627", "num_games_owned": 374, "num_reviews": 7, "playtime_forever": 9142, "playtime_last_two_weeks": 2595, "last_played": 1514170172}, "language": "japanese", "review": "ロボットになって自分のパーツをとっかえひっかえしながら地下施設を上っていくローグライク。\nライトじゃないほうのローグライクなので、「最低限の説明はしたからあとは自分で攻略法見つけるのを楽しんでね！」というスタンスのゲームです。つまり、ゲームの流れやメカニクスを把握するまで根気が必要になります。ストアの説明を読んで、自分の好みに合うか確認してから買いましょう。難しすぎると感じたら設定からEasier Modeを活用すると楽です。\n定価2,000円は、買う側の視点からすれば正直高めだと思いますが、内容はプレイを重ねるほどしっかり作りこまれているのがわかります。がっつりやってやるぞ！という人におすすめ。\n\n[h1]良い点[/h1]\n+ 戦い方やビルドを手に入ったパーツに合わせて柔軟に変えていくのがダイナミックで楽しい。クラス・スキルといったものはないが、パーツ（装備）スロットの配分によるキャラビルドはあり、方針が必要とはいえ決め打ちにならないバランスが絶妙。\n+ 敵の行動システムや壊れる壁のおかげで、他のローグライクに比べて立ち回りがユニークになっている。\n+ 1回のプレイ時間が短め（[url=http://steamcommunity.com/app/722730/discussions/0/1483235412204449930/#c1483235412204503883] ビルド次第だが4時間ぐらいまで [/url]）で、なにかを稼ぐような作業もなく、面白い時間の密度が高い。\n\n[h1]悪い点[/h1]\n- タイル（アイコン）の視認性がいまいち。似たような形をしていてぱっと見で区別がつきにくいものが結構ある。比較的頻繁にパーツを吟味したり交換したりするこのゲームでは少しつらい。\n- ミニマップがなく、マップ全体を眺めたいときはスクロールして見る必要があり不便。", "timestamp_created": 1511402400, "timestamp_updated": 1514004618, "voted_up": true, "votes_up": 27, "votes_funny": 0, "weighted_vote_score": "0.769381", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36883779": {"recommendationid": "36883779", "author": {"steamid": "76561198061938080", "num_games_owned": 69, "num_reviews": 7, "playtime_forever": 439, "playtime_last_two_weeks": 6, "last_played": 1513642917}, "language": "english", "review": "Cogmind has been in development for a few years because the dev wanted it to be the best it could be instead of just 'playable'. The game is great right now, and the only reason it's in Early Access is because the dev is still constantly pushing out more QoL updates.", "timestamp_created": 1511399838, "timestamp_updated": 1511399838, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36834804": {"recommendationid": "36834804", "author": {"steamid": "76561197996356731", "num_games_owned": 148, "num_reviews": 2, "playtime_forever": 1104, "playtime_last_two_weeks": 0, "last_played": 1511390049}, "language": "english", "review": "Wow, what a thrill.\n\nThe creator of this game is not wrong when he says it is basically finished.\n\nThe story feels whole.  It is challenging.  There are many different ways to play.  It has an integrated leaderboard, if you'd like to participate in that, and see where you stack up.\n\nIt can be in ascii, or not.\n\nIt is a game you get a little better at each time you play.  If you enjoy turn-based dungeon-crawl type games, you would enjoy this one.\n\nRefreshing too, is the sci-fi aspect.  It seems like more games in this genre steer towards a more dungeons and dragons feel.  \n\nIn Cogmind, we have computers to hack!  Lasers to pew with!  Rockets to blomp all over the place!  Nifty parts to help you hack other bots and make them your friend!\n\nAny of the above sound good to you?  Do your self a favor.  Get this game.", "timestamp_created": 1511389296, "timestamp_updated": 1511389296, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36823421": {"recommendationid": "36823421", "author": {"steamid": "76561198005851620", "num_games_owned": 438, "num_reviews": 16, "playtime_forever": 540, "playtime_last_two_weeks": 0, "last_played": 1511387517}, "language": "english", "review": "This game makes the cogs in my brain spin.", "timestamp_created": 1511387495, "timestamp_updated": 1511387495, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36796402": {"recommendationid": "36796402", "author": {"steamid": "76561197973848124", "num_games_owned": 263, "num_reviews": 1, "playtime_forever": 2829, "playtime_last_two_weeks": 0, "last_played": 1511383222}, "language": "english", "review": "This is the most polished roguelike game I haave ever played. Hard and challenging but also very rewarding. The story and lore slowly unfolds each run you take and while also teaching you new strategies. Very entertaining sucking you into the world sure to keep you occupied for hours.\n", "timestamp_created": 1511383707, "timestamp_updated": 1511383707, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": true, "written_during_early_access": true}, "36770096": {"recommendationid": "36770096", "author": {"steamid": "76561198043964160", "num_games_owned": 679, "num_reviews": 3, "playtime_forever": 2917, "playtime_last_two_weeks": 0, "last_played": 1512544453}, "language": "english", "review": "I've been following the development process of this game for quite a while, which inevitably led to a fair amount of hype on my end, and after actually getting to play Cogmind I can say the following: it's spectacular on so many levels, it's not even funny.\n\nGameplay? Check. Combat is very satisfying, with positioning and tactics being very important if you wish to get rid of your enemies as quickly and painlessly as humanly (or, well, [i]robotically[/i] in our case) possible, and believe me: ideally you want to be operating at top efficiency. Winning a skirmish or ten isn't going to do you much good when you have a war to win, with attrition being a very real and sizable threat, so you have to think ahead, and in order to be able to do so you'll need a very solid understanding of the way the game works, and combat mechanics are just one piece of the puzzle.\n\nGraphics? Check. Classic ASCII mode is available (and toggleable with a single keystroke) if that's your thing. Otherwise there's a very solid tileset at your disposal, as well as fancy animations, juicy explosions, and whatnot.\n\nAccessibility? Check. Tutorial and in-game manual are there to guide you, covering just about everything you need to do. You can play the game relying strictly on your keyboard and nothing else, but mouse support is there as well, and it's extremely smooth. The UI feels just right: it works perfectly well right out of the box without any tweaks whatsoever, but if you need more/different info, that can be arranged. Combine all this with I've said about the graphics, and you get something that can appease both the veteran of the genre and the newcomer alike. Finally, there's a number of difficulty settings, so if Cogmind is tormenting you a bit too mercilessly on the default difficulty, there is a way out.\n\nSetting/plot? Check. Can't say I'm fully familiar with both at this point, but I believe I've seen enough to say that whatever is going on here, it's pretty damn intriguing. Let's just say that if an NPC appeared before me, offering me either a local equivalent of BFG or a piece of lore I haven't encountered yet, it'd be a tough call to make.\n\nLong story short, Cogmind is a fantastic roguelike. It stays true to the genre's roots, but at the same time it's undeniably a modern game, and what we have in the end is an immensely satisfying experience.", "timestamp_created": 1511380583, "timestamp_updated": 1511380707, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36697145": {"recommendationid": "36697145", "author": {"steamid": "76561198079265747", "num_games_owned": 71, "num_reviews": 17, "playtime_forever": 1436, "playtime_last_two_weeks": 0, "last_played": 1512298724}, "language": "koreana", "review": "튜토리얼도 없고 한글화도 없다니 내 씹마조 취향을 자극하잖아?", "timestamp_created": 1511355942, "timestamp_updated": 1511652617, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36693006": {"recommendationid": "36693006", "author": {"steamid": "76561197982726814", "num_games_owned": 489, "num_reviews": 18, "playtime_forever": 571, "playtime_last_two_weeks": 0, "last_played": 1511594051}, "language": "english", "review": "A deep, tactical and attractive sci-fi roguelike.\n\nYour robot wakes up in a scrapheap and must escape, needing to constantly redesign itself along the way.   Only played for a few hours and I've already encountered over a hundred different modules.  The dev says there's almost a thousand and I believe him. There's a huge variety to the parts which allows for a lot of different play styles.  \n\nThe presentation is also appealing; the sound effects are superb and so are the flashy ascii effects.  Mostly everything can be mouse-driven but there's also a lot of default keyboard shortcuts that help with the micromanagement you'll need for your modules and exploration.  The amount of information on the screen can seem overwhelming at first but the interface is competently designed and easy to navigate.\n\nJudging by what I've played so far (as well as other reviews) this game is already a complete experience that can only get better from here.  An early access scrapheap this is not.  The dev seems quite passionate and the game is already quite polished.", "timestamp_created": 1511343476, "timestamp_updated": 1511343961, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.553675", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36670505": {"recommendationid": "36670505", "author": {"steamid": "76561198078891853", "num_games_owned": 82, "num_reviews": 9, "playtime_forever": 11410, "playtime_last_two_weeks": 1349, "last_played": 1514364216}, "language": "english", "review": "Sometimes I have to switch builds entirely after making a run for it and it's an interesting experience to scavenge for replacement parts.", "timestamp_created": 1511245913, "timestamp_updated": 1511245913, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.570991", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36622694": {"recommendationid": "36622694", "author": {"steamid": "76561198309841263", "num_games_owned": 276, "num_reviews": 15, "playtime_forever": 1294, "playtime_last_two_weeks": 0, "last_played": 1512984252}, "language": "english", "review": "Wow.  Just...  I am always prowling for LEGIT rogue-likes on Steam - that add a LITTLE something to the old formula beyond the exhausting world size and character classes and inane quests etc. - and they are few and far between.  I saw this and immediately added to wishlist.\n\nAn hour later I bought it because I couldn't take my mind off it.  It looked too damn good.\n\nI make an effort to avoid EA games, but wow...  This is one I am more than happy to support in its development, and REALLY look forward to seeing in the future.  Only thing I'm really missing at this point is more sizing and scale options, since on my large display, everything is tiny.  Well worth the asking price.\n\nWhat you get is a brutally challenging ACTUAL rogue-like with amazing (and amazingly fitting) art and sounds, brilliantly unique setting and mechanics, and deep customization of your runs through items and strategy - the lot.  And I feel I've really only scratched the surface at my ~7hr playtime.", "timestamp_created": 1511096821, "timestamp_updated": 1511096821, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36581268": {"recommendationid": "36581268", "author": {"steamid": "76561198072268566", "num_games_owned": 57, "num_reviews": 1, "playtime_forever": 623, "playtime_last_two_weeks": 0, "last_played": 1509769428}, "language": "english", "review": "Excellent game, made by someone who really understands what makes roguelikes fun.  Somehow, the game is also highly atmospheric with amazing sound design and visuals.\n\nAlso, you can play with just a keyboard, just a mouse, or both.", "timestamp_created": 1510954611, "timestamp_updated": 1510954611, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.567901", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36517789": {"recommendationid": "36517789", "author": {"steamid": "76561197975469301", "num_games_owned": 861, "num_reviews": 1, "playtime_forever": 550, "playtime_last_two_weeks": 0, "last_played": 1510798622}, "language": "english", "review": "The animated ASCII engine is worth the price of admission alone.  I am blown away by it with every menu opening, corruption glitch, and explosion.\n\nAnd the game is good too.  I really like that your power level comes from adding attachment points and the equipment loadout instead of from generic \"levels\" that bump your hp, attack, and defence.", "timestamp_created": 1510688173, "timestamp_updated": 1510688173, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36499277": {"recommendationid": "36499277", "author": {"steamid": "76561197971726230", "num_games_owned": 320, "num_reviews": 11, "playtime_forever": 453, "playtime_last_two_weeks": 0, "last_played": 1511030629}, "language": "english", "review": "5minutes into the game, I can already say it will be a great roguelike. Fuck. Congratz guys, as a long time roguelike player, DIS IS 乇乂ㄒ尺卂 ㄒ卄丨匚匚", "timestamp_created": 1510605882, "timestamp_updated": 1510605882, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497925", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36479025": {"recommendationid": "36479025", "author": {"steamid": "76561198005180927", "num_games_owned": 351, "num_reviews": 28, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1510571117}, "language": "russian", "review": "Отличная игра, но надо немного разобраться. Советую всем любителям рогаликов и роботов )))", "timestamp_created": 1510519593, "timestamp_updated": 1510519593, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502488", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36454090": {"recommendationid": "36454090", "author": {"steamid": "76561198030811481", "num_games_owned": 563, "num_reviews": 7, "playtime_forever": 5853, "playtime_last_two_weeks": 0, "last_played": 1512361497}, "language": "english", "review": "Dangerously addictive", "timestamp_created": 1510436390, "timestamp_updated": 1510436390, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.518064", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36436057": {"recommendationid": "36436057", "author": {"steamid": "76561197971240868", "num_games_owned": 171, "num_reviews": 2, "playtime_forever": 9472, "playtime_last_two_weeks": 650, "last_played": 1514253869}, "language": "english", "review": "Love the interface - it's functional, clean, sticks to the ASCII terminal hacker aethetic without actually limiting functionality to 90's style terminals that we are stuck with at work. Entirely possible to play the game with just the mouse, but using keyboard hotkeys or just straight keyboard mode is very natural. It's sort like of a perfected version of gVIM - powerful hotkeys at your disposable married with the versitility of the mouse. \n\nNever before have I been so satisfied at ASCII explosions and EM waves put together out of tile graphics. In this respect, Cogmind is top of its class. Graphical developers everywhere should take cues from how Cogmind renders game events in a way that gives both visercal satisfaction at seeing your enemies torn to shreds, as well as concisely communicating information to the keen player.\n\nThe game itself is fun, and the concept of \"put yourself back together with parts scavenged from dead enemies\" is very well applied. In fact, the entire game is balanced around part availibility from finding them in random rooms and killing your enemies, which is something quick players will adapt to easily. Your first win might be out of sheer luck after at least several failed runs where you learn more and more, but experienced players can win reliably (although going for high scores does take some luck and playing the same seed multiple times for optimal moves).\n\nMultiple branches already in the game, with more on the way. Experienced players will be able to plan out what branches they want to take, determining a large part of their build and victory method.\n\nPlenty of lore for the nerds to dig deep into. It will take many runs to discover the various events, dialogue options, and general gameplay options availible to the player.\n\nWell worth the price, in fact I wouldn't mind paying double for all the polish and content that has clearly gone into the game. Satisfying games like this one are rarer than they ought to be.", "timestamp_created": 1510383763, "timestamp_updated": 1510383763, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36432556": {"recommendationid": "36432556", "author": {"steamid": "76561198026063552", "num_games_owned": 95, "num_reviews": 1, "playtime_forever": 12052, "playtime_last_two_weeks": 0, "last_played": 1510587007}, "language": "english", "review": "It's about time I write a review, my first ever actually, on a game and most importantly a developer that truly deserves it.\n \nThere is lots of roguelikes out there nowadays and the definition of such varies about as much as plain opinions do. To me, Cogmind is a true roguelike in a modern style. While you can play in ASCII and keyboard mode, the game offers a tileset that feels and stays true to its initial look along with a very well done mouse control, which can be played mouse-only or hybrid with keyboard. It takes a lot of work to implement both this well, especially by only one person creating it and I consider this a big freaking plus, because we, the players, have the option and can choose whichever we prefer. Along with a clean UI that provides all necessary information at most a press of a button away, you will rarely find this amount of polish in an EA game.\n \nAs for the gameplay, it's got the basic roguelike features of being turn-based and randomly generated maps (along with many handcrafted parts). Since it's placed in a futuristic setting, it introduces a new type of equipping yourself besides the standard head, torso, four limbs etc. gear which I found is a very refreshing idea. This also opens up the possibility for very different builds and such different approaches of playing the game. The \"true\" roguelike part however definitely comes from its hidden mechanics - Cogmind is brutally hard, many struggle just getting through the early game, but this is by design. You are supposed to learn and improve slowly until you get a feeling for what's happening, influencing it to your advantage and thus increasing the chance of survival. There is no handholding, nor will you find precise answers on how these mechanics work, you'll get hints at most. Now I do understand that this may throw people off, the main reason why I'm mentioning it and you can trust me, I have also raged at the game, many times... but that's sort of the point of a roguelike, because once you get better, it provides a rewarding experience not many games are capable off.\n \nI have around 200 hrs into the game and can (somewhat) reliably win a run, but true roguelike also means, I am merely increasing my chances, things can and will go wrong. Then again, this is not where Cogmind ends, there is a ton of optional areas available with lots of lore to be found, some of which will lead to different endings. You could consider them an extra challenge, while they do provide benefits, getting there is usually way harder than just advancing on the main path and I have yet to see them all. While every world seed has all of the optional stuff in it, they are not always on the same level, so even if you aim for something specific, you may end up somewhere completely different, which makes for quite unique runs overall. Also, if you're the completionist type, bring a lot of time, because you will need way more than what I've invested so far.\n \nIf you are concerned about the EA label, don't be. Cogmind is a complete game already, along with lots of content and a polish I'd wish some finished products would have. Yet, the developer is still improving on the game, even though being hindered by a severe injury currently, he invests a lot of time and is very responsive on the forums. Only if you're new to the roguelike genre, especially the turn-based variant (real-time is just, well... different), I'd say start with something \"lighter\". For the rest of you, I do not see a single reason why you would not get you're money's worth out of this great game. I, for my part, am really not satisfied easily, but Cogmind has provided me with so many different and fun-filled runs so far that I'm inclined to call it the best roguelike experience I have had, ever.", "timestamp_created": 1510368552, "timestamp_updated": 1510368552, "voted_up": true, "votes_up": 30, "votes_funny": 0, "weighted_vote_score": "0.735222", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36331702": {"recommendationid": "36331702", "author": {"steamid": "76561198190448867", "num_games_owned": 49, "num_reviews": 5, "playtime_forever": 701, "playtime_last_two_weeks": 0, "last_played": 1510606938}, "language": "english", "review": "This game turned out to be exactly what I needed.\n\nIt's turn based, so there's never any rush to play it - if I need to go do something, I simply get up and do it, the game will wait.\n\nIt can be played exclusively with the mouse/one hand. For those who are interested, it appears to be possible to play it exclusively with keyboard as well. Or - of course - a combination.\n\nThe interface is superbly polished and the attention to detail is outstanding. The whole thing is made to look like it's rendered in a terminal which enhances the experience greatly. It even has an ASCII mode that transforms the map into a fully functional ASCII rendered game world (which I prefer). The animations are unobtrusive but very sleek.\n\nIt is however - like most roguelikes - not very beginner friendly. It's not outright hostile, but you need to be prepared to put in some time to learn the game. To me, that is a plus, your mileage may vary. Somewhat related to this point: The amount of information that is relayed to the user can be pretty daunting at first viewing. But as I mentioned, this will make sense as you learn the game.\n\nThe game is a labor of love and it shows.", "timestamp_created": 1510008884, "timestamp_updated": 1510008884, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.674717", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36296480": {"recommendationid": "36296480", "author": {"steamid": "76561198064414264", "num_games_owned": 2292, "num_reviews": 18, "playtime_forever": 24192, "playtime_last_two_weeks": 0, "last_played": 1512331966}, "language": "english", "review": "Mostly just a recommendation for friends into roguelikes.\n\nDon't pass up on this, I'm glad I didn't.\n\nTwo hastily assembled digits up. \n\n001100\n010010\n011110\n100001\n101101\n110011", "timestamp_created": 1509884312, "timestamp_updated": 1510072534, "voted_up": true, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.523678", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36273437": {"recommendationid": "36273437", "author": {"steamid": "76561198004106033", "num_games_owned": 268, "num_reviews": 2, "playtime_forever": 334, "playtime_last_two_weeks": 0, "last_played": 1511572071}, "language": "english", "review": "I wholeheartedly recommend this game to anyone who considers themselves a fan of the roguelike genre. \n[list]\n[*]The intuitive UI coupled with mouse controls makes the game comparatively easy to pick up, although if you are new to the genre it will still feel like jumping in at the deep end.\n\n[*]The way that items work makes the game feel like a frantic scramble at times, where you are constantly equipping new weapons and such trying to make it work. It also makes it possible, even good idea at times, to completely switch up your playstyle if you find the right items. All in all I would say it is probably the most dynamic 'old-school' roguelike I have ever played. The absence of experience is a breath of fresh air as well.\n\n[*]Playing the game feels like exploring a little microcosm of robots going about their businesses, and in my opinion the lore is very engaging.\n\nAll considered it is probably already my favourite game to come out on steam this year!", "timestamp_created": 1509810750, "timestamp_updated": 1511571998, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36236953": {"recommendationid": "36236953", "author": {"steamid": "76561198010278105", "num_games_owned": 367, "num_reviews": 10, "playtime_forever": 288, "playtime_last_two_weeks": 0, "last_played": 1510040657}, "language": "english", "review": "It's nethack but with robots and grenade launchers", "timestamp_created": 1509699779, "timestamp_updated": 1509699779, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.525360", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36234488": {"recommendationid": "36234488", "author": {"steamid": "76561197979816480", "num_games_owned": 300, "num_reviews": 1, "playtime_forever": 17201, "playtime_last_two_weeks": 0, "last_played": 1512580679}, "language": "english", "review": "Screenshots really don't do this game justice at all. Yes, it's ASCII, but it's handled so beautifully that you barely notice. Recently won for the first time, and got an amazing animated sequence. Lore is something I'm still digging into, but what I have seen is impressive.\n\nIt can be a difficult game, but it rewards thinking about your actions and I can have trouble remembering to do that at times.", "timestamp_created": 1509689117, "timestamp_updated": 1509689117, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36224807": {"recommendationid": "36224807", "author": {"steamid": "76561197974149758", "num_games_owned": 528, "num_reviews": 10, "playtime_forever": 4786, "playtime_last_two_weeks": 1166, "last_played": 1513691938}, "language": "english", "review": "Excellent Rougelike, one of the most polished I've played. While Early Access the game is feature-complete at this stage and can be fully played/beaten. \n\nThe game caters to both hardcore and more casual rougelike fans through it's options and settings. \n\nThe game's default settings are more of a 'lite' experience that lets casual or new plays focus on higher-level strategies, but hard-core players have opitions for surfacing more information of systems so you can really get into the nitty-gritty if that is what you prefer. \n\nThe game has a very nice tileset design, but full ASCII is supported as well. There are sfx and eventually music will be added. \n\nThe gameplay is excellent. It scratches that pure rougelike itch of getting thrust into a world and learning its systems to get better through subsequent playthroughs. \n\nThere is a ton of lore to the gameworld as well- every system makes ingame sense. This helps fill out the world and really gets me into the game. Thankfully, the lore/story does not get in the way of the gameplay and can actually be ignored if you wish. \n\nIf the pricepoint bothers you for a rougelike I will just say that this is HEAVILY POLISHED. With the pricepoint you get the security of knowing that the devolper is devoting full-time to adding features and fixing bugs. \n\nThis game in particular has one of the most active inde-devs I've seen and they are very transparent with their devolpment process and where their development hours are spent. Incredibly active on social media platforms as well. If you have a particular problem with the game I would not doubt you could get direct-developer assistance via the forums.", "timestamp_created": 1509650530, "timestamp_updated": 1509650530, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.512821", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36174252": {"recommendationid": "36174252", "author": {"steamid": "76561198056829884", "num_games_owned": 314, "num_reviews": 2, "playtime_forever": 356, "playtime_last_two_weeks": 0, "last_played": 1509923763}, "language": "english", "review": "A beautiful and intricate roguelike with interesting twists that I recommend for new and old players to the genre alike. Straightforward to get into with a nice little tutorial, this game jumps you right into the action. A ton of fun to be had with the many different playstyles that you can choose to do, this game lets you be in control in how you want to play.", "timestamp_created": 1509477708, "timestamp_updated": 1509477708, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36174161": {"recommendationid": "36174161", "author": {"steamid": "76561198021160396", "num_games_owned": 69, "num_reviews": 2, "playtime_forever": 1755, "playtime_last_two_weeks": 0, "last_played": 1511374296}, "language": "english", "review": "This game fixes my biggest dislike within traditional roguelikes: user friendliness. The tutorial is useful, but not pushy. The learning curve ramps up very pleasantly and [b]you can do anything you want using only the mouse![/b] The in-game manual is easy to search through and rather helpful. There are also quick references for keybindings.\n\nI'll be honest, I first bought this game because it looked very pretty (for a traditional roguelike) but 20 hours in and I'm just in love with the core mechanic! Not only is it thematically appropriate, but it creates what many games are lacking these days: [i]meaningful choice[/i]. It gives you the option of changing playstyles mid-way through a run and, after a particularly nasty battle, it enables you to quickly get yourself to a functional level.\n\nThe game tells its story through entries you can unlock while playing by hacking terminals. They are written in-universe and, although reading them is completely optional (alongside the entire story) I found them to be very rewarding.\n\nIf you've ever been on the fence about traditional roguelikes, this game is perfect for you. The level of polish and care this game has is astounding. Its user-friendliness and accessibility are really pushing the boundries of the genre.", "timestamp_created": 1509477425, "timestamp_updated": 1509477425, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.648120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36158742": {"recommendationid": "36158742", "author": {"steamid": "76561198011513057", "num_games_owned": 171, "num_reviews": 10, "playtime_forever": 13073, "playtime_last_two_weeks": 1, "last_played": 1513911643}, "language": "english", "review": "I'm one of the few who didn't know about this game before steam release.  It is quite easy to learn, and extremely challenging.  A lot of thought and strategy go into playing this game, you can't really lose due to \"bad luck.\"  It really doesn't need the EA label, it's a complete game and incredibly in depth.", "timestamp_created": 1509430823, "timestamp_updated": 1509430823, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.529148", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36121482": {"recommendationid": "36121482", "author": {"steamid": "76561197986041158", "num_games_owned": 152, "num_reviews": 3, "playtime_forever": 1425, "playtime_last_two_weeks": 8, "last_played": 1514187730}, "language": "english", "review": "Seriously one of the most engaging roguelikes I have had the pleasure of playing. If you are here you know the frustating events that happen in most roguelikes causing you to start over after your first 100 turns.\n\nKey differences against other roguelikes:\n\n[olist]\n[*] RNG death is very rare if it even exists. Choices you make are what get you killed. You are given the information to make good decisions, there are few random unknowns. No more having to drink every potion and die just to find out what it does.\n\n[*]Multiple weapon/damage types in a sci-fi setting. A huge welcome change to sword and magic. Blast your enemies with electromagnetic weapons, melt them with thermal. Blow the whole damn room up with rockets, or smash in their face with a hammer!\n\n[*]All parts you equip (you are a robot built from the parts you find) can be destroyed but also repaired at special stations. Find new parts from fallen enemies (if you didn't use a weapon that obliterated them) or find them in storage rooms. Try any combination and discover which ones are best for certain situations because you don't have stats limiting your use. Make use of different propulsion, utilities, weapons and cores. Protect your core at all costs with exterior plating and excess parts.\n\n[*]Escape in one piece! Once you reach a new level and evolve your core is replenished to 100%, meaning just escaping with 1 core integrity won't mean you die instantly on the next level. However if your core is corrupted (through EMP or other ways) it will last unless you find ways to fix it! Find allies along the way or even build a robot army to help you crush anyone you pass, but careful reinforcements might be coming since you caused a huge commotion!!\n[/olist]\n\nOverall this is a fresh take and a great roguelike where you are presented with lots of data to carefully examine and make decisions with!", "timestamp_created": 1509304884, "timestamp_updated": 1509600452, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36115749": {"recommendationid": "36115749", "author": {"steamid": "76561198072604105", "num_games_owned": 88, "num_reviews": 19, "playtime_forever": 352, "playtime_last_two_weeks": 0, "last_played": 1511370785}, "language": "english", "review": "Cogmind: a transcendent cybernetic experience that I can't recommend enough as it effectively scratches the itch for Turn-based Sci-Fi Roguelike Retro RPG endless goodness. \n\nI saw someone mention Cogmind on Reddit, referring to it as \"additctive as Rimworld\". This comment piqued my interest. \n\nI went from dipping my toes in to complete immerssion within the first couple of hours. Unlike other Roguelikes I've played, Cogmind doesn't feel like a chore with a ton of grinding in order to get any satisfaction. It grabs hold of your imagination almost instantly as your brain tries to grasp the depth hidden beneath the surface. \n\nLike other special games born of small beginnings, its evident that Cogmind is the result of a labor of love and ongoing perseverance. The Dev clearly gets as much joy out of continuing to evolve Cogmind as you will playing within it's world. \n\nThis is one of those rare games that I will gift to more than one person just as I would a great book or movie.", "timestamp_created": 1509292554, "timestamp_updated": 1509294922, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36102045": {"recommendationid": "36102045", "author": {"steamid": "76561198025308978", "num_games_owned": 83, "num_reviews": 2, "playtime_forever": 1015, "playtime_last_two_weeks": 0, "last_played": 1509519490}, "language": "english", "review": "Brilliant rogue-like. I have a paper due Monday...picked the wrong weekend to pick this up.", "timestamp_created": 1509261310, "timestamp_updated": 1509261310, "voted_up": true, "votes_up": 0, "votes_funny": 2, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36088991": {"recommendationid": "36088991", "author": {"steamid": "76561197988037807", "num_games_owned": 162, "num_reviews": 1, "playtime_forever": 817, "playtime_last_two_weeks": 0, "last_played": 1510532630}, "language": "english", "review": "Game is great. Graphics, setting, interactions, hacking; they all work together to make a very immersive game. Heavily replayable, lot's to explore. Feels like a complete game; I look forward to what gets added.", "timestamp_created": 1509221301, "timestamp_updated": 1509221301, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36072342": {"recommendationid": "36072342", "author": {"steamid": "76561198014629759", "num_games_owned": 200, "num_reviews": 8, "playtime_forever": 242, "playtime_last_two_weeks": 0, "last_played": 1509224278}, "language": "english", "review": "A robot-centric game where you get to experience real robot concerns and dilemmas.\n\nThe game is in ASCII, but you don't mind because you are a robot.\n\nYou have more urgent matters like: battery power, overheating, rebooting other bots, understanding the system behing these terminals. Oh, and blowing up everything with your grenade launcher.", "timestamp_created": 1509186077, "timestamp_updated": 1509186101, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.557586", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36070333": {"recommendationid": "36070333", "author": {"steamid": "76561197988212047", "num_games_owned": 615, "num_reviews": 9, "playtime_forever": 415, "playtime_last_two_weeks": 1, "last_played": 1513435488}, "language": "english", "review": "I am terrible at this game, but every few runs I get just far enough to keep me coming back...  Great game, unique in the genre, I'll keep learning and maybe I'll get a little lucky and finish one day.", "timestamp_created": 1509181156, "timestamp_updated": 1509181156, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36064835": {"recommendationid": "36064835", "author": {"steamid": "76561198062507044", "num_games_owned": 143, "num_reviews": 4, "playtime_forever": 795, "playtime_last_two_weeks": 47, "last_played": 1513919920}, "language": "english", "review": "I was on the fence about this due to the price vs. other rogue-likes/rogue-lites.  It is very good and very well polished.  It stands out in a crowd, and most importantly, I really feel the dev deserves the support.  He really seems to be busting his butt to make this a great game.", "timestamp_created": 1509164774, "timestamp_updated": 1509164774, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36033027": {"recommendationid": "36033027", "author": {"steamid": "76561197974299291", "num_games_owned": 396, "num_reviews": 16, "playtime_forever": 1531, "playtime_last_two_weeks": 0, "last_played": 1509283090}, "language": "english", "review": "As someone who's played quite a few roguelikes this is an absolutely fantastic one. Tons of polish, what seems to be a ridiculous amount of content (so far), and fantastic game mechanics with a good, comprehensive in game manual so you don't have to go looking at wikis to figure out how to not die horribly.\nIt is very much through and through a roguelike however, not some roguelite. If you don't like those this won't convince you otherwise. But if you do this is very well worth the purchase.", "timestamp_created": 1509082922, "timestamp_updated": 1509082922, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36029425": {"recommendationid": "36029425", "author": {"steamid": "76561197992859194", "num_games_owned": 400, "num_reviews": 2, "playtime_forever": 1502, "playtime_last_two_weeks": 0, "last_played": 1509045325}, "language": "english", "review": "This is really good game about a cog that's mind.\n\nThen robot start to murder cog and i don't know help???", "timestamp_created": 1509071055, "timestamp_updated": 1509071055, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.499550", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36020929": {"recommendationid": "36020929", "author": {"steamid": "76561198014416565", "num_games_owned": 1076, "num_reviews": 18, "playtime_forever": 446, "playtime_last_two_weeks": 0, "last_played": 1509064623}, "language": "english", "review": "Video Version | https://www.youtube.com/watch?v=M-8WX-jh_tI\n\nToday we’re bringing you Cogmind, a fairly decent Rouge Like game but god damn it’s hard to get into it.\n\nWhen I say Rouge Like game I actually mean Rouge Like, not rouge LITE which most people get wrong. A Rouge LITE would be The Binding of Isaac or Magicide, a Rouge Like would be for example Sword Of The Stars: The Pit. and Cogmind fits in the Rouge Like genre, it’s a turn based, RPG type, adventure game, that is hard as shit to get into. \n\nThe game starts without launching to a menu, it doesn’t send you into a tutorial on your first start up it just tosses you in, tells you to go fuck yourself, and leaves. That’s basically the first 30 seconds of the game. After your first crushing defeat, having no idea what the hell is going on, you start picking up on small things. Now you know how to attach your wheels, how to shoot your guns, which mind you is pretty fucking annoying, and what some of the modules do. \n\nWhile starting your first game you’ll probably be overwhelmed by the UI, it’s a little bit spooky and has a lot of information on it. Don’t worry about it for now, it’s best to just play through a couple times and slowly learn about the data and what it means instead of sitting down building a spreadsheet with all the info you have. The game isn’t an entrance exam to university, the best way to learn is multiple attempts.\n\nIt’s an incredibly difficult game to just jump into, but once you get past that initial hour you start figuring things out and can enjoy the story of this game, and jesus there’s a lot of story content in this game. In a single play through you won’t be able to learn about the entire world, only sections written in Terminals that you must hack to gain access to. Cogmind has an incredibly in-depth well written world. \n\nThe game has a pretty neat art aesthetic as well, it can be a little daunting again trying to figure out what everything looks like but you can change whether you want the ASCII art style, or basic textures. personally I’d recommend playing in the ASCII version, I find the Textures to be a little lacking and not very interesting compared to something like Sword of The Stars. \n\nThere’s a lot of interesting ways you can play the game as well, you could build yourself to be a massive tank with huge weapons shooting rockets, lobbing grenades, blowing up walls. You could also be a stealthy cheeky beaver burrowing through walls, avoiding your targets. There are plenty options for you to experiment with, you can even try being a Robot Samurai with the Katana’s, though I think you’ll die pretty damn quick\n\nOne problem I had was the lack of music in the game. Hopefully this is something the dev is looking at as this game is in Early Access.\n\nI do find this game to not be as in depth as Sword Of The Stars: The Pit but it is still something worth checking out. Personally I’d wait for there to be a sale to purchase this game right now if you’re not really into Rouge Likes, but if you are a fan of this genre you need to pick this game up now.", "timestamp_created": 1509043195, "timestamp_updated": 1509043195, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.504265", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35996928": {"recommendationid": "35996928", "author": {"steamid": "76561197986279290", "num_games_owned": 65, "num_reviews": 8, "playtime_forever": 453, "playtime_last_two_weeks": 0, "last_played": 1511323138}, "language": "english", "review": "Only played a few hours, but I'd definitely recommend this game. There is a lot of depth here just in the different load outs and builds you can come up with to keep yourself alive.\n\nI also like the idea that it is not based on \"experience points\", but just simply your survival. You make every decision out of necessity as well. I am generally a pack rat in most games I play, but here I have to fight that urge. You really only want to carry equipment that is immediately useful to you.\n\nI will add to this review as I get more experience playing the game, but I am already happy with my purchase even with less than 4 hours of play time.", "timestamp_created": 1508962811, "timestamp_updated": 1508962938, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35983294": {"recommendationid": "35983294", "author": {"steamid": "76561198022157326", "num_games_owned": 881, "num_reviews": 7, "playtime_forever": 382, "playtime_last_two_weeks": 0, "last_played": 1512646464}, "language": "english", "review": "One of the best roguelikes I've ever played and I've played them since 2000. Loving the lore, the sci-fi setting. Swapping parts is a great mechanic, and unlike ADOM and Caves of Qud it's far more approachable and user-friendly. Give it a try, IMHO you'll either like the game or not before 2h refund time is over.", "timestamp_created": 1508919402, "timestamp_updated": 1508919402, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35977253": {"recommendationid": "35977253", "author": {"steamid": "76561198004541366", "num_games_owned": 671, "num_reviews": 19, "playtime_forever": 403, "playtime_last_two_weeks": 0, "last_played": 1508889177}, "language": "english", "review": "Fantastic roguelike!", "timestamp_created": 1508888226, "timestamp_updated": 1508888226, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35968455": {"recommendationid": "35968455", "author": {"steamid": "76561197988609531", "num_games_owned": 130, "num_reviews": 8, "playtime_forever": 434, "playtime_last_two_weeks": 0, "last_played": 1511752149}, "language": "english", "review": "A rogue-like with a great UI, WHOULDA THUNK. 5/5 security alerts", "timestamp_created": 1508856499, "timestamp_updated": 1508856516, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35965579": {"recommendationid": "35965579", "author": {"steamid": "76561197968648292", "num_games_owned": 472, "num_reviews": 1, "playtime_forever": 52, "playtime_last_two_weeks": 0, "last_played": 1508350090}, "language": "english", "review": "Following the developers blog for more than 3 years now - and I'm really happy that it's finally arrived on Steam. I've never imagined that such insights into development choices are so entertaining to read.\nI've been playing roguelikes since I've discovered an amiga version of Nethack in the early 1990s.  Cogmind combines aspects from its ancestors with modern user interface, an interesting and deep setting (too many roguelikes with fantasy setting...) and this combination makes it a higly enjoyable and replayable experience.\n\n[b]Recommended![/b]", "timestamp_created": 1508847840, "timestamp_updated": 1508847840, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35959523": {"recommendationid": "35959523", "author": {"steamid": "76561198011122966", "num_games_owned": 274, "num_reviews": 19, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1508901217}, "language": "english", "review": "It's a great roguelike with an awesome style. Conceptually interesting and I can really envision myself as a sentient 'core' assimilating components it's found and from components it's ripped off other bots it's killed.\nMy only issues is probably more personal in the sense that I have the impulse to zoom in due to the art style as I always feel like everything is quite small. Maybe that's just me but I'm enjoying it.\nI think the UI is a bit difficult to initially get around and will take time to get used to.\nOverall awesome indie roguelike and hope to see more from these devs!", "timestamp_created": 1508820349, "timestamp_updated": 1508820349, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35956297": {"recommendationid": "35956297", "author": {"steamid": "76561198150431741", "num_games_owned": 134, "num_reviews": 4, "playtime_forever": 216, "playtime_last_two_weeks": 0, "last_played": 1508707579}, "language": "english", "review": "Let me give you a rundown on a situation you may run into in Cogmind.\n\nYou've just finished sneaking around a busy factory, waiting as scout and informer units pass by. You spot an engineer trudging along, rebuilding delapidated walls. You sneak up to it and attack it with a Datajack, a makeshift hacking device only usable at short range. Miraculously, you succeed in accessing the engineers inner systems - of which you have the option to gather information about the droid, attempt to overload its systems, or link it with your own, allowing you to see what it sees. You decide to try and link with it, but it fails, and the engineer quickly runs off down the corridor. You are unable to catch up to it as you are equipped with aluminium legs you acquired from dismantling a combat drone earlier, and they arent fast enough to catch the engineer before it alerts an Informer, who then alerts the combat units in the area. Positioning yourself, you wait for the drones to reach your location so you can tear the parts from their burnt, metal carcasses and use them for yourself. Seeing them approach, you open fire with your weapons - a grenade launcher, beam gun, and particle cannon. All three miss, with the grenade hitting an adjacent wall, blowing it open. Another droid emerges from the debris, and begins firing at you. Its missiles destroy two of your weapons and reduces the integrity of one of your power cores. The battle rages on, and you manage to destroy one of the three combat bots, but not before your power cores give way to the fire. You begin to run. Passing through a door, you look for an empty room to hide in, but before you can progress any further, your aluminium legs are severed by a blade trap. Unable to move much faster than a tile a turn, you decide you will wait. The room you are in has two large machines that you know from past experience are very, very volatile, and you still have your grenade launcher handy, albeit in its disrepair. \nA few turns later, after lying in a pile of broken parts and your own dispair, 5 combat droids enter the room. \nYou press F to target, aim at the machines, and fire. \n\n\nBased on a true story - this was my very first run.", "timestamp_created": 1508804689, "timestamp_updated": 1508804689, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.583333", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35951680": {"recommendationid": "35951680", "author": {"steamid": "76561198040807162", "num_games_owned": 224, "num_reviews": 16, "playtime_forever": 5958, "playtime_last_two_weeks": 0, "last_played": 1509164132}, "language": "english", "review": "Ah Cogmind such a wonderfully addictive game. It's great, honestly but this game it is easily worth is full price, on sale even better.\n\nPros. :\nImmersive detail and complexity:\n\n\nCons:\ngraphics. Honestly this game forgoes pretty graphics for raw immersion and actual gameplay detail. Very much indie in appearance. \n\n10/10 would buy again.", "timestamp_created": 1508786039, "timestamp_updated": 1508786039, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35918232": {"recommendationid": "35918232", "author": {"steamid": "76561197971340114", "num_games_owned": 372, "num_reviews": 21, "playtime_forever": 5763, "playtime_last_two_weeks": 0, "last_played": 1512801349}, "language": "japanese", "review": "謎の巨大施設の底で再起動した機械が、自己改変しつつ上の階層を目指していく、狭義の、そして濃厚なRoguelikeです。システムのフォルム自体はかなりシンプルで、クラスなしスキルなし経験値もなし、下に戻る階段さえありません。しかし内容は極めて多層的、精細かつ広範です。\n美しく鮮やかなビジュアルで展開するのは、敵味方そして中立と個性的で賑やかな機械達の世界に、刻々変化する状況と自分。スタートの敷居は低く、一手ごとに増す戦略性。これは、面白いです。既に4年の開発を経て作品として完成しており、今後さらにコンテンツを掘り下げるための早期アクセス扱いとのこと。（とはいえAlpha版から数百時間続けているプレイヤーならともかく、リリースから始めた自分がコンテンツを味わい尽くすのは相当先のようですが）\n\n開始時、プレイヤーには動力源1、移動装置2、ユーティリティ2、武器2のスロットと所持品枠4のみがあり、ここに施設で入手したり敵から奪ったパーツを繋げていきます。パーツには排熱や射撃の反動など考慮すべきパラメータも数多いのですが、ややこしさが前面に出てこないようになっており、とりあえずは動けばいいという[strike]駄目なコードみたいな[/strike]感覚で遊べます（しかし複雑な内部システムもただそれっぽくシミュレートしてあるだけなのではなく、ゲームプレイに大きく影響を与えており、たとえばRoguelikeお約束の一本道や角での待ち伏せも、そう単純ではなくなっています）。リソースは弾薬等に用いる”マター”や電力に綺麗にまとめられていますが、餓死に相当する概念はないため、そちら方面で探索を急かされることはない感じです。\n\n派手で多彩な装備を駆使する戦闘は楽しく、いい感じに武装を構成できると調子に乗ってぶちかましたくなりますが、しかしハクスラとは言い難いです。もちろん戦闘重視ビルドも自由にできますが、戦闘は常にリスクがつきまとい、パーツ類も結構な勢いで損耗するため（ある程度の対処も幾つか存在するものの）なかなか直線的、恒常的なパワーアップは見込めません。本作にあるのは戦闘も一手段の生存戦であり、様々な形でのハッキング、\"ステルスゲーム\"というよりは統合的な立ち回りです。センサー反応を見つつ危険地帯を一歩ずつ切り抜ける。ボコスカ撃たれながら部屋に逃げ込み、航空型に作り変えて脱出。追い詰められて絶体絶命、というところで目の前に平和にお仕事している採掘ロボット…よし。\n\nまたUIが（Roguelikeとしてではなくゲーム全体において）恐ろしく優れています。ニュアンスはBrogueに近く、あれをさらに突き詰めたものと言えば伝わるでしょうか。キーボード、キーボード+マウスのみならず、ほぼマウスだけで（サイドボタンにキーを二つ割り当ててますが）ここまで快適にRoguelikeをできる日が来るとは思いませんでした。パラメータやアラート類もグラフィカルに、あるいは整理された値で、非常にスマートに表示してくれます。\n\n映像に関してはストアのトレイラー以上の表現力を私は持ち合わせませんが、こういうのが好きな人間にはたまらないものがありますね（正確にはトレイラーは2年前のもので、今のバージョンではさらに磨きがかかっています）。武器一つ一つ、サブシステム類すらセンスの良いエフェクトを伴って、しかしゲームの小気味良さは邪魔しません。\n\nレビューでは芸術品のような、といった評価を見かけますが、まさにそんな感じのゲームです。べた褒めも何ですし無理矢理ひとつ気になった部分を挙げると、世界観等のテキストも相当充実しているのですが、一覧性の高いUIデザインの関係でフォントが小さめにならざるを得ず、慣れるまで可読性にやや難ありかもしれません。ただメッセージログや収集したドキュメントをtxtやhtmlで出力も可能と、やはり手抜かりはない感じがあります。（またストアページのリンクから各解像度・フォントでどのように画面が見えるか確認できます）", "timestamp_created": 1508672674, "timestamp_updated": 1511435851, "voted_up": true, "votes_up": 20, "votes_funny": 0, "weighted_vote_score": "0.717082", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35916486": {"recommendationid": "35916486", "author": {"steamid": "76561198031618738", "num_games_owned": 202, "num_reviews": 10, "playtime_forever": 1394, "playtime_last_two_weeks": 0, "last_played": 1509321834}, "language": "english", "review": "I'm mixed in a lot of ways about this game. It feels like the Binding of Isaac sometimes for me - that is, unsuccessful runs tend to be a slog, while lore-filled or successful runs are far more enjoyable.\n\nI originally wrote a negative review here (preserved below). Combat felt tedious at best and each run seemed nigh-identical to the last, but response from multiple people including the developer and some community members prompted me to continue playing to see if the game held more. [b]It did[/b] - it had a lot I'd yet to see.\n\nContinued playing revealed not only more areas to explore and parts to utilize that I still hadn't seen, but random encounters I had uncovered an aspect of the game I had yet to even scratch the surface of, making interactions with various machines far more interesting and variable. Not to mention how fun the encounters themselves were - I've found two so far and both were incredibly interesting to me, largely in part because I love good lore and both events were densely packed with it.\n\nEven so, I still have issues with this game that have yet to see resolution, and while further playing may yet have them solved (and if so I will update this), they are still worth mentioning regardless. Before I dig in, however, be aware that:\n\n[b]I have not finished the game.[/b] I have reached -3 (presumably 3rd-to-last level) at the farthest.\n[b]There is surely a LOT I've yet to witness.[/b] Plenty of which could mean a number of changes to this review.\n[b]I have a lot left to learn in terms of how to play.[/b] The only build I can successfuly construct thus far is a combat one - I am still trying to create other suitable configurations, and until then any comments from me about their existance or potential should be taken with a grain of salt.\n\nThat all said...\n\n[h1]Things you should know[/h1]\n\n[i]+ Positive\no Neutral\n- Negative[/i]\n\n[b]+ The lore is fantastic.[/b] I'm a sucker for a quality story, and this game has plenty to offer. Everything from dialogue to stories dug up from terminals is well-written and fun to read, and I constantly find myself excited whenever I find more.\n\n[b]+ Decent atmosphere.[/b] While ambient noise is uncommon, the sound as a whole is well crafted wherever present and never becomes annoying. Additionally, the graphical style - whether you use the ASCII variant or the default - fits together nicely at all times, and I've yet to spot a single thing out-of-place with it.\n\n[b]+ There are plenty of parts and many, many options for building your character.[/b] When the game mentions its part diversity, it isn't exaggerating at any point. I am constantly finding new things to attach or try out, and even amongst those I'm already aware of I still find new uses or even entirely new builds to take a shot at.\n\n[b]o Maps are very large, and game mechanics tend to encourage leaving sooner rather than later.[/b] It certainly depends a lot on your build as to whether or not you can stick around, but more often than not it's wiser to simply leave for the next level. If you're looking to explore a lot, you need to be careful - even if you've outfitted yourself specifically to do it.\n\n[b]o Combat can become boring if too drawn out.[/b] This is another one of the issues that applies moreso depending on what kind of run/build you have. If you're more combat-oriented, odds are almost no fight will truly last unless it is a particularly tough enemy. If you run something less armed, however, you could find yourself embroiled in potentially troublesome lasting skirmishes if you aren't careful.\n\n[b]o Few builds seem effective without some level of dedication to combat, though this might just be me.[/b] As I stated earlier, I'm still in the process of designing a working setup of another type, so it's hard to tell just yet.\n\n[b]o The game can be very hard at times.[/b] This has gotten easier as I've learned more things that I can do, but can still be occasionally overwhelming. When I mentioned I got to level -3, I did so on Easier difficulty; even when toned-down, the game can sometimes be quite difficult. This used to be a negative, as easier modes used to lock some areas out, but as of Beta 3.1 this is no longer the case. [i](Special thanks to the dev for being so receptive to feedback on this!)[/i]\n\n[b]- System Corruption is too influential per-turn.[/b] A subset of the difficulty, but still separate enough to warrant its own point. System Corruption is rarely a straight-up killing factor for me, but I still find it rather annoying to deal with, as even 1% corruption seems to cause something to screw up unusually frequently. Combine this with the fact that (as far as I know) any level of corruption can cause any manner of negative side-effect, and you get problems like a weapon-misfire from 1% corruption causing a nuclear reactor to get shot and blow up in your face.\n\n[b]- Ambient sound is uncommon, and I have yet to hear any music at all.[/b] Some games can pull off no music just fine, but they usually do so by making up for it with ambient sound - generators humming, steam leaks hissing, etc. While Cogmind [i]does[/i] have this sort of thing, they feel somewhat rare to encounter and few machines actually seem to produce any noise. Put this together with other sounds only occuring on a per-turn basis and you can get long periods of silence taking away from the overall experience.\n\n[h1]In the end...[/h1]\n\nWhile Cogmind definitely has a lot of effort put in, and is certainly a well-made game, whether or not you should get it varies; I personally didn't enjoy it until I'd put in tens of hours. Hence, I'd recommend it - but only if you think it likely that you'd like it, too.\n\n[b]Old review:[/b]\n\n[i][b]EDIT:[/b] The developer (as well as several friendly community members) responded to my review in the comments regarding combat, and it seems they are right about it so far from what I've seen. Continued play has revealed evolving weaponry more makes combat less tiresome (as it ends very fast) and as I continue I am still finding plenty of new elements to improve my play style with. I'm not going to change the review score just yet as some parts still seem somewhat tiresome, but if things continue to improve I may yet do so.[/i]\n\nI'll say it straight up: I don't like this game. While I respect the effort that clearly went in to it (a lot!), the gameplay comes across as very lacking. I find myself suspecting I'm missing something that brings the charm, seeing all the positive reviews, but after four hours of play I still can't find the entertainment.\n\nThe lore is good and the sound effects hold as much variety as was promised (and then some), but this is strongly offset by repetitive gameplay. Exploring can be nice, and combat is interesting at first, but both become dull as you go on. Exploring lasts far longer however, as new items and areas show up at a good pace.\n\nCombat is another story; I quickly found myself exasperated with constant streams of enemies and every time new ones appeared I ended up sighing with frustration at the slog I'd now have to deal with. With combat almost entirely consisting of 'Press F to begin targeting, then shoot them, repeat until someone dies.', things get boring extremely fast. Worse yet, even after learning not to push things too far with terminals, enemies still seemed to pour out of every nook and cranny regardless of what I did.\n\nIn the end, while I still respect this game and its developer for all the work involved in this product, and while it still has a number of very good elements, I found this game far too grindy to personally be worth $18 (or $20 - I got it on sale). I can't say ignore this game - it has too much potential for that - but unless a good sale comes around or combat gets improved, I'd suggest holding off just yet and seeing what happens first.", "timestamp_created": 1508667994, "timestamp_updated": 1510473889, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "27", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35913352": {"recommendationid": "35913352", "author": {"steamid": "76561198097780693", "num_games_owned": 282, "num_reviews": 32, "playtime_forever": 823, "playtime_last_two_weeks": 0, "last_played": 1509269389}, "language": "english", "review": "Extremely cool reimagining of the roguelike genre. Brutally difficult, and very unusually for a roguelike, clearing levels and killing ALL THE THINGS for xp/lewt is not incentivized. Mouse driven gameplay which, again, is odd for the genre, but the implementation feels great.\n\n\nEarly access, but it's pretty polished. Can't comment on late game, as I am getting my faced pushed in pretty early on every time so far. Not perfect, still in progress, but definitely worth a purchase for any fans of the genre.", "timestamp_created": 1508658657, "timestamp_updated": 1508658657, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35907347": {"recommendationid": "35907347", "author": {"steamid": "76561197995709877", "num_games_owned": 153, "num_reviews": 1, "playtime_forever": 652, "playtime_last_two_weeks": 0, "last_played": 1511554737}, "language": "english", "review": "First roguelike that i actually enjoy. \nHas alot of options for playstyles and seems to have alot of depth.\nIt seems to me like the skill ceiling is very high but it's still easy to pickup and play.", "timestamp_created": 1508636658, "timestamp_updated": 1508636658, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35905925": {"recommendationid": "35905925", "author": {"steamid": "76561198045808248", "num_games_owned": 101, "num_reviews": 2, "playtime_forever": 903, "playtime_last_two_weeks": 0, "last_played": 1508889173}, "language": "english", "review": "It's an amazing roguelike on the huge scale. All of the elements of the game add to the story and the plot. Very polished for its' current version. Doesn't need much explanation with tutorials and starts off simple, then becomes more complex in later stages allowing a player to make many alot decisions about his charactor's build with the item augments. Good mouse support for those that prefer that over a keyboard for a roguelike. Immersive Sounds, which is unique for a roguelike. Good Tileset to compliment the roguelike. The UI is very interactive. Recommend to any fan of a \"true\" roguelike or a fan of Caves of Qud, Dungeon Crawl Stone Soup, or Cataclysm:DDA; to name a few.", "timestamp_created": 1508631096, "timestamp_updated": 1508631096, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35902778": {"recommendationid": "35902778", "author": {"steamid": "76561197971692688", "num_games_owned": 191, "num_reviews": 38, "playtime_forever": 660, "playtime_last_two_weeks": 12, "last_played": 1513897623}, "language": "english", "review": "Telengard\nRogue\nThis Game\n\nHoly crepe Batman, what a great game!\n\nI HATE recent versions of rogue, rouguelike etc. If I see that tag I skip the game. However something familiar in this presentation told me this was old school Rogue. The real thing.\n\nAudio is very atmospheric, it triggers at just the right times. The rest of the time you are left to ponder your next move.\n\nYou are given choices of approach - stealth or not, hack or not, explore the entire map or run for the stairs?\n\nThe RPG elements are the choices you make in what to keep. The constant juggle of items found.\nYou also \"earn\" more slots to place your equipped items.\n\nWho you face is important. There are innocuous bots and then there are the ones actively hunting you. \nWhat you use against them is important. You may enjoy blowing things up but a rocket launcher in a confined area is [i]dangerous[/i].\nWhich means where you are is a consideration.  \n\nAnd the levels are varied. Carved out structures or caverns and tunnels.\nCan you duck around a corner and thereby lose line of sight? Maybe they'll go away.\n\nAnd then the environment itself evolves. There are various bots that alter the map in different ways.\n\nThe UI is a hoot. It takes you through all the data you need to know. And it almost leads you there. \nYou are able to just dive in and learn the game without a reading of the manual.\n\nThis is one where it is not the robot you care about but the game...I want to get to the stairs. You could be on your last point in your core and yet if you can see the exit - maybe I can make it.\n\nGet this, get this now...et cetera.\nYou missed the sale. Get this anyway.\nVery much worth $20.\n\nReading the above I see that the depth of the game is more than I suspected. For such a simple thing, it is truly a thing to behold.\nIt is not as simple, not single faceted.\n\nYou can approach this in any way you like and I would not be surprised if you could win in one hundred different ways.\n\nDev is pushing a large amount of content/updates.\nHuge thumbs up.", "timestamp_created": 1508620047, "timestamp_updated": 1510487191, "voted_up": true, "votes_up": 16, "votes_funny": 0, "weighted_vote_score": "0.634134", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35899955": {"recommendationid": "35899955", "author": {"steamid": "76561198001000135", "num_games_owned": 353, "num_reviews": 3, "playtime_forever": 585, "playtime_last_two_weeks": 0, "last_played": 1509135942}, "language": "english", "review": "This is a lovely game about collecting body parts and claiming them as your own.", "timestamp_created": 1508612351, "timestamp_updated": 1508612351, "voted_up": true, "votes_up": 7, "votes_funny": 4, "weighted_vote_score": "0.507372", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35899334": {"recommendationid": "35899334", "author": {"steamid": "76561198002682239", "num_games_owned": 216, "num_reviews": 9, "playtime_forever": 2712, "playtime_last_two_weeks": 0, "last_played": 1512542703}, "language": "english", "review": "This game was easy to get into for me starting out, it has interesting decisions, pretty graphics, fun gameplay, and it lacks the annoying grind that other similar games have. So far, it's really fun.", "timestamp_created": 1508610724, "timestamp_updated": 1508610724, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35892750": {"recommendationid": "35892750", "author": {"steamid": "76561198069836293", "num_games_owned": 142, "num_reviews": 60, "playtime_forever": 95, "playtime_last_two_weeks": 0, "last_played": 1508659665}, "language": "koreana", "review": "장점이라곤 특이하고 깔끔한 그래픽이랑 타격감뿐\n솔직히 타격감 하나는 로그라이크중 단연 원탑\n그래서?", "timestamp_created": 1508595901, "timestamp_updated": 1508595901, "voted_up": false, "votes_up": 1, "votes_funny": 3, "weighted_vote_score": "0.222880", "comment_count": "9", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35892635": {"recommendationid": "35892635", "author": {"steamid": "76561198125269193", "num_games_owned": 85, "num_reviews": 5, "playtime_forever": 235, "playtime_last_two_weeks": 0, "last_played": 1508595535}, "language": "english", "review": "Its a good game with a good price.", "timestamp_created": 1508595672, "timestamp_updated": 1508595672, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.458015", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35892228": {"recommendationid": "35892228", "author": {"steamid": "76561197998195383", "num_games_owned": 1953, "num_reviews": 13, "playtime_forever": 332, "playtime_last_two_weeks": 0, "last_played": 1509574941}, "language": "english", "review": "I've only put in 2.6 hours so far but I can already tell this game is a gem.  The creator of this game has put so much thought, time, and love into this game and it shows from how slick the menus are, the cool transition from tiles to ASCII and back again, the AI behaviors, etc.  The manual is very lengthy and takes a bit to get through, but reading that gives you even more of an appreciation for the game as you realize each tile is really a 9x9 grid to accomodate robots of various sizes (smaller robots are obviously harder to hit, but you also have a chance of shooting past a smaller robot to hit a more dangerous opponent behind it) and you realize how the game is a very neat amalgamation of turn based and time based (the game operates on turns, but each action takes a certain amount of time and there is 100 \"time\" per turn, so if you shoot six weapons it takes several turns worth of time so if you miss your opponent could flee).  I can't wait to put more time in this game.", "timestamp_created": 1508594757, "timestamp_updated": 1508594757, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.553070", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35891882": {"recommendationid": "35891882", "author": {"steamid": "76561197974008645", "num_games_owned": 527, "num_reviews": 61, "playtime_forever": 209, "playtime_last_two_weeks": 0, "last_played": 1508272699}, "language": "english", "review": "It's a roguelike that has taken every single \"rule\" of the genre and examined why it was there, and how it could be improved upon. I think the dev succeeded. The interface is very well done, the upgradeable robot is a neat change from having some sort of humanoid in a fantasy setting, and the robot ecosystem with neutral mobs makes the world feel more alive, despite it all being robots. Heck, the lack of experience points (you only level up once you move to the next level) means that you have choices of how you want to play the game: kill everything, sneak around and get to the next level as quietly as you can, or some mix of them?", "timestamp_created": 1508593853, "timestamp_updated": 1508593853, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.525547", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35890134": {"recommendationid": "35890134", "author": {"steamid": "76561198101912486", "num_games_owned": 551, "num_reviews": 6, "playtime_forever": 427, "playtime_last_two_weeks": 0, "last_played": 1511913179}, "language": "english", "review": "Simply amazing.\n\na [u]must[/u] buy if you like roguelike games.", "timestamp_created": 1508589751, "timestamp_updated": 1508589751, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.515698", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35885222": {"recommendationid": "35885222", "author": {"steamid": "76561197969033736", "num_games_owned": 364, "num_reviews": 8, "playtime_forever": 164, "playtime_last_two_weeks": 0, "last_played": 1508608457}, "language": "english", "review": "It's good", "timestamp_created": 1508575719, "timestamp_updated": 1508575719, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35883000": {"recommendationid": "35883000", "author": {"steamid": "76561198024972007", "num_games_owned": 344, "num_reviews": 4, "playtime_forever": 605, "playtime_last_two_weeks": 0, "last_played": 1509653446}, "language": "english", "review": "Cogmind is one of the greatest roguelikes ever made. Kyzrati's view and path for the game is just genius. The art-style is fantastic, keeping the original roguelike feel, while welcoming in new players by making roguelikes accessable with the modern touches, beautiful tilesets, and beautiful art. He even released a tool to help artists of the same style. (REXPaint)\n\nThe game can be picked up and put down, which makes it great for a quick run if you're off at lunch, or just have a wee bit of free time. Even if your run exceeds the time you have, just save and pick up right where you left off. Since it's turn-based you can wait to pick it back up when you're in the mindset of the game, or when you're ready for it.\n\nAll in all, Cogmind is a great pickup at its release discount of $17, or at its full price of $20. Kyzrati has slaved over this game for years, and the price reflects it. You're not picking up a roguelike for free filled with issues, you're picking up a polished masterpiece that has blood and tears poured into it, and it shows.\n\nIf you're a fan of roguelikes, it's a no-brainer. If you've never tried a roguelike, it's a great entry point!\n\nThis is a game that will be cherished by many for a long time.", "timestamp_created": 1508568682, "timestamp_updated": 1508568682, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.654947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35882109": {"recommendationid": "35882109", "author": {"steamid": "76561198040829014", "num_games_owned": 195, "num_reviews": 2, "playtime_forever": 5122, "playtime_last_two_weeks": 0, "last_played": 1509459394}, "language": "english", "review": "Great game with a great deal of depth. What is also interesting is the ascii interface fits perfectly with the theme of the game.", "timestamp_created": 1508565648, "timestamp_updated": 1508565648, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35880351": {"recommendationid": "35880351", "author": {"steamid": "76561198044408331", "num_games_owned": 185, "num_reviews": 1, "playtime_forever": 1736, "playtime_last_two_weeks": 112, "last_played": 1514166189}, "language": "english", "review": "neat game", "timestamp_created": 1508559111, "timestamp_updated": 1508559111, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.474453", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35878591": {"recommendationid": "35878591", "author": {"steamid": "76561198058668312", "num_games_owned": 145, "num_reviews": 10, "playtime_forever": 550, "playtime_last_two_weeks": 0, "last_played": 1511648209}, "language": "english", "review": "\n- You are the Cogmind -\n\nDestroy your enemies\n\nSteal their body parts\n\nAssemble the perfect machine\n\nRepeat\n\n.\n.\n.\n\nCogmind has all the charm and complexity of an oldschool roguelike, with all the flare and accessibility of a modern game.\n", "timestamp_created": 1508552135, "timestamp_updated": 1508552135, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.495371", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35876001": {"recommendationid": "35876001", "author": {"steamid": "76561198018678317", "num_games_owned": 87, "num_reviews": 2, "playtime_forever": 138, "playtime_last_two_weeks": 0, "last_played": 1508539390}, "language": "english", "review": "What an amazing game! I've been a roguelike fan for many, many years, and this is one of the best UI implementations I've ever seen. It's hard to imagine that you could describe a roguelike with words like intuitive, simple and easy to navigate.  In my first playthrough, I only had to look up three things (how to activate the terrain scanner - Hint: You don't. It's passive -, if it was better to have high or low movement numbers - Hint: Lower is better, but there's trade offs -, and how support and penalty factored into movement - Hint: Support is the amount of mass you can carry while penalty is the amount of movement added if you go over this amount). The rest of it was very easy to figure out quickly. I did end up reading the manual, but it was a very quick read, and doing so cemented what I had already figured out while illuminating some more obscure aspects of the game.\n\nThe swapping in and out of components is exceedingly satisfying as you build your bot into something to be reckoned with, and while there are no \"Levels\", you will go through evolutions that expand your capabilities which could be likened to leveling up. I was glad to see that evolving also reset the damage you've taken, so it's not a constant fight against unstoppable attrition.  \n\nSo far, it's a fantastic game that I'm really looking forward to exploring much more.", "timestamp_created": 1508541312, "timestamp_updated": 1508541312, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35874167": {"recommendationid": "35874167", "author": {"steamid": "76561197964577234", "num_games_owned": 489, "num_reviews": 14, "playtime_forever": 3242, "playtime_last_two_weeks": 0, "last_played": 1509324996}, "language": "english", "review": "MY NEW LEGS!!\n\nThis is something much more than it seems; it is a take on a classic, proven formula for roguelike (not lite) exploration with absolutely new mechanics that make it a brand new experience. I have at least 6,000 hours in roguelikes, half of which is Dungeon Crawl: Stone Soup.\n\nInstead of leveling, you select new slots; power sources (important for energy weapons and shields), propulsion (important for movement and evasion, also total weight), utility (the one slot you can never have too many of), and weaponry. You start with 2 of each, and you get more as you go deeper. Killing enemies gives a chance for new parts, but also a high chance of a net loss. You have matter, which is used for kinetic weapon firing, and energy, used for energy weapon firing. Both also interplay with utilities, and utilities can convert one to the other.\n\nAdding parts has just enough of a cost to not be done excessively but allowing for regular upgrades. And parts themselves have two stats; the amount of HP they have, and coverage. The only way to die is to get hit in your core, and the only way to defend it is to have parts. Weapons, propulsion, and certain utilities (especially armor) contribute most to this. However, parts regularly take damage from combat and will eventually break.\n\nA main restriction is inventory space, which can only be expanded from an absolutely insufficient 4 with utility upgrades. I try to get by with +10, but +20 would help a lot...\n\n'Builds', as they are, is twofold: Selecting upgrade slots and then finding the appropriate items. However, things will change. In one game I got all my parts more or less wiped out in a big battle twice without losing the game. My core took a lot of hits, but cores recover from leveling up. So I had to piece together what damaged parts I could from my defeated enemies. I cobbled together an interesting gun-based build, then got all my parts wiped out again, and am currently doing a very successful energy weapon build. Inventory space is vital to have backups to replace in or after combat. Losing all your guns means you flee or die.\n\nNPCs are interesting and have a point. They repair level damage, gather non-stored items, and sometimes carry very valuable stuff. Still, the level is either random rooms or mines. I wish there was more variety and unique level areas.\n\nGripes:\n\nUPDATED! System Corruption is cleared when you upgrade Cogmind. If it gets really annoying, just stop looting and ascend higher. It's still exceptionally annoying, however. Firing my Rocket Array into an adjacent field of nuclear reactors while trying to sneak is the worst thing it's done to me. Or dropping my last wheel due to rejection when trying to flee... okay the last one was kind of hilarious.\n\nBuilds. I like that you tend to find plenty of random stuff, but your inventory is just too small. I would love a way to store items during a run in a terminal and be able to retrieve them later. Backup weapons and parts for when I am ravaged that I can find later would be great. The schematic and fabricate system is interesting, but is utter RNG. Some runs I find only ways to store schematics, others I find only fabricators. I'd like a way to better use what I already have.\n\nUtility slots are too good. Power only matters for energy builds. Excessive weapons build up too much heat... and the only answer? Utility slots. Armor is vital, and so is storage options. I find there is far too many vital utilities, with many very interesting ones I have to pass on due to simply not having enough. I can't handle more than 4 weapons even with 2 heat sinks for long engagements. It would be nice if things like batteries, storage and armor could be added to a new type of slot that improves once per upgrade or every other upgrade to give some more room to experiment.\n\nStill have a lot to try out, like speedy stealth builds, melee builds, and whatnot... this'll be a game I put a lot of hours in. If it continues to get solid expansion I'll be hyping it up good to friends.", "timestamp_created": 1508534646, "timestamp_updated": 1509065311, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.598512", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35869408": {"recommendationid": "35869408", "author": {"steamid": "76561198004161133", "num_games_owned": 120, "num_reviews": 23, "playtime_forever": 482, "playtime_last_two_weeks": 0, "last_played": 1509203426}, "language": "koreana", "review": "독특한 컨셉과 HUD로 개발직후부터 주목받던 코그마인드가 드디어 정식출시되었습니다.\n\n돌죽, 픽셀던전, 카타클리즘 등 많은 로그라이크 게임을 즐겨왔지만 이런 SF장르의 게임은 처음이라서 내심 기대를 많이했는데\n솔직히 말하면 기대 이상입니다. 정말 재밌습니다.\n\n아스키아트로 깨알같이 부품모습을 구현한것도 컨셉에 맞고, 굉장히 세세한 부위까지 신경쓴게 맘에 듭니다. 이를테면 부품면적이 클 수록 교전시 파괴확률이 높아진다던가..\n\n우리가 움직이는 로봇은 만화에 나오는 초합금 사기로봇이 이니기때문에, 총알 몇대만 스쳐도 장갑과 다리나 엔진이 날아가버리는 사태가 속출합니다. 이 부품파괴 빈도가 높다는 요소는 죽이는 적들에게서 파츠를 주워 갈아낀다는 식으로 해결하며, 덕분에 굉장히 스피디한 게임진행양상을 보여줍니다. \n다만, 적과 교전해서 얻는 이득보단 손해가 거의 항상 더 크기때문에(경험치시스템이 없음. 레벨개념은 층을 내려갈때마다 부품슬롯 제한이 늘어나는 것 뿐입니다.) 싸움을 최대한 피하는게 좋지만, 아이러니하게도 그러면 부품수급이 힘들어진다는 점도 마음에 듭니다.\n\n\n게임 난이도 자체는 체감상 꽤 높은편으로 보이며, 고수라도 신경쓰지 않고 플레이 했다간 본체발열량이 높아져서 프로세서가 녹아버린다던가, 라이플이 고장난다던가 하는 사태가 속출할 수 있기 때문에 방심할 수 없게 만듭니다. \n\n언어압박은 스크린샷으로 보시면 알 수 있듯이 굉장히 높은편이며, 일부 부품들은 접두사에 수식어가 약어로 붙기 때문에 영어에 별 문제없는 유저들도 꽤나 곤혹스러울 때가 있습니다.(LGT -> Light, HVT -> High velocity 등)\n\n비주얼은 개인 취향마다 다를 수 있겠지만 저는 꽤 높은 점수를 주고 싶습니다. 일단 컨셉에 매우 걸맞고, 조금 익숙해지면 가독성도 괜찮습니다.\n사운드는 별거없습니다만 처음엔 배경음악없이 뿅뿅소리만 듣다가 처음 서브던전 진입했을때 아무도 없는 어두운 동굴에서 들려오던 그 음산한 BGM을 아직도 잊을수가 없네요.\n\n\nOVERALL : 8/10\n\n간만에 나온 수작 로그라이크입니다. 매우 마음에 듭니다. 다만 이런 장르가 항상 그렇듯이 호불호가 심한편이기 때문에 구매 전에\n\n'반드시'\n\n'반드시'(중요하니까 두번 말함)\n\n플레이 영상을 직접 보고 구매결정을 하시길 강력히 권해드립니다.\n\n\n아직 얼리억세스고, 개선할 시간이 많기 때문에 앞으로가 더욱 기대되는 게임이네요.", "timestamp_created": 1508520975, "timestamp_updated": 1511437891, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.629630", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35868502": {"recommendationid": "35868502", "author": {"steamid": "76561198201297786", "num_games_owned": 120, "num_reviews": 8, "playtime_forever": 441, "playtime_last_two_weeks": 0, "last_played": 1508859282}, "language": "schinese", "review": "在steam上架之前就在Reddit论坛的Roguelike版块了解了Cogmind这个游戏，还是在圈子里小有名气的一个roguelike游戏。虽然登录steam的时候是Early Access， 但是实际上游戏本身的内容已经是十分的完整了（44mb在roguelike游戏里是一个很大的数字哦）。\n\n[h1]概述 [/h1]\n首先必须说的是，这是一款比较硬核的科幻主题的roguelike（真的是比较硬核），在这个游戏里，你的所有武器装备都不能被依赖，能依靠的只有你的求生意识和运气；甚至当你消灭了一群敌人，爆出满地战利品的时候，你都没有时间沾沾自喜或者在战利品里挑三拣四，你要化身成超市特卖时去抢打折商品的大妈（自动脑补蜡笔小新特惠日的情况），不然一转眼就会被中立的收垃圾机器人全部抢走。它和很多其他的Roguelike（ToME，DCSS，Angband，Adom....）都不太一样, 相比ToME，DCSS这种Slash&Loot的游戏，Cogmind会稍微偏向生存类一些。但是这个游戏有趣的地方正是在于它不会鼓励你去一直战斗，也不会鼓励你去回避每一场战斗。\n\n[h1]围绕装备的一些不会影响游戏体验的小剧透 [/h1]\n游戏战斗比较像DoomRL，PRIME和Rogue Effect（不知道的小伙伴可以去玩儿一下，很好玩儿的哦，而且Doom和PRIME是自带贴图的，界面比较亲和）是基于射击产生的战斗机制。一开始玩家是一名“裸机”，需要收集零件去组合自己的身体（核心=能量，机动装置 [ 腿，履带之类的2333 ] =移动速度，负重，为核心提供保护， 附属装置= 为机甲提供各种功能，武器=干干干），玩家可以在游戏场景中loot到这些东西也可以打败敌人的机器人去loot战利品。\n\n游戏的一大乐趣就在于收集这些各式各样的武器装备（误），种类非常丰富，查看装备详情的时候可以欣赏一下装备的ascii插画，画的很有feel~ \n\n玩家可以装备和携带的装备是有限的，只能通过升级来增加自己能装备各种种类装备的数量，而物品栏的大小由你装备背包种类而定。而且呢，这个游戏的所有装备都有耐久设定，你装备的装甲，核心，各种零件包括武器都会在战斗中受损，一旦被破坏就报废了，并且游戏初期的装备是很容易被打坏的。所以如何管理背包空间和战斗的频率是玩家们在游戏中面对的最重要的问题。\n\n在Cogmind里，我们很难去像其他roguelike游戏那样在游戏初期预想自己人物的build，然后在以后的游戏里收集build的要素。因为在这里你的装备是会损坏报废的，你的装备经常需要补充，甚至为了生存更换一个本来不不属于你预想的build里的装备。在游戏里经常上演着玩家一身紫装，一场恶战后变得几乎一丝不挂，一边苟活一边再收集装备，然后再返土重来，简直就是人生的大起大落233333.\n\n[h1] 总结一下 [/h1]\n一个围绕着装备build展开的游戏，装备会被打坏需要“”经常“”更换的游戏机制非常新鲜并且很容易让人深入其中，游戏里还有很多关于hacking的要素，这里就不赘述了，留给玩家们自己去探索了。虽然游戏有些难，但每一次游戏都能使你改进自己的build或者思路。种类丰富的装备也大大的增强了探索的欲望，游戏界面很亲和，tile和ascii界面可以任意切换，敌人的ai都做的比较聪明，玩儿起来很有挑战性。 总之 ， Very Impressive.", "timestamp_created": 1508518597, "timestamp_updated": 1508518692, "voted_up": true, "votes_up": 12, "votes_funny": 0, "weighted_vote_score": "0.674789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35866438": {"recommendationid": "35866438", "author": {"steamid": "76561198056074132", "num_games_owned": 135, "num_reviews": 1, "playtime_forever": 667, "playtime_last_two_weeks": 0, "last_played": 1508878902}, "language": "english", "review": "Cogmind has great traditional roguelike gameplay with a lot of unique twists to make it standout from the crowd. Coming from DCSS as my all time favorite roguelike, some tactics apply but others don't. Basics like fighting in corridors to avoid being swarmed are crucial. However, unlike most roguelikes, item destruction is a core mechanic in Cogmind. Your equipment is easily destroyed and needs to be replaced with higher quality parts. At first this feels impossible to overcome, but you'll steadily learn tricks to sustain yourself better. The equipment system is also extremely in-depth. Managing matter, energy, heat, integrity, coverage, mass, etc., makes putting together a build feel like an addictive puzzle to solve.\n\nThe tiles/ASCII/animations are all gorgeous. It's never been as satisfying to press 'f' in a roguelike. I'm currently playing with ASCII because the tiles are a tad small on my 1366x768 laptop resolution. The atmosphere combined with the bits of lore scattered about make this world great to explore. The amount of polish in this game is unmatched by most roguelikes. \n\nI'm still terrible at Cogmind, but I can't get enough and I learn a little bit with each death. In my opinion it's absolutely worth the price.", "timestamp_created": 1508513687, "timestamp_updated": 1508513687, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35864209": {"recommendationid": "35864209", "author": {"steamid": "76561198147781201", "num_games_owned": 178, "num_reviews": 52, "playtime_forever": 202, "playtime_last_two_weeks": 2, "last_played": 1513187975}, "language": "english", "review": "Very fun!", "timestamp_created": 1508507591, "timestamp_updated": 1508507591, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.467480", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35861884": {"recommendationid": "35861884", "author": {"steamid": "76561197966722901", "num_games_owned": 988, "num_reviews": 3, "playtime_forever": 757, "playtime_last_two_weeks": 0, "last_played": 1510016754}, "language": "english", "review": "This game owns. Destroy your enemies and scaenge their parts like some kind of robot mad max. \n\nAlso - this game is very approachable for a roguelike. You can dive right in and start playing. Has a little tutorial to hold your hand just enough which is super helpful. Kinda wish it came with some weird sci-fi music to match the sound effects but that's a pretty small complaint. Anyway - game owns bones. Everyone should play Cogmind.", "timestamp_created": 1508500485, "timestamp_updated": 1508500485, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35857376": {"recommendationid": "35857376", "author": {"steamid": "76561197971121280", "num_games_owned": 314, "num_reviews": 5, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1508418699}, "language": "english", "review": "Awesome game! It's a bit pricey, but the dev explains himself here: http://www.gridsagegames.com/blog/2017/01/pricing-roguelike/\n\nAll in all, it's worth the money. I've never played anything quite like it before. You've probably already decided whether or not you would like it based on looking at the screenshots, but if you're on the fence I say take the plunge.", "timestamp_created": 1508482045, "timestamp_updated": 1508482045, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.521542", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35855037": {"recommendationid": "35855037", "author": {"steamid": "76561197972835179", "num_games_owned": 495, "num_reviews": 3, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1511758706}, "language": "english", "review": "Remember Cyborg Justice for the Genesis? Pulling your enemy's arms and legs off, replacing your own? Same premise, but as a roguelike, and with a LOT more options.\n\nWhere it differs from other roguelikes is that your character has no race, class, skills or attributes to consider. Levelling up consists of getting additional slots to stuff more gear into your core to make you more murdery, or stealthy, or hacky, and so on. The item degredation and destruction comes quick, but so do replacement items, so the game constantly keeps you on your toes and pressures you to change up your play style.\n\nI cannot recommend this one enough. Buy it!", "timestamp_created": 1508471289, "timestamp_updated": 1508471289, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.502283", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35853140": {"recommendationid": "35853140", "author": {"steamid": "76561198024842995", "num_games_owned": 152, "num_reviews": 3, "playtime_forever": 469, "playtime_last_two_weeks": 0, "last_played": 1508899783}, "language": "english", "review": "A must-buy for roguelike fans. Beautiful UI and effects, completely intuitive controls, TONS of depth and character costomization.", "timestamp_created": 1508462546, "timestamp_updated": 1508462546, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35852975": {"recommendationid": "35852975", "author": {"steamid": "76561198001784615", "num_games_owned": 215, "num_reviews": 2, "playtime_forever": 2297, "playtime_last_two_weeks": 1, "last_played": 1513744161}, "language": "english", "review": "I don’t usually leave a lot of reviews, but this game is not a usual roguelike.\n\nIf you like slow methodical gameplay this title is definitely for you.\n\nIf not it could still be for you because it is one of the most accessible roguelikes I have ever come across. The controls and contextual feedback are a huge plus that more games in the genera could really take some inspiration from.\n\nStep into [b]Cogmind[/b] a sentient machine waking up in the bowels of a futuristic super structure run by a not so nice AI with one goal.. Escape. In this quest you’ll bolt items gathered from the world and destroyed enemies onto yourself, but this is constant as like the environment every part of you can be destroyed.\n\nThere are so SO many components to check out and add to your loadout. Many of them have awesome sound and particle effects and/or hugely impact your gameplay options creating a very dynamic experience that keeps things fresh.\n\nKnowing I have only scratched the surface (or the subsurface as it were) means the best is still yet to come, yet I am already impressed with the experience of Cogmind thus far.\n\nIf you are thinking at all of buying this game - do it.", "timestamp_created": 1508461842, "timestamp_updated": 1508461935, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.521531", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35852794": {"recommendationid": "35852794", "author": {"steamid": "76561197993425754", "num_games_owned": 151, "num_reviews": 2, "playtime_forever": 1440, "playtime_last_two_weeks": 0, "last_played": 1509750872}, "language": "english", "review": "it's good", "timestamp_created": 1508461029, "timestamp_updated": 1508461029, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.467480", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35850539": {"recommendationid": "35850539", "author": {"steamid": "76561198014196842", "num_games_owned": 88, "num_reviews": 2, "playtime_forever": 1964, "playtime_last_two_weeks": 0, "last_played": 1509995969}, "language": "english", "review": "Long time roguelike fan. Discovered Cogmind just a month ago and the only thing I saw was this flashy trailer. Bought the game and didn't regret it, this game is worth the time and money", "timestamp_created": 1508450884, "timestamp_updated": 1508450884, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.476190", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35847919": {"recommendationid": "35847919", "author": {"steamid": "76561198021225738", "num_games_owned": 284, "num_reviews": 1, "playtime_forever": 361, "playtime_last_two_weeks": 0, "last_played": 1508442269}, "language": "english", "review": "Cogmind takes inventory management and item destruction and somehow makes them into fun and interesting mechanics. The interface, sound design, mechanics, lore, and setting form a cohesive whole that is just plain cool to interact with.\nIt's pretty hard, also, but there are settings that can mitigate that at least a little for newcomers to the genre.\nIf you do buy the game I would strongly recommend reading the survival tips in the in game manual, even if you've played other roguelikes.", "timestamp_created": 1508442515, "timestamp_updated": 1508442515, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35846818": {"recommendationid": "35846818", "author": {"steamid": "76561198015092914", "num_games_owned": 598, "num_reviews": 29, "playtime_forever": 184, "playtime_last_two_weeks": 0, "last_played": 1510514546}, "language": "russian", "review": "Игра интересная, у неё есть глубина. Идёт даже на нетбуках хрен знает каких годов. Выглядит вполне норм, не слишком жжёт глаза с тайлами. Музыка и звуки приятные. Мультиплеера и русского нет и не будет никогда. Интересная реализация, но цена отпугивает, это впрочем объяснено создателем как расчёт на очень небольшую аудиторию, которая купит его игру и за 10 и за 20 долларов.", "timestamp_created": 1508439728, "timestamp_updated": 1508439728, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.540000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35844802": {"recommendationid": "35844802", "author": {"steamid": "76561198015236040", "num_games_owned": 438, "num_reviews": 7, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1508434600}, "language": "english", "review": "It's really good.", "timestamp_created": 1508434718, "timestamp_updated": 1508434718, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35844343": {"recommendationid": "35844343", "author": {"steamid": "76561197989108808", "num_games_owned": 1073, "num_reviews": 3, "playtime_forever": 455, "playtime_last_two_weeks": 0, "last_played": 1509373353}, "language": "english", "review": "Innovative roguelike that does some truly revolutionary things with ASCII. Combines a roguelike experience with a better UI, brings the genre screaming to modern times in terms of ASCII-based UI. That alone would've been good enough, but the gameplay of utilizing parts off of enemies you've killed is a brilliant little innovation. Truly a special roguelike and one that points to a bright future for the genre.\n\nAlso, I love all the sound effects. So great!", "timestamp_created": 1508433452, "timestamp_updated": 1508433452, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.548796", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35842338": {"recommendationid": "35842338", "author": {"steamid": "76561198045960083", "num_games_owned": 87, "num_reviews": 2, "playtime_forever": 1971, "playtime_last_two_weeks": 533, "last_played": 1514060141}, "language": "english", "review": "Found out about this game from Avaak. I have loved every single moment so far. Even when I think I have the game generally figured out it is still able to throw me for a loop with either a new enemy or mind blowing piece of lore. It has a high level of polish for such a simplistic game. \n\nJimmy Johnson once said \"The difference between ordinary and extraordinary is that little extra.\" To me, the devs really nailed the little things.", "timestamp_created": 1508427770, "timestamp_updated": 1508427770, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35841321": {"recommendationid": "35841321", "author": {"steamid": "76561197971376580", "num_games_owned": 364, "num_reviews": 1, "playtime_forever": 1006, "playtime_last_two_weeks": 0, "last_played": 1511620689}, "language": "english", "review": "Sci-fi + ASCII-Roguelike + Indiegame = I am fucking intelligent (Almost as intelligent as Rick & Morty fans)! And soon i will start sniffing my own farts if i play even more Cogmind.", "timestamp_created": 1508425017, "timestamp_updated": 1509106617, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35840233": {"recommendationid": "35840233", "author": {"steamid": "76561198045833281", "num_games_owned": 185, "num_reviews": 25, "playtime_forever": 679, "playtime_last_two_weeks": 0, "last_played": 1511590035}, "language": "english", "review": "nethack of the 30th century", "timestamp_created": 1508421815, "timestamp_updated": 1508421815, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35839130": {"recommendationid": "35839130", "author": {"steamid": "76561198001322825", "num_games_owned": 956, "num_reviews": 10, "playtime_forever": 920, "playtime_last_two_weeks": 0, "last_played": 1510459188}, "language": "english", "review": "So yeah, a number of hours in and Cogmind is the real deal.\n\nFeels like there's so much going on with this one.  A retro ascii presentation with modern amenities (alt. tile-set graphics as well).  TONS of raw data in the form of items, weapons, stats, etc.  Walls and walls of text that may sound daunting on paper, but is instead categorized & presented smartly, making the game feel weighty and dense with content.  Wasn't expecting it but the writing & story are high quality as well.  You talk to other robots with unique personalities, pick up logs, hack terminals for info, etc. all fleshing out the world.  Every story bit is numerically cataloged in a Log that remains persistent between runs.  Pulling up that Lore Log reveals that there's hundreds of entries to fill in.  So you keep building the narrative no matter how many times you bite it.  I understand that there's 7 unique endings as well.\n\nPlays way faster than I would have imagined as well.  Feels like BattleBots a bit in that you're always gathering up new gear (mobility, offence, defense, scouting, etc.) to equip yourself with and all those items combine to create an outer armor layer that protects your Core, which contains your true HP.  These various items degrade in combat so you're always on the lookout for something not only new and exciting but also with a high condition as it doubles as shielding.  It's a great push-pull dynamic.  Since it's turn-based it feels kinda XCOM with \"Hit %\" readouts during encounters (Pro-Tip: enable Tactical Display\" in Options for even more in-game combat data). \n\nGame may look real Dwarf Fortress in stills, but in motion it's way more flashy.  Lots of particle effects, screen shake for explosions, text & image overexposure & trails...stuff that makes it feel like a merge of vintage & modern technology.  Surprising amount of unique ambient sound files as well.  Not something you'd expect in this kind of game.  Though on the flip side there's no music, and that's a conspicuous absence.\n\nSo yeah as I said, this thing is the real deal.  I believe it's all made by one guy.  \n\nREALLY digging it so far.", "timestamp_created": 1508418403, "timestamp_updated": 1508418403, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.644451", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35832839": {"recommendationid": "35832839", "author": {"steamid": "76561198049489630", "num_games_owned": 188, "num_reviews": 1, "playtime_forever": 511, "playtime_last_two_weeks": 11, "last_played": 1513918258}, "language": "english", "review": "Incredible. Every choice is a difficult one. There's so many different ways to play, and so many different builds to make. In the same playthrough I went from flying around super fast and stealthy avoiding all enemies, to a heavily shielded tank with a gatling gun and a katana. Don't get attached to your parts, adapt your robot to your needs. And like any roguelike, be prepared to die.", "timestamp_created": 1508389969, "timestamp_updated": 1508389969, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.478469", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35832276": {"recommendationid": "35832276", "author": {"steamid": "76561198158704696", "num_games_owned": 107, "num_reviews": 4, "playtime_forever": 1129, "playtime_last_two_weeks": 0, "last_played": 1509546803}, "language": "english", "review": "An incredibly difficult-yet mostly fair-roguelike. Cogmind takes ASCII art to its full potential, and ensures that every action *feels* impactful thanks to fitting sound and visual effects. The (admittedly massive) wealth of information provided to the user is nonetheless accessible thanks to one of the most responsive and animated UIs out there.\n\nAlso, the game is just really damn fun.", "timestamp_created": 1508387207, "timestamp_updated": 1508387207, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35831486": {"recommendationid": "35831486", "author": {"steamid": "76561197999616683", "num_games_owned": 467, "num_reviews": 13, "playtime_forever": 299, "playtime_last_two_weeks": 0, "last_played": 1508379922}, "language": "english", "review": "What can I say - I'm a lazy man. Even though back in the day I spent quite a bit of time pillaging the rooms and narrow corridors of Rogue, the glorious days of action-packed simplicity quickly faded away, only to be replaced with more and more complex games that pushed the genre forward. While obviously a great trend for those who love their games deep, this also proved to be an intimidating factor for people like me - as studying a myriad of hotkeys before even considering a successful run of ADOM or NetHack became a must. However, as time went on, some modern roguelikes managed to find a middle-ground between streamlining the interface and simplifying the gameplay, and Cogmind is the prime example of this commendable approach.\n\nThe game is extremely easy to delve into - in fact, a blind play is not only suggested, but encouraged in the game's manual. Thanks to the ease of use and clear-cut UI, the exploration of the dungeon becomes a pleasure, not a chore. The most necessary functions are always at the tip of your fingers, the intuitive drag&drop interface takes care of the bulk of your management needs, and you're left with the most important aspect of any true roguelike - strategising. And oh boy does Cogmind shine in this area. \n\nMost of the individual enemies or even enemy groups don't pose an immediate threat to you. In fact, you are quite capable of disposing of hostiles almost right off the bat. However, the mastermind behind the facility that you found yourself in thinks on a global scale - as such, your primary concern is not about immediately destroying whatever you find in front of you, but surviving the long battle of attrition as you navigate your way out of the underground complex. The alarm systems, robot patrols, enemy informers and traps are all connected on a global level. Disturb them too much - and a full-scale army invasion is imminent, in which case no amount of battle prowess will ever save you. However, should you choose to play the system, carefully manipulating the current alarm level, disposing of lone guardbots and avoiding detection, you will most definitely uncover the secrets surrounding this fantastic place - and escape with your core still ticking.\n\nIf you're tired of memorising all the possible combinations of Ctrl+, Shift+ and Alt+, can't be bothered to regulate food and water consumption for basic survival and don't care about intricate differences between picking up items comfortably, quickly or normally (which falls under \"basic\" commands in some old-school roguelike titles), then Cogmind might just be the game to try. An extremely smooth learning curve combined with a novel approach to equipment and an unusual setting set this game apart as a truly outstanding title.", "timestamp_created": 1508383205, "timestamp_updated": 1508383205, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.728060", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35831144": {"recommendationid": "35831144", "author": {"steamid": "76561197970659761", "num_games_owned": 302, "num_reviews": 3, "playtime_forever": 72, "playtime_last_two_weeks": 0, "last_played": 1509154334}, "language": "english", "review": "If you like roguelikes at all, you will like this game", "timestamp_created": 1508381540, "timestamp_updated": 1508381540, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35830988": {"recommendationid": "35830988", "author": {"steamid": "76561198082984967", "num_games_owned": 84, "num_reviews": 17, "playtime_forever": 1881, "playtime_last_two_weeks": 0, "last_played": 1509415097}, "language": "english", "review": "Just get it\nstop thinking about it\nIt's a great rogue-like I'm 25hours in and still finding out new things.", "timestamp_created": 1508380798, "timestamp_updated": 1508380798, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.522120", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35830728": {"recommendationid": "35830728", "author": {"steamid": "76561198092727835", "num_games_owned": 424, "num_reviews": 5, "playtime_forever": 276, "playtime_last_two_weeks": 0, "last_played": 1508905491}, "language": "english", "review": "Have you come from yet another run into the depths of Red Rock ? Maybe chased bits of copper wire in the Rust Wells for an eccentric and frankly rude man that mutters and talks to himself all the time ? Have you wondered what other realms are out there as you snacked on watervine or star apples ?\nWell look no further, you have found it !\n\nThis game is home for anyone familar with the vistas of Qud under Jeweled Dusk, or you know: people who just enjoy classic RL gameplay with modern inovation. \n\nIn short:\nGreat Game developed by talented people \n", "timestamp_created": 1508379609, "timestamp_updated": 1508379609, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.472441", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35829715": {"recommendationid": "35829715", "author": {"steamid": "76561198052232921", "num_games_owned": 50, "num_reviews": 1, "playtime_forever": 1298, "playtime_last_two_weeks": 0, "last_played": 1511220126}, "language": "english", "review": "TL;DR: Buy it.\n\nAs of me posting this review (depending on timing I will be review 39-40) there are no negative reviews and this game deserves to stay that way. Cogmind was brought to my attention 2 days before Early Access release as one of my subscribed Youtubers had played it. I saw it and fell in love. I spent the afternoon  of October 16th refreshing Cogmind's store page waiting on it to release. Needless to say it has been my most anticipated game release this year. I have never played a roguelike before and I can tell you this game even at it's default difficulty is so easy to pick up and play for hours on end, keyboard, mouse, or both. \n\nWhat it advertises, it delivers, and I can't wait to see what's in store later on down the road. I have a couple days off next week for Destiny 2, but I think I'll keep playing this instead.", "timestamp_created": 1508373895, "timestamp_updated": 1508373895, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.497983", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35829191": {"recommendationid": "35829191", "author": {"steamid": "76561197974343533", "num_games_owned": 416, "num_reviews": 5, "playtime_forever": 2709, "playtime_last_two_weeks": 309, "last_played": 1514103212}, "language": "english", "review": "I felt a bit funny about spending this much on a roguelike , but it is worth every penny.", "timestamp_created": 1508371299, "timestamp_updated": 1508371341, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.467480", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35828575": {"recommendationid": "35828575", "author": {"steamid": "76561197971472845", "num_games_owned": 390, "num_reviews": 2, "playtime_forever": 561, "playtime_last_two_weeks": 0, "last_played": 1508639797}, "language": "english", "review": "This is a very unique roguelike with a beautiful aesthetic.\nVery fun and easy to play with both mouse and keyboard support.\n\nEven tho its been released in early access the core game is complete.\n\nYou play as a rogue robot exploring an unknown complex, as you explore and survive you find scavange or make parts to attach to yourself.\n\nI recomend anyone who enjoys roguelikes to try this wonderful game.", "timestamp_created": 1508368272, "timestamp_updated": 1508368272, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35826706": {"recommendationid": "35826706", "author": {"steamid": "76561198038550821", "num_games_owned": 108, "num_reviews": 2, "playtime_forever": 3702, "playtime_last_two_weeks": 11, "last_played": 1514287330}, "language": "russian", "review": "10 отстреленных карбоновых ног из 10", "timestamp_created": 1508360498, "timestamp_updated": 1508360498, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35826604": {"recommendationid": "35826604", "author": {"steamid": "76561198003171282", "num_games_owned": 400, "num_reviews": 134, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1508287679}, "language": "russian", "review": "Спустя 3 года, COGMIND наконец-то релизнули в раннем доступе Steam'а. То, что игра в раннем доступе - не обращайте внимания, вам не подсунут недоделанную кочерыжку, для большинства рогаликов с глубоким геймплеем, это перманентное состояние развития. COGMIND достаточно хардкорный рогалик, с приятным тайлсетом и большими возможностями, от уничтожения всего, что видишь, с помощью десятков различных средств и вооружений, до переработки погибших роботов, с последующей конфигурации различными модулями своего робота, от взлома терминалов и других роботов с последующей перепрошивкой, до доступа к различной информации, включая секретную, от изучения и копирования чертежей, до производства модулей и вооружения, ну и так далее. Игра очень приятная и достаточно легка в освоении, но при этом, согласно традициям жанра, тут нельзя сохраняться, а гибель перманентна и придётся начинать всё с нуля. На мой взгляд, один из лучших рогаликов на темы научной фантастики, далёкого будущего и искусственного интеллекта.\n\n10 модулей из 10", "timestamp_created": 1508360051, "timestamp_updated": 1508361110, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.582173", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35826329": {"recommendationid": "35826329", "author": {"steamid": "76561198002941336", "num_games_owned": 262, "num_reviews": 1, "playtime_forever": 1306, "playtime_last_two_weeks": 0, "last_played": 1508918261}, "language": "english", "review": "Cogmind is a roguelike with a ton of variety, no grinding, a smooth learning curve and lots of tactical depth.\nIt looks amazing, it has positional audio with a ton of different sound effects and the UI is a pleasure to use.\nIt's extremely polished and I highly recommend it to anyone that enjoys the genre.", "timestamp_created": 1508358892, "timestamp_updated": 1508358892, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35823733": {"recommendationid": "35823733", "author": {"steamid": "76561197988827013", "num_games_owned": 252, "num_reviews": 35, "playtime_forever": 734, "playtime_last_two_weeks": 21, "last_played": 1514126349}, "language": "english", "review": "Cogmind is a fascinating game in a very interesting world and so far I am having an insane amount of fun with it.\n\nThe biggest difference aside from the looks is that there is no XP grind, levels and classes. Everything is done with parts that you constantly pick up, upgrade and switch to adapt. Your lifeblood is your core that is partially protected by these parts. Resource management exists in form of energy, matter and heat.\n\nThe control scheme is very intuitive and works with only mouse, keyboard or both and can be switched via a single button press.\n\nWhat I like in particular (aside from general gameplay and feel) is the UI that really supports the games ideas and its design core. This has to be one of the most interesting, functional (drag&drop and a compare-item function in a roguelike) and satisfying UIs I have seen so far. Its usage reminds a bit of tiling window managers with a tabbing function.\n\nThe aesthetics are a nice blend of ASCII and tiles with some graphical effects (cool explosions, fade-ins, graphical glitches if you are corrupted, etc.). You can switch between ASCII and Cogmind-style on the fly. The interface does an awesome job of explaining everything directly or via popups so that the (spoiler free) ingame manual is not really needed. Still, if you want some formulas and examples, feel free to read up.\n\nCogmind features an extensive hacking system that even has a manual option where you can type the commmands. To complete the hacking experience, the commands are cAsE sEnSiTiVe and the console has an auto-complete function.\n\nThe robot world is alive! Destroy something and robots will come to pick items up, clear debris, investigate, rebuild walls, dig tunnels, etc.\n\nThe entire game breathes old meets new.\n\nCogmind now resides along with [spoiler] Deus Ex and Jagged Alliance 2 1.13 [/spoiler] on my \"survival thumb drive\" for the deserted island / rogue ai / robot revolt scenario.", "timestamp_created": 1508350316, "timestamp_updated": 1508451555, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.611307", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35822768": {"recommendationid": "35822768", "author": {"steamid": "76561198023416519", "num_games_owned": 135, "num_reviews": 8, "playtime_forever": 997, "playtime_last_two_weeks": 0, "last_played": 1512958537}, "language": "english", "review": "Absolutely recommend without hesitation.\n\nCogmind is a roguelike in its own class - withOUT classes, or levels, or skills.  As you progress, you gain slots into which you install a vast array of parts, of four categories: power, propulsion, utility, and of course weapons.  This provides both an incredible amount of customization (since you choose what type of slots you gain) and a demand for careful balancing and planning: depending on your preferred means of propulsion (until it all gets blown off), you can only support so much weight before slowing down.  This means you can't fly around bristling with eleventy billion cannons unless you want to go very slow.  Slap on treatds, though...  you must also weigh the energy demands of your various gadgets - scanners, ECM, etc all take energy, as does moving, and firing weapons.  You need enough power for all that.\n\nSo, my experience thus far: scavengers are little assholes. Rocket launchers and grenade launchers make me cackle maniacally, followed shortly by mass devastation.  Watching the ensuing flurry of robots rebuilding in the aftermath is both adorable and engrossing (also tempting if the launcher hasn't gotten blown off). So far I've tried going rambo-mode, flying around sneaky-like, a short lived hacking setup, and now to CRUSH EVERYTHING LIKE A BOSS.\n\nSo yeah, buy it.", "timestamp_created": 1508347066, "timestamp_updated": 1508347066, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35818742": {"recommendationid": "35818742", "author": {"steamid": "76561198074369908", "num_games_owned": 25, "num_reviews": 2, "playtime_forever": 359, "playtime_last_two_weeks": 0, "last_played": 1509132783}, "language": "english", "review": "I have pirated this when it wasn't on Steam, and bying it to redeem myself.", "timestamp_created": 1508335373, "timestamp_updated": 1508335373, "voted_up": true, "votes_up": 13, "votes_funny": 7, "weighted_vote_score": "0.597328", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35814542": {"recommendationid": "35814542", "author": {"steamid": "76561197995010830", "num_games_owned": 435, "num_reviews": 2, "playtime_forever": 220, "playtime_last_two_weeks": 0, "last_played": 1508353352}, "language": "english", "review": "It's reeeal nice for fans of proper roguelikes.", "timestamp_created": 1508320492, "timestamp_updated": 1508320492, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35813575": {"recommendationid": "35813575", "author": {"steamid": "76561198026116101", "num_games_owned": 340, "num_reviews": 7, "playtime_forever": 308, "playtime_last_two_weeks": 0, "last_played": 1509453911}, "language": "english", "review": "Incredibly hard and incredibly rewarding to patience, which i dont have. The game is a continued stuggle for survival, yet somewhat more forgiving for mistakes the later in you are, as your core (the only vital component) becomes tougher and tougher to destroy.", "timestamp_created": 1508316021, "timestamp_updated": 1508316021, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35811580": {"recommendationid": "35811580", "author": {"steamid": "76561198034857645", "num_games_owned": 286, "num_reviews": 1, "playtime_forever": 785, "playtime_last_two_weeks": 0, "last_played": 1508412985}, "language": "english", "review": "+ Challenging, addictive, great UI, intuitive controls, interesting world/lore.\n\n- Not well balanced, occassionaly irritating sound effects, low variety zone generation.\n\n8/10: Unique traditional rogue-like, with an engaged and responsive developer.", "timestamp_created": 1508305637, "timestamp_updated": 1508305637, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.528986", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35811445": {"recommendationid": "35811445", "author": {"steamid": "76561198052030260", "num_games_owned": 45, "num_reviews": 7, "playtime_forever": 66, "playtime_last_two_weeks": 0, "last_played": 1508313029}, "language": "english", "review": "I was not that big on text-based Roguelikes but this one is an exception.\nThis is the most immersive Rogue-like out there, the core-gameplay mechanics are spot on.", "timestamp_created": 1508304992, "timestamp_updated": 1508305062, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35811231": {"recommendationid": "35811231", "author": {"steamid": "76561197970707099", "num_games_owned": 287, "num_reviews": 7, "playtime_forever": 679, "playtime_last_two_weeks": 0, "last_played": 1508596750}, "language": "english", "review": "One of the most accessible roguelikes I've ever played, and I've played almost all of them (all the high and mid popular ones at least). On the launch day, I picked Cogmind up because it looked awesome as heck and I meant to try it quickly before doing something else, but I ended up playing it for 6 hours instead.\n\nYou can, literally, play Cogmind with mouse, with drag and drop interface, making it very simple to access, and the depth through customization, equipment, and general polish of combat and atmosphere are utter brilliance <3", "timestamp_created": 1508304077, "timestamp_updated": 1508304077, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35806572": {"recommendationid": "35806572", "author": {"steamid": "76561198037044572", "num_games_owned": 430, "num_reviews": 65, "playtime_forever": 266, "playtime_last_two_weeks": 0, "last_played": 1510696647}, "language": "english", "review": "One of the crown jewels of the roguelike genre is now on Steam!\n\nThis is a game where you control a robot and you must find the exit to each level while navigating through randomly-generated levels. The main feature here is that you have to pick up and equip weapons and parts so you can properly navigate the enviroments and survive encounters with hostile machines.\n\nIf you are not experienced with roguelikes: Not the best entry point to the genre but if any of the words/sentences Grid-Based, Randomly Generated RPG with permadeath, pretty art, i have nothing to do this entire month and masochism say anything to you then keep this one in mind.\n\nIf you are a roguelike adept then I really recommend you pick this one as the part scavenging,  and overall spectacular attention to detail make this one of the most unique additions to the genre.\n\nAs a beginner on this game (may be like this because I'm a noob :P), the only thing I don't like about the game is that I was expecting more freedom in robot customization but due to the parts taking a lot of damage during combat, I found myself holding on to anything I could just so I wouldn't be left \"naked\" as soon as I came across an enemy squad.", "timestamp_created": 1508281888, "timestamp_updated": 1508281888, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35806369": {"recommendationid": "35806369", "author": {"steamid": "76561198036185942", "num_games_owned": 289, "num_reviews": 3, "playtime_forever": 247, "playtime_last_two_weeks": 0, "last_played": 1508462860}, "language": "english", "review": "Cogmind's setting pulled me in almost immediately, the sound quickly sets the imagination ablaze, the \"robot-like\" ASCII/tile graphics get your imagination going when you get into them, and the exploration, character building, combat, and other systems are fun and deep enough to keep me playing Cogmind for a long time.\n\nThe world of Cogmind is a captivating bit of science fiction and mystery. The sprawling facility is dotted with terminals that you can hack for, among other things, interesting lore. Some information is very heavily guarded, like the entry on \"Humans.\" All of the information you find is added to a log that persists between runs, so you can eventually fit all of the pieces together and understand the world of Cogmind.\n\nThe game has an ASCII mode and a tile mode, which you can switch between at any time with the F3 key. All objects are labelled when they come into view. Everything is also color-coded; for example, all hostile robots are yellow. The sound in Cogmind also really helps paint a picture of the facility in your mind: my favorite is listening to the ceiling crumble after blowing some things up with the grenade launcher.\n\nThe combat creates a lot of interesting and fun decisions. You might start shutting off systems to save energy, or run away for a little bit for your systems to cool down. Sometimes parts will get destroyed and you'll have to fight without a leg, or swap in your backup power source, or run over to some destroyed robot while under fire and attach their weapons to yourself to fire back.\n\nFinally, this is a roguelike, so every run is different. There are tons of parts to experiment with, and there are a lot of different ways to put parts on a robot brain and then use those parts to explore a sprawling complex with lots of interesting floors, machines, and enemies ;) If you like science fiction or are looking for an entry point into \"classic\" roguelikes, look no further.", "timestamp_created": 1508280960, "timestamp_updated": 1508281223, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35806109": {"recommendationid": "35806109", "author": {"steamid": "76561198016707912", "num_games_owned": 476, "num_reviews": 38, "playtime_forever": 776, "playtime_last_two_weeks": 0, "last_played": 1508968159}, "language": "english", "review": "Ok, so just one story. I was building a bot that mainly used guns, and I was doing pretty okay, when I fell down to some place that was full of dead bots. The \"crushers\" there (big bots who ram you) almost killed me, I lost all my parts and somehow got corrupted data at 20%. \n\nBefore exiting the level, I was able to snatch a part that should repair my corruption levels, but the problem was, it was a non-working part. I kept it in my inventory in case I can fix it somehow. \n\nNext level, still hurt, I was slowly stealing parts from neutral serfs and such, ramming them because I had no weapons, to somehow build up again. And then I found a weapon room... full of Katanas. I was able to equip 3 of them. It was awesome, luring enemy bots to doorways, then unleash the Triple Katana Fury (even though you mostly attack with one, I added some acuators that allowed me to sometimes attack with more). Finally I was able to fix the computer that slowly fixed my corrupted parts too.\n\nLater I died on that run (getting into a firefight instead of running away or taking better position), but damn, that run with the katanas was great.", "timestamp_created": 1508279995, "timestamp_updated": 1508279995, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35803455": {"recommendationid": "35803455", "author": {"steamid": "76561197983872778", "num_games_owned": 305, "num_reviews": 9, "playtime_forever": 936, "playtime_last_two_weeks": 0, "last_played": 1508460697}, "language": "english", "review": "This game has a lot of cool mechanics (pun intended) that set it apart from other roguelikes. It has an awesome feel of sneaking around inside this giant facility, ripping other bots apart to graft to yourself. My first time sitting down to play it had me going for several hours before I even noticed.", "timestamp_created": 1508270648, "timestamp_updated": 1508270648, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.538710", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35802657": {"recommendationid": "35802657", "author": {"steamid": "76561197966146521", "num_games_owned": 361, "num_reviews": 2, "playtime_forever": 7090, "playtime_last_two_weeks": 0, "last_played": 1510374737}, "language": "english", "review": "An extremely well refined interface makes this much more accessible than other roguelikes.\n\nAdd to this a resizable graphical tileset, appropriate sound design, terminal-styled animation, a pervasive text-driven \"hacking\" (random chance) system, plus some light lore- [spoiler][code]>>Query(■■■■■■)\n\nHa ha ha.[/code][/spoiler] -And this is one of the few games that when I saw it, I had to have it.\n\n(Slightly annoied at Steam for misreporting the exact release time, and at myself for missing the initial funding.)", "timestamp_created": 1508268229, "timestamp_updated": 1508296501, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.518349", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35800743": {"recommendationid": "35800743", "author": {"steamid": "76561197970479670", "num_games_owned": 914, "num_reviews": 28, "playtime_forever": 560, "playtime_last_two_weeks": 0, "last_played": 1512455237}, "language": "english", "review": "A love letter to the roguelike genre, Cogmind fundamentally examines each of the mechanics behind that type of game and turns them into games of their own.  \n\nWhat's a @ do?  Well, they move.  So what if we make your character a robot that you can swap in varous types of mobility, from legs to wheels to hovercraft.  A @ attacks, so how about your character can attach weapons to itself and fires them all per turn.  A @ restores energy per turn to do things, lets look at that somewhat literally, energy in the form of power generators and batteries.  A @ does all sorts of interesting utility things,  lets stick those in utility slots.  Your inventory becomes your character, and the entirety of your character becomes this sort of evolving classless microcosm with lovely, lovely stat numbers.\n\nWhat about the map?  Well, the map should be generated with a high degree of variety and excellent procedural generation mechanics.  Done.  But what if we want to make the map a living thing?  What if it's inhabited by robots which actually move around the level, expanding the map, rebuilding lost bits, picking up and moving scrap?  Lets give everyone and everything on the map a reason to be there.  Now *this* is a roguelike map with some significance!\n\nHow about the lore?  Given that all the robots on the map have a reason to be there, you emerge as a strange robot looking to understand a strange world.  Scattered throughout the level are many terminals which are very miserly with their function, but with multiple runs and lucky rolls, you can pry the story of the world out of them.  Each failed hack risks bringing down the guards upon you, but what can be more precious than secrets to an amnesiac starving for answers?  A certain satisfactory dynamic narrative emerges, not only a greater understanding of this robot-run world, but your character's place in it.\n\nDo you think roguelikes require difficulty?  Cogmind is difficult.  In fact, for the most part I would say you would be better rewarded with stealth, because the setting is one of a hostile world where you are hopelessly outnumbered if you attract too much attention.  I have played more difficult roguelikes, but I have to say I really like the balance I see here.  You will die, of course, with tradtional permadeath.  But each time, you will have learned something new, and have an interesting new strategy to consider going at it.  Like any good roguelike, being brutally returned to rock bottom is an exciting starting point.\n\nDo you think roguelikes require ASCII graphics?  Cogmind has you covered.  In fact, whether you run in ASCII mode or not, you're in for a treat of some of the finest tile-based animations to grace a parser.\n\nIt all ties together expertly, with a craftman's attention to nailing the fundamentals and implementation.  All this, well worth your $20, rock solid and playable, and he calls it an Early Access game.  \n\nOn top of that, I have to say the developer's a real nice guy.  He practically runs the roguelikedev reddit and stoicly puts up with my blathering about the things I do in Unity which can hardly even hold a candle to the magnum opus that is Cogmind.  I like to dream, but I lack focus.  But this game is a lovely reality, and an inspiration to what I might do if I can get my act together.  So yeah, maybe I'm a little biased, but that doesn't change that I have been playing games for decades and I hardly ever see them as ambitious and well-built as Cogmind.", "timestamp_created": 1508262151, "timestamp_updated": 1508263488, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.542393", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35800025": {"recommendationid": "35800025", "author": {"steamid": "76561198074660467", "num_games_owned": 50, "num_reviews": 1, "playtime_forever": 171, "playtime_last_two_weeks": 0, "last_played": 1508705830}, "language": "english", "review": "Amazing first impression. I've been on the mail list for more than a year and it's finally on Steam. It's hard to believe but YAY!\n\nTo people who have doubts: Give roguelike a chance!\n\nThe AI is amazing. Gameplay experience is amazing. ASCII art is top notch.", "timestamp_created": 1508259932, "timestamp_updated": 1508259932, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.504394", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35799177": {"recommendationid": "35799177", "author": {"steamid": "76561198022579261", "num_games_owned": 171, "num_reviews": 3, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1508345419}, "language": "russian", "review": "Офигенно.\nНо сложно.\nНО! Офигенно.", "timestamp_created": 1508257347, "timestamp_updated": 1508257347, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35796692": {"recommendationid": "35796692", "author": {"steamid": "76561198039740980", "num_games_owned": 481, "num_reviews": 9, "playtime_forever": 881, "playtime_last_two_weeks": 0, "last_played": 1508679126}, "language": "english", "review": "--Story Time--\n\nSo, my first playthrough I got lucky and find two grenade launcher. I was blasting through everything and everyone with these two bad boys. Nothing can stop me, I feel invincible. Then, as I was following the location of a terminal through a long tunnel, suddenly something shooting at me. It miss but the projectiles hit the wall arround me and suddenly it collapsed. I was stuck. I have nowhere to go. After much contemplation, I decided to try to blast my way out with my beloved grenade launcher. But alas, the explosion blast through my shield and my dying core couldn't take it. I was killed instantly by my own weapon and it was really fun. What a game.\n\n--Review--\nCogmind is one of the best roguelike games that actually adhere to the rules of roguelike and improving it with loads of unique features, such as particle effect, amazing sfx, and destructible environment.\n\nPros :\n+ Beautiful tiles and UI\n+ Amazing particle effects\n+ Tactical combat\n+ Great sfx\n+ Deep lore\n+ Great atmosphere\n+ Hard as hell\n+ Robots!!\n\nNeutral\n= Tutorial a bit under developed but I like exploring and figuring things out on my own\n\nCons\n- Hard as hell\n\nSo, if you like roguelike but with robot, guns (load of it), and explosion, Cogmind is for you.", "timestamp_created": 1508251072, "timestamp_updated": 1508251072, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.518349", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35796301": {"recommendationid": "35796301", "author": {"steamid": "76561198022198651", "num_games_owned": 190, "num_reviews": 1, "playtime_forever": 687, "playtime_last_two_weeks": 0, "last_played": 1508262040}, "language": "english", "review": "Pretty good", "timestamp_created": 1508249997, "timestamp_updated": 1508249997, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.480391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35795263": {"recommendationid": "35795263", "author": {"steamid": "76561198052277875", "num_games_owned": 213, "num_reviews": 45, "playtime_forever": 309, "playtime_last_two_weeks": 0, "last_played": 1508944605}, "language": "english", "review": "Awesome roguelike, looks amazing as well. Looking forward to many hours playing Cogmind, happy to support it's development and it's devs.\n\n---------------------------------------------\nSome first impressions:\n\nControls: I found the controls for Cogmind, whether you're using keyboard only or using the mouse as well, work very well and smoothly, not like Dwarf Fortess or Cataclysm: Dark Days Ahead, whos controls take a bit of time learning and are slightly clunky (not to hate on DF or cdda, love both games!). The controls for Cogmind are very easy for newcomers to learn quickly and are well explained. UI works and looks great, and really gives you the feel of being some sort of robot-thing. Reminds me alot of the UI that Duskers has. \n\nGraphics: The default tileset for Cogmind looks good, clean, and crisp for a roguelike, but where the graphics for Cogmind really shines is it's UI (like I said earlier, beautiful and very atmospheric) and the graphical effects of weapons, items (such as scanners), explosions etc... are perfect and impressive while still remaining true to its 2D roguelike roots. Really pushing the bar for roguelikes everywhere. \n\nGameplay: Fast-paced battles while trying to stay alive and figure out what's going on, unsure if you'll even make it out of this fight. Try to stay alive, be it by fighting, sneaking and avoiding, run-and-gunning, searching for more loot to better equip yourself with weapons and items, all the while looking for answers to the many, many questions that lurk within Cogminds' setting.", "timestamp_created": 1508247925, "timestamp_updated": 1508333402, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.493262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35792919": {"recommendationid": "35792919", "author": {"steamid": "76561197961972851", "num_games_owned": 1333, "num_reviews": 7, "playtime_forever": 649, "playtime_last_two_weeks": 0, "last_played": 1508537717}, "language": "english", "review": "I've been following this game for a while on the roguelikes subreddit. I read the developer's blogs and played the early version of the game. Decided to wait for Steam to pick it up. It's really surprisingly impressive to see in action. The images don't do it justice. The variety of items and the complexity of combat make it enjoyable to play. I'm looking forward to playing more.", "timestamp_created": 1508242568, "timestamp_updated": 1508242568, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35792644": {"recommendationid": "35792644", "author": {"steamid": "76561198001872579", "num_games_owned": 407, "num_reviews": 10, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1508428512}, "language": "english", "review": "Steam wants me to put something here to give a thumbs up. Thanks for the literacy test, Steam.", "timestamp_created": 1508241779, "timestamp_updated": 1508241779, "voted_up": true, "votes_up": 2, "votes_funny": 3, "weighted_vote_score": "0.452153", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35792493": {"recommendationid": "35792493", "author": {"steamid": "76561198006756028", "num_games_owned": 84, "num_reviews": 8, "playtime_forever": 1450, "playtime_last_two_weeks": 0, "last_played": 1509239079}, "language": "english", "review": "All the lights, sounds, and movements feel really solid. Cant wait to come back home, ignore my girlfirend, and be the cogmind. Feels like brouge but with a million times more cool stuff...", "timestamp_created": 1508241202, "timestamp_updated": 1508241202, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.480391", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35792298": {"recommendationid": "35792298", "author": {"steamid": "76561198024992901", "num_games_owned": 936, "num_reviews": 8, "playtime_forever": 637, "playtime_last_two_weeks": 0, "last_played": 1509057966}, "language": "english", "review": "What an amazing game. Honestly my favorite Roguelike now. Once you get into it you can play how you want and the way it displays particle effects in Ascii art is genius. Pick up this game!", "timestamp_created": 1508240505, "timestamp_updated": 1508240505, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.493262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35790938": {"recommendationid": "35790938", "author": {"steamid": "76561198045706022", "num_games_owned": 1017, "num_reviews": 11, "playtime_forever": 124, "playtime_last_two_weeks": 0, "last_played": 1511736545}, "language": "english", "review": "Cogmind shows off some of the most beautiful ASCII in the genre! A must buy for any rogue-like fans!  Yes, and there is sound!", "timestamp_created": 1508234687, "timestamp_updated": 1508234687, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35789945": {"recommendationid": "35789945", "author": {"steamid": "76561197970596412", "num_games_owned": 287, "num_reviews": 8, "playtime_forever": 447, "playtime_last_two_weeks": 20, "last_played": 1513283064}, "language": "english", "review": "The best Rouge Like game I've come across. \n\nGreat gameplay, control, choices, Lore and UI with a sci-fi perspective playing as a robot who just bolts useable 'stuff' onto themselves to make the going easier and to protect their core (CPU).\n\nCombat, choices, weapons, explosions, particle effects etc are all fantastic.\n\nI've watched a few play thoughs and only recently bought the game and it appears highly stable for an EA (I guess because it's not realy, it's been in development for some 4+ years as far as I know).\n\nHighly recommended.", "timestamp_created": 1508229943, "timestamp_updated": 1508229943, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35789798": {"recommendationid": "35789798", "author": {"steamid": "76561198041717774", "num_games_owned": 1681, "num_reviews": 44, "playtime_forever": 141, "playtime_last_two_weeks": 0, "last_played": 1508675270}, "language": "english", "review": "+Unique, polished roguelike\n+Great sound design, hear the hum of machines you're near, the crumbling of collapsing caves, unique noises for all kinds of weaponry etc.\n+Some of the best ASCII the genre has to offer\n+Interesting lore/story behind it all\n+Replayable as all hell due to the massive variety in ways to paly\n\n-There aren't any cons, for what this game sets out to do it achieves it all, it's being frequently updated, and the dev is active with player feedback.\n\nIf you like roguelikes this game is a must-buy.", "timestamp_created": 1508229143, "timestamp_updated": 1508229143, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35788658": {"recommendationid": "35788658", "author": {"steamid": "76561198052227203", "num_games_owned": 124, "num_reviews": 5, "playtime_forever": 17, "playtime_last_two_weeks": 0, "last_played": 1508223684}, "language": "english", "review": "Played this before it got greenlighted on Steam. This is an excellent roguelike filled with passion and technical aspects.\n\n+ The interface is very immersive and very well worked\n+ The gameplay is nice and different each time\n+ You can build yourself scrapping pieces you found around the areas & destroyed enemies\n+ You can play as a solid tank or be more elusive and squishy or other combinations\n+ The community's feedback has been listened constantly\n\nI can only reccommend this game. Beatiful.", "timestamp_created": 1508223725, "timestamp_updated": 1508223748, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35788019": {"recommendationid": "35788019", "author": {"steamid": "76561198092182539", "num_games_owned": 706, "num_reviews": 23, "playtime_forever": 262, "playtime_last_two_weeks": 0, "last_played": 1508363014}, "language": "english", "review": "A great Rougelike. So many things to learn, collect, hack, explode, find, and experiment with.", "timestamp_created": 1508220362, "timestamp_updated": 1508220362, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35786597": {"recommendationid": "35786597", "author": {"steamid": "76561197960446943", "num_games_owned": 498, "num_reviews": 5, "playtime_forever": 131, "playtime_last_two_weeks": 0, "last_played": 1508435762}, "language": "english", "review": "Excellent roguelike with beautiful ASCII.", "timestamp_created": 1508214249, "timestamp_updated": 1508214249, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35786105": {"recommendationid": "35786105", "author": {"steamid": "76561198042518533", "num_games_owned": 314, "num_reviews": 17, "playtime_forever": 3451, "playtime_last_two_weeks": 0, "last_played": 1513146270}, "language": "english", "review": "Really good!\nRoguelike!\nGreat interface!\n\n...../ )\n.....' /\n---' (_____\n......... ((__)\n..... _ ((___)\n....... -'((__)\n--.___((_)\n\n", "timestamp_created": 1508211893, "timestamp_updated": 1508211893, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.462233", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35785629": {"recommendationid": "35785629", "author": {"steamid": "76561198083594058", "num_games_owned": 125, "num_reviews": 4, "playtime_forever": 109, "playtime_last_two_weeks": 0, "last_played": 1509982320}, "language": "english", "review": "I played this game off steam, have nothing valuable to say that the other reviews haven't already said, and am only doing this review to give the metrics a boost.", "timestamp_created": 1508209795, "timestamp_updated": 1508209795, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35785224": {"recommendationid": "35785224", "author": {"steamid": "76561198774721828", "num_games_owned": 1, "num_reviews": 1, "playtime_forever": 21, "playtime_last_two_weeks": 0, "last_played": 1508706026}, "language": "english", "review": "I initially bought this game back in Alpha 13 due to some favorable comparisons to Brogue. Brogue appealed to me as a game with great tactical depth and meaningful decision-making, where every run was vastly different and you had to actually focus to make it out alive, couldn't just set up the same-ish thing in every seed once you'd learned the game a bit.\n\nI have now played Cogmind for some hundreds of hours. While the game is less demanding than Brogue (from the perspective of simply winning, which is still quite challenging), with less seed variance (an approach with pros and cons), the game has effectively managed to appeal to me in a similar manner, in consistently providing decisions with satisfying amounts of complexity that can lead to some very interesting results. There is little in gaming that has been more fun to me than designing various killer-robots consisting of over 20 salvaged/found/fabricated parts in the lategame, with a similar amount of items in inventory, constantly modifying the specific layout based on finding better parts or simply replacements/alternatives to damaged ones, getting some actual pusback from the Complex such that even the best bots still have to think about their actions.\n\nI would recommend the game to anyone with an appreciation for challenging and complex game mechanics, and Cogmind gets a lot of bonus points for presenting that complexity in a way that is viscerally satisfying, this is the one clear advantage Cogmind has over Brogue and similar games: it's rare to get such strategic depth [i]and[/i] astonishing sound effects, beautiful ASCII art for over 800 items, lore entries that add a lot of flavor to exploring the world, and an actual interesting story to discover, even if it is difficult to fully discover, being sort of in the background and featuring challenges beyond simply making it out of the Complex alive.", "timestamp_created": 1508207711, "timestamp_updated": 1508253556, "voted_up": true, "votes_up": 23, "votes_funny": 0, "weighted_vote_score": "0.602295", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35784456": {"recommendationid": "35784456", "author": {"steamid": "76561197968567439", "num_games_owned": 1265, "num_reviews": 18, "playtime_forever": 31, "playtime_last_two_weeks": 0, "last_played": 1509747318}, "language": "english", "review": "Amazing modern major roguelike by amazing people.", "timestamp_created": 1508203800, "timestamp_updated": 1508203800, "voted_up": true, "votes_up": 41, "votes_funny": 0, "weighted_vote_score": "0.629389", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
