{"query_summary": {"num_reviews": 20, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 52, "total_negative": 1, "total_reviews": 53}, "reviews": {"38634802": {"recommendationid": "38634802", "author": {"steamid": "76561198014383949", "num_games_owned": 2886, "num_reviews": 95, "playtime_forever": 248, "playtime_last_two_weeks": 0, "last_played": 1512361315}, "language": "english", "review": "The lighting gimmick sounded neat, but I can't say it works for me so far. Light comes from a different direction depending on the time of day, but the time of day changes very rapidly which produces an encircling effect on more open areas of the level and if you're stuck in the vampire form this is gonna block you completely from moving until the (short) night comes. At that point \"gameplay\" seems to be reduced to hiding behind pillars and waiting for the light to go away, in a game where waiting means dying.\n\nEven though I imagine that with experience you could look at the minimap, clock and enemy placement to plan your every step, this sounds utterly tedious and not fun at all. At least regroup all info needed for movement decisions in a single place. To be honest I think the light would work much better as a static or very slowly changing feature rather than a bewildering whirlwind, given appropriate mechanics changes so that vampires can traverse these areas if they use the correct tools.\n\nI also got stuck in a situation where a cave was the only place I could safely go (I was a vampire on low life and the level above was very bright), but the way was blocked by water which meant insta-death. Means of changing from one form to the other are limited, and this seems to easily create gameplay dead-ends like this one.\n\nSo it saddens me to give a bad review to a traditional roguelike, but the flagship mechanic is really unintuitive and bothersome. I'll update my review if I revisit the game and it turns out to be actually fun.\n\n(For the record, I like some of the other innovations, such as giving you three possibilities for each potion instead of completely removing the ID system like some boring roguelikes do. Nice compromise between push-your-luck and predictable strategy. The game seems otherwise solid in its RPG and item mechanics.)", "timestamp_created": 1514145932, "timestamp_updated": 1514190237, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.527901", "comment_count": "3", "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "38304185": {"recommendationid": "38304185", "author": {"steamid": "76561197970314107", "num_games_owned": 1136, "num_reviews": 409, "playtime_forever": 98, "playtime_last_two_weeks": 21, "last_played": 1513231678}, "language": "english", "review": "Golden Krone Hotel has this incredibly jaunty tune that plays when you die, and I cannot get enough of it. Seriously, it’s like a little festival breaks out as your character fades away and the restart options rise into view. It’s such a little thing but it takes nearly all the sting out of dying, which is huge in a game where you die as much as you will here. It’s also an excellent example of the care and attention put into crafting this roguelike adventure, and you can expect to find plenty more as you work your way through its twisting halls.\n\nYou are Sorina Arobase, a renowned general and famed vampire killer. She’s on a mission of revenge against exiled vampire prince Fane, probably having something to do with how she tends to turn into a vampire from time to time. Her quest has brought her to the vast and looming Golden Krone Hotel, a mighty structure of many floors, chambers, and deadly inhabitants. Only by scrounging for gear and picking her battles will she eventually reach the dark object of her journey.\n\nSo yeah, she turns into a vampire sometimes. Golden Krone Hotel is very much a classic roguelike with its turn-based grid-based bump-based combat, but adorned with clever mechanics like bouts of vampirism. You generally start off in human form, with a meter that slowly fills over time. Once it’s full you turn pale and ravenous, changing not only your looks but your stats, your skills, and how you interact with enemies and the environment. The floors are full of humans and vampires alike, and when in a particular form you’ll only be attacked by those of the opposite species. Sunlight will burn you as a vampire and darkness will hide you, but as a human dark places limit your sight. And blood heals vampires, of course, but as a human you’ll need to find time to rest.\n\nThe duality of your character is a major reason this title feels so fresh every time you start up a new character. You’ve always got to mind the meter as a human so that you don’t change while bathed in sunlight or surrounded by soldiers. And as a vampire you need to be lapping up blood whenever possible and carefully considering when to use your potions that restore you to human form. There’s a lot of strategy wrapped up in this system, enough to make floors feel completely different depending on which form you approach them in.\n\nAs if that wasn’t enough to consider, there are also twelve unlockable classes (disguises, they call them here) that start you off with different stats, skills, and forms. Skills can be learned from books you find but only in human form, and they provide powerful effects like invisibility and knockback. There’s also a unique potion system that starts with every vial you find unidentified, but shows three possibilities of what it could be. For once this makes IDing items fun because you almost always  have to test them to tell, which will land you in situations where you really needed an antidote and gulped a face-full of noodles instead.\n\nThe rest of the structure is quite streamlined, with basic tiers of equipment that auto-equip if better than what you have and a simple leveling system with three familiar stats. This allows you to focus most of your attention on the unique systems and, of course, the challenge. Golden Krone Hotel is balanced around individual enemies being plenty deadly if you’re unprepared, and groups nearly impossible to overcome. You’ll need to make the most of your forms and your skills to survive more than just a few floors because the difficulty curve can feel like a brick wall until you really grok the strategy. The game has easy and normal difficulty modes but I’m still beating my head against the early stages of easy here.\n\nIt’s an unusual mix to be sure, a game with simple, unique systems and precipitous challenge. You would think the winning strategy would be obvious but it really isn’t, being heavily dependent on enemy composition and your form and conditions and the environment around you. The design gives you fresh new tools to overcome traditional roguelike challenges, and it produces a title that feels like a classic without becoming boring or familiar. It’s good for short sessions and silly deaths, or long marathons and serious focus, and manages to be fun either way.\n\nThe crunchy pixel art is perfect for a retro-styled roguelike, and there’s even an option included to set it all the way back to ASCII. You already know what I think about the soundtrack but the effects and ambiance is top-notch as well, selling the gothic decay of the grand structure you find yourself in. It’s a little harder to hang with than most roguelikes you’ll find on Steam now, but the unique elements stand out more than enough to make it worth it. Golden Crone Hotel has the charm to keep me fighting its hordes of beasts and blood-suckers, and I don’t expect the uphill battle to get boring anytime soon.\n\n\n\nDid you enjoy this review? I certainly hope so, and I certainly hope you'll check out more of them at https://goldplatedgames.com/ or on my [url=http://store.steampowered.com/curator/11322459/]curation page[/url]!", "timestamp_created": 1513268210, "timestamp_updated": 1513268210, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.590934", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "38222233": {"recommendationid": "38222233", "author": {"steamid": "76561198071542709", "num_games_owned": 85, "num_reviews": 2, "playtime_forever": 49, "playtime_last_two_weeks": 0, "last_played": 1508040062}, "language": "english", "review": "Great game, and a true roguelike in the style of nethack or DCSS. Gameplay is streamlined down to what makes these kinds of games actually fun.", "timestamp_created": 1512943749, "timestamp_updated": 1512943749, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.471419", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36898586": {"recommendationid": "36898586", "author": {"steamid": "76561198032880891", "num_games_owned": 235, "num_reviews": 1, "playtime_forever": 306, "playtime_last_two_weeks": 0, "last_played": 1507689298}, "language": "english", "review": "This game has a lot of charm and it is a delight to play (even when you lose). It definitely deseserves recognition.", "timestamp_created": 1511403424, "timestamp_updated": 1511403424, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.491318", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36375957": {"recommendationid": "36375957", "author": {"steamid": "76561198006575550", "num_games_owned": 663, "num_reviews": 190, "playtime_forever": 244, "playtime_last_two_weeks": 0, "last_played": 1510031483}, "language": "english", "review": "Hey! This game is awesome. The dynamic lighting is fantastic. Switching between human and vampire is a lot more strategic than it looks at first glance. Also this game is about the action and removes a complicated inventory system. Yet it keeps the unknown potions which is great and keeps each run somewhat randomized. SOLID roguelike game that I have zero regrets buying.\n\nI made a video review:\nhttps://youtu.be/d8w2vMQDqxg", "timestamp_created": 1510150457, "timestamp_updated": 1510150457, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.544748", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36371318": {"recommendationid": "36371318", "author": {"steamid": "76561197991342089", "num_games_owned": 645, "num_reviews": 82, "playtime_forever": 639, "playtime_last_two_weeks": 0, "last_played": 1510523681}, "language": "russian", "review": "[h1]Golden Krone Hotel — вампиры в солнцезащитных очках, оборотни в погонах[/h1]\n\nGolden Krone Hotel — это очень добротный, качественный рогалик, который прекрасно справляется со своей задачей (развлечь, если кто забыл задачу игр) и дает челлендж и фан в близких к идеальным, на мой взгляд, пропорциях. Я так не смог пройти игру и, подозреваю, что и не сделаю этого, но 6 часов я от Golden Krone Hotel просто не отлипал. Если вы чуть более склонны к гринду, чем я, то вы вполне сможете провести в игре 20+ часов – в ней есть чем вас занять на такое время. \n\nГеймплей прост и понятен и мне лично напомнил сразу о двух других играх жанра Hack, Slash, Loot и Rogue's Tale , благодаря чему начать играть в Golden Krone Hotel сможет даже ребенок (без преувеличений). В механиках игры я разобрался минут за 15 и дальше уже просто учился использовать их правильно. С балансом все тоже хорошо и на нормальном уровне сложности игра не ощущается каким-то кошмаром и адом, как это частенько бывает в roguelike играх. \n\nЕсли бы у меня не кончился открываемый контент, то я бы, наверное, до сих пор играл, а не писал обзор Golden Krone Hotel. \n\nОпределенно советую к приобретению всем любителям жанра.\n\n\n[h1]Полный обзор Golden Krone Hotel: http://blast-games.ru/obzori/golden-krone-hotel-obzor/[/h1]", "timestamp_created": 1510131657, "timestamp_updated": 1510131677, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.526028", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "36322468": {"recommendationid": "36322468", "author": {"steamid": "76561197983647413", "num_games_owned": 557, "num_reviews": 1, "playtime_forever": 1497, "playtime_last_two_weeks": 0, "last_played": 1509861484}, "language": "english", "review": "I really enjoy this game. It provides a lot of original mechanics and concepts for rogue likes. It also has a quick play time for a rogue like so it's easy to fit a game in between other things. Tons of options for play, the RNG can be cruel at times but is never unfair andvery few things fall under burden of knowledge. Beyond this the ending is absolutely fantastic. If nothing else it is worth playing for that.", "timestamp_created": 1509977415, "timestamp_updated": 1509977415, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36212895": {"recommendationid": "36212895", "author": {"steamid": "76561198111876302", "num_games_owned": 269, "num_reviews": 1, "playtime_forever": 205, "playtime_last_two_weeks": 0, "last_played": 1509855762}, "language": "english", "review": "I have only just got this game a few hours ago but i was planning to try one run to get a feel for it, and ended up playing through 5. I love the idea of roguelikes but i can't make myself sit down and learn all of the mechanics most of which require tons of hours or a guide to figure out. I could only get like 12 hours into adom or caves of qud before i gave up. This game on the other hand does not have that problem. It has streamlined the roguelike formula which maintaining the original feel. Although they have made the game easier to learn it still retaines a high amount of strategy. It has tips in the game that can help you learn it, and while it starts out easy it can get real rough quickly if you make a wrong move. The vampire human mechanic is awesome trying to figure out when each is beneficial. The humans can use range attacks and spells, while the vampires are beasts at mellee attacks and can sustain off the blood of foes. The sunlight mechanic is also something quite unique. Being able to set up paths of death for undead is quite fun. Overall this game is awesome.", "timestamp_created": 1509615439, "timestamp_updated": 1509615439, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524778", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36152597": {"recommendationid": "36152597", "author": {"steamid": "76561197970938346", "num_games_owned": 300, "num_reviews": 167, "playtime_forever": 2780, "playtime_last_two_weeks": 364, "last_played": 1514085527}, "language": "english", "review": "I still haven't won... but I play only on the hardest difficulty.  When I die it feels like it is almost 100% my fault.\n\nI don't know how TF this game managed to hide this underneath the seemingly crude graphical presentation.\n\nI really like what this game is and I hope it undergoes a lot of improvements in the UI because frankly it is pretty crude.  But the game itself... AWESOME", "timestamp_created": 1509404270, "timestamp_updated": 1509404270, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.498904", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36135106": {"recommendationid": "36135106", "author": {"steamid": "76561197960392466", "num_games_owned": 290, "num_reviews": 2, "playtime_forever": 1540, "playtime_last_two_weeks": 0, "last_played": 1511282755}, "language": "english", "review": "This game is fantastic.  I love roguelikes on paper, but in practice the density of systems that arne't explained at all, item (mis)management and RNG gods keep me from playing them as much as I want to be playing them.  Adom and Caves of Qud should be right in my wheelhouse, but I find myself really wishing I loved them, but never wanting to play them.\n\nTales of Maj'Eyal was the first roguelike that completely won me over with it's great UI, skill system and awesome unique classes and I have been looking for the next roguelike that can grab me like ToME did.  Shout out to Sil here, which has been my stop-gap roguelike here.   This game while very different is my new roguelike obsession.\n\nThe controls are intuitive and simple.  I really wish all roguelikes moved over to wasd movement! \n\nThe game is very tactical and you approach combat differently when in human and vampire form.\n\nWhen I first saw unidentified potions, I felt that sinking feeling in my stomach.  Oh no...  The RNG of potions that insta kill me or win the day are a big thing I hate in roguelike games.  Then I saw the tool tip showing the 3 possible potions it could be.. rejoice!  I now know exactly how bad things could get if I drink that potion and make a calculated decision on the spot.  I find myself using unidentified items far more often in this game.\n\nThe graphics are great for this style of game and the music is fantastic.  \n\nI hope other roguelike developers take note of this one.  There were some fantastic design choices here that keep all of the core tenants of a roguelike but strip out a lot of the frustration usually involved in learning a new game.\n\nHighly recommend if you feel the same way about roguelikes.", "timestamp_created": 1509353147, "timestamp_updated": 1509353147, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.570192", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36133524": {"recommendationid": "36133524", "author": {"steamid": "76561197993924363", "num_games_owned": 347, "num_reviews": 1, "playtime_forever": 172, "playtime_last_two_weeks": 0, "last_played": 1509747349}, "language": "english", "review": "The game is very good. \n\nEDIT: I had some problems at first getting the game to run consistently. However, the issue seems to have been resolved (try a restart, that's always worth doing). Also, the developer has been all over it trying to replicate the issue and making sure everything is working. I can wholeheartedly recommend this game. Not only is the game great and the music wonderful... the support has ben fantastic too!", "timestamp_created": 1509346485, "timestamp_updated": 1509573913, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36066241": {"recommendationid": "36066241", "author": {"steamid": "76561197972865373", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 148, "playtime_last_two_weeks": 0, "last_played": 1509688796}, "language": "english", "review": "This game is a gem of a traditional roguelike. It has all of the featured beloved to veterans of this genre: it is turn based, played on a tile grid, procedurally generated maps, a hunger clock, inventory management and character sheets. But it also has a very streamlined and easy to learn interface, meaning that anyone who loves a good strategy fix or dungeon crawl but who is not familiar with roguelikes can get on board easily andenjoy it as well. On top of all of this it has some really fun and innovative mechanics, including play modes based on vampirism, lycanthropy and being human.  Sun- and moonlight shine through windows burning vampires and invigorating werewolves, allowing you to use them as weapons or forcing you to hide from them, depending on your form.  Like the best games of its genre, it is simple to learn, hard to master, and every playthrough brings its own unique challenges.  I have barely begun to explore this game, but I am hooked!", "timestamp_created": 1509168975, "timestamp_updated": 1509168975, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.517798", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "36031683": {"recommendationid": "36031683", "author": {"steamid": "76561197960683508", "num_games_owned": 239, "num_reviews": 5, "playtime_forever": 1786, "playtime_last_two_weeks": 0, "last_played": 1509878020}, "language": "english", "review": "I'm really enjoying this. Great music, the item upgrade system is simple and sweet, and the sunlight mechanic is awesome. I'll try to give a more thorough review when I have more experience with the game.", "timestamp_created": 1509078551, "timestamp_updated": 1509083995, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.589566", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "35939123": {"recommendationid": "35939123", "author": {"steamid": "76561198192893105", "num_games_owned": 145, "num_reviews": 27, "playtime_forever": 339, "playtime_last_two_weeks": 0, "last_played": 1508702444}, "language": "english", "review": "This roguelike game is easy, fast and funny to play.\nUnfortunately is a bit too simple: it is like the skeleton (mechanics) of the game is very good but is lacking the flesh (content) to buff it.\nThe author had a good idea and did a good job but haven't had the patience to make a great game.\n\nOverall I find the price  excessive for the current content and I can recommend the game only if in (big) sale.", "timestamp_created": 1508741554, "timestamp_updated": 1508741554, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.448347", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "35841152": {"recommendationid": "35841152", "author": {"steamid": "76561198076029180", "num_games_owned": 67, "num_reviews": 12, "playtime_forever": 127, "playtime_last_two_weeks": 0, "last_played": 1508709299}, "language": "english", "review": "This game hits a sweet spot like candy does a cavity. I love the maps, the creatures, the combat system, the fantastic UI and tips, all fantastic. Golden Krone Hotel comes from a great developer who is super chill that has me hook line and sinker for anything to come from this world. I love the morgue files, very fun. Also, you can be a WEREWOLF!", "timestamp_created": 1508424510, "timestamp_updated": 1508424510, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35830588": {"recommendationid": "35830588", "author": {"steamid": "76561198131230522", "num_games_owned": 149, "num_reviews": 25, "playtime_forever": 151, "playtime_last_two_weeks": 0, "last_played": 1508449062}, "language": "english", "review": "Still new to this one but I want to give it a thumbs up so far. There's a great mechanic that underpins the gameplay in Golden Krone Hotel in the sunlight/shape shift thing, and this really sets this game apart from other smaller scale coffee-break style Roguelikes. The developer shows his experience and ingenuity in design here, and whilst the game may come across as quite simple, I can see there's a lot of fun to be had in here. Enjoying it so far, good work man!", "timestamp_created": 1508378833, "timestamp_updated": 1508378833, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.541537", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35196102": {"recommendationid": "35196102", "author": {"steamid": "76561198079217776", "num_games_owned": 199, "num_reviews": 1, "playtime_forever": 2210, "playtime_last_two_weeks": 0, "last_played": 1512575193}, "language": "english", "review": "If you are a fan of roguelikes, this is a game for you. Having played and beaten Dungeon Crawl Stone Soup and NetHack multiple times, I can recommend this game to anyone who wants a streamlined and fast roguelike experience (plays faster and features much less tedium than other roguelikes) that goes beyond the offerings of a standard roguelike. The game, albeit shorter than other roguelikes, features very fleshed out mechanics regarding the different forms your character can take (human, vampire, and werewolf if you play its respective role). Each form plays differently and is required to be used to win the game (there are parts of the game where being a vampire is the best choice and where being a human is the best choice), resulting in an interesting, varied, and fun gameplay experience. If you are considering buying the game, do so: it is a coffee-break roguelike and you will be able to tell whether or not you like it before the 2 hour refund period is over.\n\nTo me, a game review on Steam honestly isn't complete until you mention the game developer and their practices as this is a major factor of how a game will perform in the future. Fortunately, I only have good things to say, further cementing the positive review that I feel so obligated to leave. A mere 4 days ago, I reported 2 bugs (key rebinding causing the game to refuse to load and diagonal ice sliding not functioning properly) via email and I find that this morning's patch not only featured fixes to my bugs, but a new difficulty, new music, and more. To conclude this review, I can leave one guarantee. You won't be disappointed by this game or its developer.", "timestamp_created": 1506313141, "timestamp_updated": 1506313141, "voted_up": true, "votes_up": 22, "votes_funny": 0, "weighted_vote_score": "0.749924", "comment_count": "7", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35129584": {"recommendationid": "35129584", "author": {"steamid": "76561197992733052", "num_games_owned": 552, "num_reviews": 82, "playtime_forever": 102, "playtime_last_two_weeks": 0, "last_played": 1508854697}, "language": "french", "review": "Un roguelike facile d'accès, mais relativement difficile une fois passé les premiers étages Le jeu traite le thème des vampires de manière intéressante avec son système de lumière et de faim. J'ai éditée une vidéo de présentation, si ça attise votre curiosité : http://www.youtube.com/watch?v=3MLVWNfOTtA", "timestamp_created": 1506091724, "timestamp_updated": 1506091724, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "34542456": {"recommendationid": "34542456", "author": {"steamid": "76561198113494909", "num_games_owned": 251, "num_reviews": 14, "playtime_forever": 2143, "playtime_last_two_weeks": 801, "last_played": 1514292764}, "language": "english", "review": "I love this game, it makes me want to shout, throw my hands up and shout. The light mechanics are super interesting and it's tough, which makes it all the more addictive. It is similar to DCSS in some ways, such as multiple branches you can go through. While minimal, I think this streamlined approach works in this game's favor.", "timestamp_created": 1503881865, "timestamp_updated": 1514032557, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.551759", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "34298317": {"recommendationid": "34298317", "author": {"steamid": "76561198121026249", "num_games_owned": 530, "num_reviews": 7, "playtime_forever": 46, "playtime_last_two_weeks": 0, "last_played": 1503274075}, "language": "english", "review": "I grew up spending a lot of time playing games similar to this one, but not as well put together.  The devs have obviously spent a LOT of time thinking about how to improve the roguelike genre, and it has really paid off.  The little touches, like the potion identification system and the fact that you're constantly in danger of turning into a photosensitive vampire, are really brilliant.\n\nIf retro roguelikes are not your thing,  you're not likely to enjoy this game (why even take the time to read the reviews, then?), but if the genre appeals to you, GKH is definitely something you need to pick up and play.", "timestamp_created": 1502936834, "timestamp_updated": 1502936834, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524778", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34296096": {"recommendationid": "34296096", "author": {"steamid": "76561198049779761", "num_games_owned": 246, "num_reviews": 12, "playtime_forever": 100, "playtime_last_two_weeks": 23, "last_played": 1513550006}, "language": "english", "review": "Only just started into this but I have an excited feeling about this game.  Feels worth the $5 on art style alone so far!", "timestamp_created": 1502925947, "timestamp_updated": 1502925947, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.481061", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34267803": {"recommendationid": "34267803", "author": {"steamid": "76561198000488172", "num_games_owned": 1110, "num_reviews": 20, "playtime_forever": 1594, "playtime_last_two_weeks": 0, "last_played": 1508102742}, "language": "english", "review": "Shows a lot of potential. Completly playable as of time of review. Great if you enjoy roguelikes and want something new. Beginer friendly.", "timestamp_created": 1502849214, "timestamp_updated": 1502849214, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.524778", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34224566": {"recommendationid": "34224566", "author": {"steamid": "76561198016242100", "num_games_owned": 249, "num_reviews": 1, "playtime_forever": 1783, "playtime_last_two_weeks": 176, "last_played": 1514320826}, "language": "english", "review": "(Haven't finished the game yet, so my opinion may change.)\nI love Roguelikes - I played Brogue and Dungeon Crawl Stone Soup hundreds of hours. So when I started to play GKH, I was a bit dissapointed - equipment is basically just a number, and it seemed RNG heavy at first, so tactical play was limited.\n\nBut I felt the same way about many other RLs, so I knew I should just keep playing and trying new things. And this was right thing to do, because I was wrong. Playing as human, you are not supposed to fight everything with your standard attack - using magic is most important thing to do, and trying to find best ways to use it. Magic is most reliable - it's better than potions or physical attacks, and it's also very fun to use. Game (on hard difficulty) became much easier and much more tactical after I stopped relying on physical attacks. As a vampire, of course, there is much more physical fighting.\n\nTo new players I would recommend to stick with this game and to try wildly different approaches every time. Don't be afraid to try something new, even if it may get you killed. Game is short, so it's not a big deal to begin again. If you are willing to experiment, and don't forget to use everything you got at your disposal, you will have a good time in this game, especially if you like games with a lot of decision-making, tactics and zero grind. I definitely will add this game to my list of RLs that I play for tens of hours, forget about for a month or two and then start playing it obsessively again.\n\nAnd some things that I still dislike - equipment seems very boring. I don't feel any excitement about getting new sword. While I like every other mechanic in general, this one seems very disappointing and in my opinion, should be replaced with something more interesting that involves decision-making, and not just simple bonus that is completely random. I don't HATE this system, but it feels very \"gamey\" compared to everything else in the game, or even incomplete.\n\nEverything else is very minor and doesn't need to be here, because otherwise it's very fun and challenging game and I'm very thankful for Roguelike Radio episode that finally got me to try it!\n", "timestamp_created": 1502665062, "timestamp_updated": 1502665062, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519508", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "34116765": {"recommendationid": "34116765", "author": {"steamid": "76561198004393508", "num_games_owned": 1270, "num_reviews": 30, "playtime_forever": 606, "playtime_last_two_weeks": 0, "last_played": 1507240834}, "language": "english", "review": "A great coffeebreak roguelike! Sessions are short, sweet, and dangerous.\n\nEssentially you play as a human/vampire who swaps between the forms over time (or with the intervention of potions) and this influences what kind of enemies you have, if you can cast spells or shoot your gun, and if you spontaneously combust in sunlight! Which means this game has an amazing light/time system - depending on the time of the day the light streams in from all cardinal directions, and you can shoot out windows to set your vampiric opponents on fire.\n\nBasically it's a cool mechanic in a cool roguelike that's loaded with interesting takes on the genre's conventions - you identify potions by using them, but they can only be one of three different kinds, which makes guessing WAY safer, and more viable for emergency chugging, as there's a decent chance this potion might teleport you away, which would save your bacon!\n\nThere's a lot of content to this roguelike so far despite the early access, too - there's a comprehensive tutorial, side-branches, different classes, you can talk to all of the non-hostile enemies... it's real solid, and eventually I'll be good enough to meet some of the bosses.\n\nNow, minor downsides: no diagonal movement. This isn't really a downside, but I'm used to it in roguelikes, so it's just...odd. There's also not quite enough level layout variation yet, either. But these are my quibbles and in the end - buy this game.\n\nIt's really, really fun to play and dig into. It's pretty, the music is good, the mechanics are solid, and the dev is still working on making it even bigger and better. :D", "timestamp_created": 1502248241, "timestamp_updated": 1502248241, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "33698110": {"recommendationid": "33698110", "author": {"steamid": "76561198041503910", "num_games_owned": 212, "num_reviews": 13, "playtime_forever": 79, "playtime_last_two_weeks": 0, "last_played": 1499957286}, "language": "english", "review": "Golden Krone Hotel is a fun, fast-paced romp through levels upon levels of procedurally-generated perfection. There are multiple player classes and every playthrough feels different and challenging.\n\nI wanna start by saying that this game won't be for everyone. It's a very strong roguelike, but allows you time to consider your movements through turn-based combat. Levels are filled with vampires, humans, a host of vile creatures that want to kill you, and plenty of loot to make you stronger for the higher levels to come.\n\nI admit that I never could make it up too many levels without making a costly mistake, but a lot of thought was put into making each experience unique. I'd find spells that would single-handedly help me get through the floors, or potions that would randomly teleport me into the midst of danger. It's very cool and I had a fun time just seeing how my experiences would turn out!\n\nAs mentioned before, there are multiple player classes but I had the most luck with the starter class and the abilities they have. Throughout your runs you'll inevitably turn into a vampire at some point, which is a way to play a completely different playstyle. You'll gain health from the fallen blood of your victims, and staying in the darkness renders you invisible. Of course, walking into a ray of light can also spell out your doom, but I digress.\n\nThere are plenty of roguelikes on Steam, but I say, definitely give this one a chance. There's a ton of replay value, runs are quick, and it's fun to explore and see how far up you can get!", "timestamp_created": 1500648136, "timestamp_updated": 1500648136, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.522716", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "33280060": {"recommendationid": "33280060", "author": {"steamid": "76561198037259809", "num_games_owned": 498, "num_reviews": 40, "playtime_forever": 406, "playtime_last_two_weeks": 0, "last_played": 1507373207}, "language": "english", "review": "Great 'introductory' roguelike with good depth. It lends some mechanics from games such as Dungeon Crawl Stone Soup, where you have to go into different branches in order to finish the game. However, this game is MUCH shorter (my wins have been around 30-40m I believe). There's many fun things about this game. If you'd like to see me play the game, please check out my let's play where my mission is to beat the game with all classes.\n\nhttps://www.youtube.com/watch?v=Kt9UoCQNDW0\n\nPro's:\n- Difficult, but winnable. This is not one of these roguelikes that takes 20 years to practise to finally beat (I beat it on my tenth try). However, it can still be very difficult, and mistakes will cost you your life.\n- Difficulty levels! I told you I beat the game? Well...that was on easy! Time to go up a level!\n- Cool music\n- Very fun theme. You're a vampire hunter trying to find a vampire...however, throughout the game you gradually turn into a vampire yourself. This means that suddenly all vampires are friendly to you, but other hunters are your enemies all of a sudden. This takes planning to make the most of it.\n- Vampire and human form play very differently\n- Weather system. The sun comes up and goes down. During day, it travels from East to South to West. If you destroy windows, beams will come through there and damage any vampires in it (including you if you are a vampire!).\n- Very streamlined. Although you can run into spells and choose what you want there, whenever you find a weapon the game will decide whether it's better or not (as its a flat bonus). If it's better, it equips it, if it's not better, you get some gold.\n- Lots of hidden depth and secrets!\n- Lots of classes to play with (including a werewolf!)\n- No diagonal movement. To me this is a pro as I often play at airports and I don't have a numpad (and I'm too lazy to learn the traditional 'roguelike' movement keys)\n\n\nCons:\n- Although the tutorial is great, it did leave some things unexplained\n\n\nNeutral:\n- Not sure about the longevity. It doesn't have the depth of ToME, ADOM and DCSS, but then again, it also doesn't need to have it. I'm pretty sure I can easily get 20h worth of fun from this, and if the dev keeps adding different branches etc, I might even get more.", "timestamp_created": 1499269255, "timestamp_updated": 1499269457, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.529933", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "33161474": {"recommendationid": "33161474", "author": {"steamid": "76561198077518431", "num_games_owned": 424, "num_reviews": 7, "playtime_forever": 232, "playtime_last_two_weeks": 0, "last_played": 1503192012}, "language": "english", "review": "This is a top-notch coffee-break (well, maybe lunch-break) roguelike with some really interesting mechanics.  Fans of proper or traditional roguelikes should not hesitate to pick it up at full price and in early access.  The roguelike itch is comprehensively scratched despite the light nature of the game.\n\nI find that the one of the most common causes of death in roguelikes is alcohol -- not in-game potions, but the scotch that I the player am drinking.  This is an awesome game to play if you're tipsy or intending to get there; runs are short enough that you won't mind very much if your character dies.\n\nA minor con for me is that there's no inventory management; you always use the most damage-causing weapon you find, and there are no weapons that are appropriate for Situation A but not Situation B.  But, realistically, if that were added, it would be a different game and not necessarily a better one.\n\nI feel that this would be scalable down to mobile and I rather hope they do an iOS version; I would enjoy playing this on my phone.  I think that, like 868-HACK, it's one of those roguelikes that works (or would work) well in either format.\n\nI waited for a sale to pick this up and I shouldn't have.", "timestamp_created": 1499044282, "timestamp_updated": 1499044282, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.511888", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32946589": {"recommendationid": "32946589", "author": {"steamid": "76561198078061215", "num_games_owned": 66, "num_reviews": 2, "playtime_forever": 37, "playtime_last_two_weeks": 0, "last_played": 1501637684}, "language": "english", "review": "Great casual roguelke with very interesting mechanics.", "timestamp_created": 1498669860, "timestamp_updated": 1498669860, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.468287", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32717664": {"recommendationid": "32717664", "author": {"steamid": "76561198053061177", "num_games_owned": 72, "num_reviews": 1, "playtime_forever": 7144, "playtime_last_two_weeks": 1, "last_played": 1513311310}, "language": "english", "review": "Great rougelike, cant wait to see the finished product.  If your a fan of true turn based roguelikes this is a must buy.", "timestamp_created": 1498294321, "timestamp_updated": 1498294321, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.452670", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "32032947": {"recommendationid": "32032947", "author": {"steamid": "76561198004368051", "num_games_owned": 256, "num_reviews": 32, "playtime_forever": 166, "playtime_last_two_weeks": 0, "last_played": 1501517066}, "language": "english", "review": "The gameplay in Golden Krone Hotel seems somewhat simple, with cardinal direction movement and a simple array of abilities to use. But it makes up for this simplicity with uniqueness of the games elements and a generally newbie friendly feeling to it. The key mechanic of the game is that you are a vampire that can briefly take on the guise of a human with all their attributes. You get different advantages and weaknesses depending on what form you are in.\n\nFor example, in Human form you are relatively weaker but you can make use of magic, can read books, and can use a shiny gun to dispatch of your enemies. Changing into a Vampire you are much stronger and can gain many hunter abilities (like the ability to see in lowlight) but you become stupid and can't use books or ready magic, or understand how to use a gun. You also are affected by sunlight - which is another unique element in the game.\n\nUnlike other games in the Rogue-like genre, you have an active lighting system which sees the sun gleaming through the windows; or perhaps the light of the moon. As this is a game where you have vampires and other unearthly beings that are affected by the sun, this can play a key role in how you play the game. Use the sun to burn enemy vampires - or if you are a vampire, you need to watch out for the burning light when it may shine on you!\n\nThere are also other enemies in the game to deal with too, and probably more content worthy of exploring as well. Some things that I noticed were multiple classes that you can start with and different zones to visit as you progress onward. The game is also quite cheap so it definitely isn't a bad pick up.", "timestamp_created": 1496022271, "timestamp_updated": 1496022271, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.540746", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "31849686": {"recommendationid": "31849686", "author": {"steamid": "76561198057473202", "num_games_owned": 560, "num_reviews": 104, "playtime_forever": 717, "playtime_last_two_weeks": 0, "last_played": 1511828992}, "language": "english", "review": "An oldschool roguelike experience streamlined to the point where you could probably play it on android, Don't be fooled by that description, Golden Krone Hotel is very strategic and very hard. What makes it more casual than other roguelikes is merely the fact that it is designed to be \"pick up and play\". The controls are streamlined. None of this fumbling around to remember which key you have to press to drink a potion or something. Everything is at your fingertips. This leaves you free to enjoy the strategy of the game without the massive learning curve often present in other roguelikes.\n\nI could end the review there and many roguelike fans would be satisfied, but that's not all there is to this title. We haven't even touched on what makes this game great. The number one thing is the vampirism mechanic. You can start as a human or as a vampire, but you are always BOTH. If you are a human, you have a vampire meter which slowly grows until you transform. If you're a vampire, you find potions that transform you back into a human. The humans have guns and magic while the vampires have increased combat skills\n\nAside from that, the coolest thing is the light mechanic. There is light, moonlight, and dark. Humans are not affected by light, but have trouble seeing in the dark. Vampires can see in the dark and use it for stealth, but they are dealt massive damage by sunlight. The light moves in accordance to what time it is in game. If you are a human, you can shoot out the windows or blast them with a magic spell to let light shine through. However, keep in mind that light only shines through the windows during the right time of day!\n\nIt's worth noting that you can also play as a werewolf. I'm not as familiar with this aspect of the game yet. All I really know is that you are somehow positively affected by moonlight.\n\nThose who like roguelikes to be hard as nails, but want a streamlined experience should love this game. It has really cool mechanics. I love it.", "timestamp_created": 1495236697, "timestamp_updated": 1495237355, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.549833", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "31637450": {"recommendationid": "31637450", "author": {"steamid": "76561198003167471", "num_games_owned": 439, "num_reviews": 6, "playtime_forever": 250, "playtime_last_two_weeks": 0, "last_played": 1496608416}, "language": "english", "review": "This is great, a proper roguelike with an interface that's easy to use and some clever mechanics that change the game depending on what you currently are whether it be human, vampire or something else. Enemies can be hostile or leave you in peace, light shafts that shine through windows and move as the day progresses can be a good way to get rid of vampires chasing you if you're human or something to run from if you're undead.\nYou will die a lot but every time I've seen the game over screen  it's been my own fault. The game encourages you to learn from your mistakes and progress will come if you pay attention. \nLastly, the music is great and really helps to give the game a wonderful gothic atmosphere. Definitely worth buying at the price.\n", "timestamp_created": 1494291770, "timestamp_updated": 1494291770, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "30181278": {"recommendationid": "30181278", "author": {"steamid": "76561198031953306", "num_games_owned": 299, "num_reviews": 5, "playtime_forever": 454, "playtime_last_two_weeks": 0, "last_played": 1503510108}, "language": "english", "review": "I don't really use Twitter, I only have two \"followers\" and from some reason GKH is one of them.  So, I bought this game just to support that 50% of my fan base.\n\nIt is surprisingly fun, even though I rage quit after 15 minutes every time.  Some day I'll make it past level 6.  I have much to learn to about this game.\n\nI usually turn the music off or way down in games because I find it distracting.  Here it's on, nice job.\n\n(One minor problem:  after my character dies, hitting the \"x\" key to \"Dismiss\" causes the game to auto-play, but then all keys are dead, I have to drop out to Windows task manager and kill the process.)\n", "timestamp_created": 1488066922, "timestamp_updated": 1488066922, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": "2", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29753358": {"recommendationid": "29753358", "author": {"steamid": "76561198035227021", "num_games_owned": 1183, "num_reviews": 3, "playtime_forever": 489, "playtime_last_two_weeks": 0, "last_played": 1488344977}, "language": "english", "review": "I almost never leave reviews but this is an addictive coffebreak style roguelike I have yet to beat.\nOriginally experienced it during 7drl and it deserves more attention.\n\nMy rate of a good game is if I get more than an hour of play per dollar and even at full price working on more with the Steam version.\n\nRecommended for roguelike fans.", "timestamp_created": 1486434054, "timestamp_updated": 1486434054, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.529268", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "29720917": {"recommendationid": "29720917", "author": {"steamid": "76561198039309841", "num_games_owned": 305, "num_reviews": 43, "playtime_forever": 199, "playtime_last_two_weeks": 1, "last_played": 1514259290}, "language": "english", "review": "GG.", "timestamp_created": 1486306930, "timestamp_updated": 1486306930, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.353240", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28775047": {"recommendationid": "28775047", "author": {"steamid": "76561198132788762", "num_games_owned": 289, "num_reviews": 28, "playtime_forever": 824, "playtime_last_two_weeks": 0, "last_played": 1506741406}, "language": "schinese", "review": "简单易上手，但是很难玩。操作一只手可以搞定，无对角线移动，有的话估计会更难...\n\n总体而言\n\n好味！", "timestamp_created": 1482978806, "timestamp_updated": 1482978806, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.524778", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28401723": {"recommendationid": "28401723", "author": {"steamid": "76561198257990215", "num_games_owned": 134, "num_reviews": 5, "playtime_forever": 3399, "playtime_last_two_weeks": 496, "last_played": 1514360697}, "language": "english", "review": "tl;dr: If you are a Rogueliker, buy it.  NOW.\n\n\"Tonight... Gehrman joins the hunt....\"\n\nAfter twenty hours' game-play and with the help of save scumming (less than ten deaths), I beat the game for the first time.  Hunters would agree that GKH is easy to learn and has some interesting mechanics.\n\nIdentity: Every hunter will fall into the embrace of vampires sooner or later.  Three forms (human, vampire and werewolf) brings radically different game style.  Besides, in order to survive or kill some monsters, you have to change back to human.\n\nTerrian:  Hotel floors will change by game turns.  They will be lighted by sun or moon, or be covered with blood.  Time is another crucial factor to survival.\n\nLight: Vamps and wolves have low-light vision, but human is bat-blind in full dakrness.  To light or kill the lantern, that is the question.\n\nLocalization?  There is a `locales` folder under the game folder.  So I was just wondering... :)\n", "timestamp_created": 1481880779, "timestamp_updated": 1481880779, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.543424", "comment_count": "5", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "28095265": {"recommendationid": "28095265", "author": {"steamid": "76561198118500923", "num_games_owned": 110, "num_reviews": 7, "playtime_forever": 85, "playtime_last_two_weeks": 0, "last_played": 1480583653}, "language": "english", "review": "As someone who's not had much experience with roguelikes, I can say that this game has been a good first step into the area. I've attempted other, less well put together roguelikes in the past, and this one has been by far my best experience. \n\nIt's rules are simple, yet sufficiently complex such that you can feel as though you've learned something with each play. The heavy impact of lighting and time on the scenarios you find yourself in inspire creative combat styles, (leading vampires into sunlight to avoid a fight, for instance). The length of each playthrough adds a gradually increasing tension throughout the game, as progress resets completely with each death.\n\nIt's certainly kept me interested for the duration of each playthrough, unlike other roguelikes I've tried in the past, and again I'd recommend it to those players new to roguelikes. All in all, a fun game, I'll definitely be putting more time in. \n\n(I'd like to add that occasionally I'll hold down a button on accident and end up making a shitload of moves that I didn't intend to, so that might be something to work on if that was not the desired effect).", "timestamp_created": 1480503475, "timestamp_updated": 1480503475, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "26466698": {"recommendationid": "26466698", "author": {"steamid": "76561197990877335", "num_games_owned": 279, "num_reviews": 4, "playtime_forever": 1735, "playtime_last_two_weeks": 0, "last_played": 1502078320}, "language": "english", "review": "Golden Krone Hotel is a great Roguelike with enough complexity to keep you interested, but with none of the inventory management and boring stuff that makes learning a new roguelike difficult. This game has had all the fat cut away and it's just meat. It's easy to learn but hard to master, and it's good fun.\n\nI've talked to the Dev online and updates are guaranteed. This is good because level design is a bit samey outside of a few 'special levels' with a cool theme (like crypt, greenhouse, etc). My play time is fluffed up a bit because I have the nasty habit of idling while I do something else, but I'm satisfied with it. I'm excited to see where the game goes in updates, but until then I haven't even gotten past around level 8 or so, so there's plenty of content to go through.\n\nI'd say pick it up, it's worth your money and it needs more publicity.", "timestamp_created": 1478476876, "timestamp_updated": 1478476876, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26413888": {"recommendationid": "26413888", "author": {"steamid": "76561197984291881", "num_games_owned": 1200, "num_reviews": 78, "playtime_forever": 157, "playtime_last_two_weeks": 0, "last_played": 1509493606}, "language": "english", "review": "Really unique and fun roguelike. Really easy to get right into for a roguelike and has some interesting mechanics and such a wonderful atmosphere.\nOff to a great start of development, very fun to play in it's current state. Can't wait to see where it's headed!\n\n+ Charming art that is consistent and adds to the setting.\n+ The gameplay is fast paced and fun (for a RL) and rounds are short.\n+ Unique vampirism mechanic that really enhances the gameplay.\n+ Streamlined gameplay to get you right into the action.\n+ Decent storyline with lore bits and dialogue\n+ Already a decent amount of spells and potions\n\n= Gameplay, while streamlined, is lacking in depth.\n= Pixel art is a love/hate thing.\n= Enemy types are lacking but the ones they have are cool.\n\n- There are a couple decorations already but they are severely overused. Beds... beds everywhere.\n\nOverall the game is very fun and perfect for when you don't feel like or have time to jump into a much more in-depth game. This however leaves it feeling a bit too light sometimes for my personal taste, but it's a great change of pace sometimes.\nIt's major issues are mainly with content and polish which can easily be fixed over the course of it's full development. It's my hope the developers will take this unique game they've made here and improve on it until it becomes a true gem of a roguelike.", "timestamp_created": 1478256051, "timestamp_updated": 1478256699, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.548585", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26408786": {"recommendationid": "26408786", "author": {"steamid": "76561198055642104", "num_games_owned": 1283, "num_reviews": 10, "playtime_forever": 480, "playtime_last_two_weeks": 0, "last_played": 1512921817}, "language": "english", "review": "Highly entertaining coffee break roguelike perfect for procrastinating for just a few minutes. The sunlight mechanics are fun to experiment with, and the identification system is just nerve racking enough to have me sit there and decide whether or not it's worth accidentally turning into a vampire if it's also possible to heal the poison about to kill me. The \"hunger\" clock puts me in a place to not waste turns, all while exploring as much of The Pharmacopeia as possible before dying. Highly recommended if you don't feel like learning a whole new system of a game but need a break from other heavy roguelikes.", "timestamp_created": 1478222007, "timestamp_updated": 1478222007, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.588097", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26293501": {"recommendationid": "26293501", "author": {"steamid": "76561198040884867", "num_games_owned": 1255, "num_reviews": 650, "playtime_forever": 178, "playtime_last_two_weeks": 0, "last_played": 1477735771}, "language": "english", "review": "[b]This review is for all my friends that love [i]true[/i] roguelikes! For how much that term is thrown around on Steam, there really aren't too many.[/b]\n\n[i]For the small asking price, you [i]need[/i] this little gem in your library. Here is why:[/i]\n\n1. The use of light (sunlight and artificial) in this game is fantastic. A breath of fresh air, really. This combined with how you swap between being human and vampire (and all consequences attached), just makes for something really awesome. I cannot stress this enough. Most roguelikes get by on simply following the formula, but when awesome new mechanics are thrown in - it really makes for something special.\n\n2. Inventory management has been paired down to just the essential, without feeling like some mobile casualty decision. If something is better, you auto-equip. If not, it is instantly converted to money. Boom, roasted.\n\n3. Controls have also been paired down, which is great. WASD to move, F to fire the gun, E to select, P for potions. Thats the vast majority of what you will be using. It's great. \n\n4. While it is early access, it very much feels finished - and is beatable at this point. I'd love to see more, but if the dev up and ran, I'd still be more than happy with what I have for five bucks.\n\nAlright, I'll leave it at that. All I can say is you really should give this a try. Playing as a human has a whole set of nuances and strategy that differ from when you are converted into a vampire. All of a sudden those precious light beams that are a weapon for humans, are now deadly if you are a vampire. The changing day cycle determines what side of the castle the light comes into the windows, really adding strategy. You shoot out windows and let the light flood in to insta-kill vampires. It's a crazy cool idea that really works.\n\n[b]A must-buy for fans of roguelikes.[/b]", "timestamp_created": 1477754074, "timestamp_updated": 1477754099, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.660350", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26291842": {"recommendationid": "26291842", "author": {"steamid": "76561197972901617", "num_games_owned": 301, "num_reviews": 4, "playtime_forever": 41, "playtime_last_two_weeks": 0, "last_played": 1484324021}, "language": "english", "review": "This is a very promising start to a game that has a very strong setting, a good amount of humour, and a solid character-transforming mechanic. The controls are easy to pick up, the mechanics are classic Roguelike in that they are simple but work together in complex ways, and the enemies I have encountered so far have a ton of character.\n\nIt's still early days, so there are some rough edges on the game as it stands, but I trust these will be polished during the early access period.\n\nIf you enjoy Roguelikes at all, and especially if you enjoy spooky horror themes, it is definately worth trying out.", "timestamp_created": 1477749551, "timestamp_updated": 1477749551, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.503786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26270231": {"recommendationid": "26270231", "author": {"steamid": "76561197997098258", "num_games_owned": 143, "num_reviews": 5, "playtime_forever": 367, "playtime_last_two_weeks": 0, "last_played": 1511053652}, "language": "english", "review": "Not played much, but really interesting and fun roguelike so far! The human-vampire shifting, the potion system and the light-darkness are nice features that can involve different playstyles and strategies. Really looking forward to see how this game develops, but for now looks amazing! Good job :)", "timestamp_created": 1477671493, "timestamp_updated": 1477671493, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.564319", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26253273": {"recommendationid": "26253273", "author": {"steamid": "76561198064268501", "num_games_owned": 903, "num_reviews": 91, "playtime_forever": 176, "playtime_last_two_weeks": 0, "last_played": 1506254516}, "language": "english", "review": "With the lack of real Roguelikes on Steam, it's a great surprise that we now have a new entry on the genre - and a really good one! Golden Krone Hotel takes what is best on this formula and adds nice features like the use of the everchanging sunlight as a weapon, if you're on the human form, and as something to be terrified about, if you're a vampire. That's right - the gameplay consists on playing with both forms and you need to make the best use of them if you want to survive. \n\nDon't be fooled by the Early Access label; this game is very polished, playable and beatable. At the moment there are six classes to choose from, 10 floors and five branches, 40 potions, 20 spells and dozens of monsters to haunt you. Despite being a traditional Roguelike, the UI is very easy to use and you can remap any key to your likings. The sound effects are great and the soundtrack may be one of the best, if not the best, I've heard on this kind of game. Also, there are some little details that makes the game even more fun, like the possibility to find and drink an Ale beer! What more could you ask for?\n\nAll in all, Golden Krone Hotel is an already great and promising Roguelike that will gain even more content in the future. For the asking price is a steal for what it offers - fun and inovative gameplay, challenging difficulty, funny moments, great amount of variety and replay value. You can't miss this one if you're a fan of Roguelikes!", "timestamp_created": 1477612666, "timestamp_updated": 1477612708, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.547280", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26252727": {"recommendationid": "26252727", "author": {"steamid": "76561198002560836", "num_games_owned": 477, "num_reviews": 34, "playtime_forever": 682, "playtime_last_two_weeks": 0, "last_played": 1509067132}, "language": "english", "review": "This game was a very plesant surprise and cant wait for more to be added to be expanded upon!", "timestamp_created": 1477609642, "timestamp_updated": 1477609642, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.459444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26245677": {"recommendationid": "26245677", "author": {"steamid": "76561197961972851", "num_games_owned": 1333, "num_reviews": 7, "playtime_forever": 128, "playtime_last_two_weeks": 0, "last_played": 1485989469}, "language": "english", "review": "It's a streamlined but still very traditional roguelike. I enjoy the dynamic lighting effects and luring vampires into the light rays. That and having to avoid the light yourself when you inevitably become a vampire.\n\nThe potion system takes the place of what would be normal inventory management. Having the choice of a few different potential effects makes selecting a potion not quite as risky as some classic roguelikes.\n\nI think the game is shaping up very nicely and would be worth the purchase if you'd like some unique coffee break roguelike action. It's still got some rough edges but seems to be shaping up to be a good game.", "timestamp_created": 1477576762, "timestamp_updated": 1477576762, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.503786", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26238827": {"recommendationid": "26238827", "author": {"steamid": "76561198010279414", "num_games_owned": 437, "num_reviews": 10, "playtime_forever": 832, "playtime_last_two_weeks": 0, "last_played": 1477095238}, "language": "english", "review": "I'm a fan of Golden Krone Hotel to the point that I've done two let's play series on it (One more succssful than the other.) I know that the developer doesn't take compliments very well, but I want people to know that GKH is a shorter roguelike that has interesting mechanics and a sometimes brutal learning curve. It's well worth $5 (I got mine as a review copy) and I wouldn't be surprised if the Dev ends up adding even more to the game.\n\nGood luck in the hotel!", "timestamp_created": 1477528542, "timestamp_updated": 1477528542, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.556813", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "26235247": {"recommendationid": "26235247", "author": {"steamid": "76561198042323131", "num_games_owned": 299, "num_reviews": 2, "playtime_forever": 924, "playtime_last_two_weeks": 0, "last_played": 1509725748}, "language": "german", "review": "Golden Krone Hotel ist ein Roguelike, in dem man versucht den Vampir-Prinz im obersten Stock des Hotels zu besiegen. Auf dem Weg dorthin muss man einige Hindernisse und Gegner beseitigen. Soweit ist das ein klassischer Roguelike-Rahmen.\nDas Spannende ist, dass man hierbei zwischen Mensch- und Vampir-Form wechselt. Dies bringt eine interessante Dynamik mit sich, da sich der Spielstil von beiden Formen unterscheidet (Menschen nutzen Magie und regenerieren automatisch, wenn Sie gesättigt sind; Vampire sind sehr stark, benötigen aber große Mengen an Blut). Man begegnet Vampiren und Menschen und wird, je nachdem in welcher Form man gerade ist, von den einen angegriffen und von den anderen ignoriert.\n\nEs ist ein kleines, feines Indie-Spiel mit einer ungewöhnlichen Thematik. Für Roguelike-Liebhaber, welche eine neue Herausforderung für zwischendurch suchen, kann ich Golden Krone Hotel sehr empfehlen.\n", "timestamp_created": 1477509104, "timestamp_updated": 1477509104, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.526822", "comment_count": "1", "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "26234499": {"recommendationid": "26234499", "author": {"steamid": "76561197963191458", "num_games_owned": 97, "num_reviews": 5, "playtime_forever": 3380, "playtime_last_two_weeks": 0, "last_played": 1509642260}, "language": "polish", "review": "Very cool addition to a rougelike genere. GKH is a fun play when u want to cool down between huge Dota skirmishes or Dark Souls pvp battles.\nHuge amount of potions and spells let's u discover different nuances and tactics game has to offer. You can approch the game differently each time depending on what you'll find and random generated levels allows for a good replayability.\nKilling enemies with light and becoming a vampire to suck'em dry is an unique feature not often present in these type of games.\nOverall 8/10 solid,unique,balanced,very challenging and hard to master game. Me Gusta!", "timestamp_created": 1477506285, "timestamp_updated": 1477506285, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.501067", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": true}, "26228770": {"recommendationid": "26228770", "author": {"steamid": "76561197991250128", "num_games_owned": 491, "num_reviews": 10, "playtime_forever": 906, "playtime_last_two_weeks": 0, "last_played": 1509010955}, "language": "english", "review": "Full disclosure, I was given a key by the developer for beta testing purposes. \n\nGolden Krone Hotel is a pure roguelike game, but cuts the fat out in many areas. Its systems are simpler than say, Dungeon Crawl Stone Soup (which it shares inspiration from) but makes up for it with a tight balance, and really neat additions. I've been playing this game since its inception as a 7 Day Roguelike during the jam. The Early Access release goes above and beyond. \n\nYou make your way upwards, killing baddies, casting spells, and firing your firearm, while doing your best to stay alive. One of the great things about this game is its almost puzzle-like enemies. Bats have a large movement speed, and often hit and run. Spiders can chain stun you, but do low damage by themselves. Golems are more susceptible to blast damage. Etc. Over the course of a few runs, you learn each enemy, and how they act, what they're weak to, and how to best overcome them while in packs with other baddies. Light is very important in this game. Vampires will take damage in sunlight, (more on vampires later) and being in the dark has its pros and cons. While you gain a stealth bonus, enemies that can see in the dark will not be fooled by this trick. Lighting torches is a good way to keep the field visible.\n\nGolden Krone Hotel's main focus is its different forms. Over time, you start to turn into a Vampire. This means that sunlight will also affect you, you can see in the dark, vampires will be passive while humans hostile, and you cannot cast spells. These gameplay changes make playing as a vampire a very viable option for many circumstances. I find using that form during travel very useful, as you don't lose hunger, only health. You regain that by feasting on nearby humans or taking one of the game's numerous potions. \n\nSpeaking of potions, another streamlined area is identification of items. Instead of a miriad of potential options, the game gives you three possibilities for each. Discerning what is what is less risky, so panic-quaffing happens more often. Items in general are much more easily managed. Picking up a new piece of equipment will either cause you to exchange it for gold if it is worse, or equipping it in the other circumstance.\n\nI feel like I could talk about the depth of the game's mechanics for ages. As someone who has played and enjoyed the game for a very long time, I would certainly recommend Golden Krone Hotel to anyone.", "timestamp_created": 1477480236, "timestamp_updated": 1477480309, "voted_up": true, "votes_up": 6, "votes_funny": 1, "weighted_vote_score": "0.553386", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": true}, "26226804": {"recommendationid": "26226804", "author": {"steamid": "76561198026488684", "num_games_owned": 1145, "num_reviews": 51, "playtime_forever": 92, "playtime_last_two_weeks": 0, "last_played": 1478227240}, "language": "english", "review": "Great Game, a must have for traditional roguelike fans.  Very interesting vampirism mechanics.  The game has a modern UI and nicely done controlls.  It is very streamlined, more action less time wasting.\n\nI thougt I'd add, it uses 4 way directions, so laptop or numpad-less gamers are in luck!", "timestamp_created": 1477465642, "timestamp_updated": 1477465642, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.567193", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "26226459": {"recommendationid": "26226459", "author": {"steamid": "76561198124092294", "num_games_owned": 349, "num_reviews": 21, "playtime_forever": 83, "playtime_last_two_weeks": 0, "last_played": 1477625892}, "language": "english", "review": "Good entry level roguelike. Simple mechanics with the twist of changing between human and vampire. Since equipment is automated, potions are your entire inventory. I think that the balance between hunger and spellcasting is interesting.", "timestamp_created": 1477462888, "timestamp_updated": 1477462888, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.526178", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
