{"query_summary": {"num_reviews": 3, "review_score": 7, "review_score_desc": "Positive", "total_positive": 29, "total_negative": 1, "total_reviews": 30}, "reviews": {"38335873": {"recommendationid": "38335873", "author": {"steamid": "76561198083314516", "num_games_owned": 4827, "num_reviews": 6, "playtime_forever": 271, "playtime_last_two_weeks": 271, "last_played": 1513382947}, "language": "english", "review": "TL;DR: Finished the game, and it's definately on the short side (4.5 hours flat), but it's very good for everything there thus far. More content to be added, but even without that content it's still sitting at a \"tentative buy\" for the quality an ingenuity of tactical turn based strategy it already includes. The daily challenges add some additional time that I haven't explored.\n\nCurrently at Alpha5 update, and to be honest I put this far more in the XCOM category than the roguelike category. Personally, I think it's a bit of a stretch to call it a \"rogue-lite\", but I tend to be a stickler for what goes in either of the latter categories (e.g. much of steam's \"rogue-lite\" tag is totally miscategorized. Permadeath + procgen != roguelite and certainly not roguelike).\n\nThat being said, don't buy the game as a \"roguelike\" game, buy it for what it is, which seems to be something that may well be up your alley, it has the procedural generation and permadeath features from roguelikes, \"level up\" type addons in the form of equips that XCOM has, with the killer feature of the ultimate form of turn based tactics (as in, you can manipulate the turns themselves, rewinding them for just you or for just everyone else, or both), the facets of which come off as  surprisingly simple-in-principle yet complex-in-combination actions.\n\nIs there more to be fleshed out? Certainly, it's in alpha status, so I'm really glad what's missing is \"fun to develop\" content rather than incredibly basic systems (like a save/load system or the mechanism/capacity for a tutorial, etc.). A short list of items that would be nice off the top of my head, to give you an idea of the types of things I'm talking about:\n\n* As of the current version I'd really like to see better use of the hacking mechanic to do something other than simple \"get through quietly\" or \"turn some of those useless drones from alert bots into slow suicide loving bullet absorbers\". Right now it's nice, but doesn't do a whole lot other than the same things more \"quietly\". There's also no failure chance, just a resource cost.\n* Shooting is 100% accurate. Either you hit, or it won't let you try.\n* While procedural generation is present, it leaves the levels _exactly_ the same every time and allows unlimited replays (unless you die), to earn more points. Even where it's something like \"search all the ashtrays\", only the same ashtrays ever contain packages and they are always in the same places.\n* Once you get a certain ability in game, you can't actually die until you run out of both health and time resources (you could kill an entire village by then). That ability needs a steadily increasing cost (for that matter, all of them do) per combat, to make it more interesting when you might want to use some of them.\n* AI should be willing to wait around for reinforcements. They have \"time\" on thier side, make me sweat while I waste it hanging around the corner in a one entrance room, rather than charge in single file while I shoot them in the brain before they can react (and pile up in front of the door).\n* When \"reinforcements arrive\" they really shouldn't all be just waiting by the car, which they seem to be. For that matter, way more roaming guards, basically everywhere, and it'd be nice to have a line of sight indicator vs guess or assume perfect vision (like I apparently have). Planning my route should not simply be a random chance experience.\n* Doors should be more easily visibile once discovered, I've flipped my camera around repeatedly, but sometimes I just cannot see that door until I get close enough to have it in a single walk's distance so I see it can be walked on vs can't.\n* More detrimental \"bash the door in\" mechanic. Right now it's quick, a bit loud (quick gunfight takes care of that) and that's it. Very little to no danger or drawback involved, since the fight always gives at least the same amount of time resources back that were spent in the fight itself.\n\nCertainly not a full list, there's more throughout the forums, but these are just my 2c as an example of the types of things I see could be improved. As you can see, they are in the direction of making the game more of what it is, rather than more towards a roguelike or changing a premise or similar. In my experience, these are the types of things developers enjoy adding, so I'm personally really looking forward to the direction the game is going in.\n\n***\n\nOriginally posted this as a comment on the forums, related to an ask regarding if this is more like a roguelike or like XCOM, but thought it made a decent enough review by itself.\n\nIn summary, it's quite a good game from everything that I've played thus far. I could see it potentially getting pretty easy somewhat quickly with the current amount of content but I can definately see it staying interesting if balance holds throughout the progression. In it's current form, I call it a \"tentative buy\" if you like tactical turn based strategy, and enjoy variations on the core mechanics of that genre while staying true to it's heart, but the \"tentative\" adjustment is purely for current content length of 4.5 hours.\n\nI played pretty directly through in 4.5 hours, didn't stop to replay except the first few levels, but didn't really feel the need to keep replaying other than that. I'd actually have fun playing the campaign a few times through even if this were all the content there was, primarily due to the procedurally generated levels. The daily challenges recently added should fill out time to play more for certain, though I tend not to really enjoy the \"daily\" types unless they implement a \"go back\" mechanism of some kind so I can replay the last X number at a shot (too many games to constantly log into one every day just for a few minutes of play). Because of that I haven't even checked daily challenge out, but might do so before my next campaign run.\n\nWith additional content that I'm quite certain will continue being added (due in no small part to the content being added itself), this would get upgraded to a \"definate buy\", though I rarely make reviews anymore off of \"what might it become on exiting EA\", and instead either hold off reviewing or leave a review on current content alone (as done here).", "timestamp_created": 1513377424, "timestamp_updated": 1513383352, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38371280": {"recommendationid": "38371280", "author": {"steamid": "76561198013204609", "num_games_owned": 1968, "num_reviews": 11, "playtime_forever": 22, "playtime_last_two_weeks": 0, "last_played": 1510480064}, "language": "english", "review": "Fascinating mix of roguelike strategy, RPG, with a dash of rhythm and time manipulation thrown in. The setting is unqiue (cold-war-era berlin in 2089???) and the soundtrack is great and thumping and underscores the action. If the devs continue to improve the game it can be a very unique gem.", "timestamp_created": 1513501261, "timestamp_updated": 1513501261, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502595", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38176219": {"recommendationid": "38176219", "author": {"steamid": "76561198013538900", "num_games_owned": 164, "num_reviews": 1, "playtime_forever": 878, "playtime_last_two_weeks": 0, "last_played": 1512777902}, "language": "english", "review": "A brilliantly intuitive time travel mechanic combined with solid controls and UI all permeated with excellent sound design and art direction makes this an extraordinary example of an early-access game. Much of it feels polished and ready, and the team are active in development and community engagement. If you like sci-fi time travelling secret agent conspiracy theories set in the retrofuture of East Berlin, this is the game for you.", "timestamp_created": 1512816015, "timestamp_updated": 1512816015, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36333534": {"recommendationid": "36333534", "author": {"steamid": "76561198004393508", "num_games_owned": 1270, "num_reviews": 30, "playtime_forever": 136, "playtime_last_two_weeks": 0, "last_played": 1510439351}, "language": "english", "review": "Mix Invisible Inc with Crypt of the Necrodancer, toss in some time-control powers, and you get this brilliant gem of a game.\n\nYou play as an agent hired by time-travelers to perform hit-and-run missions in nightclubs around futuristic Berlin, with the aim to steal stuff, kill people, etc. Every mission is a little different, every building a little different - they're all procedurally generated, with the aim of giving you new puzzle boxes every time you play.\n\nSee, everything you do takes time: every move, every gunshot, everything. You have to get in, accomplish your objective, and get out before you run out of time. Which initially seems like a lot, but when you accidentally walk into a bullet and unwind time so you can skip that damage, you burn through it fast. Because it's not just your agent's time your using, it's time as a resource, as a healthbar. I love how it works in motion, where it pushes you to keep moving - but doesn't make it so tight that you get frantic and stop thinking. Like Crypt of the Necrodancer's demand that you stay to the beat or lose the rhythm.\n\nCombat! Combat is turn-based, and if you can't explain your presence to the guards hanging out in these clubs, they'll break out their shotguns and smgs. You can do a light attack that doesn't take much time, or an aimed shot that does. You can dash to another square to evade a bullet, you can worry about cover, you can reload. It's pleasing - just enough XCOM to make it feel crunchy, just enough slick to keep you moving. And oh! When you win, you're asked if you want to drop the combat - finalize it, make it permanent. If you do, you get bonuses...and the game drops down into a super-close replay mode where it shows off your shots and dodges, where you get to watch the nightclub come gloriously alive as you're no longer floating above it thinking in terms of tactics, but just watching your burly agent bust down doors and flip his little cut-out (think paper mario!) avatar around as he meets guards and pushes past club-goers. It's a fantastic little touch that makes you really feel satisfied after combat, and gives you a breather before you get on with the mission.\n\nGosh, it's slick. But I digress: talking! Talking is simple and hilarious. Guards refuse to let you inside the club, guards demand to know who you are, and you can - as a burly aging man of an agent with a cybernetic arm - be gruff with them, tell them to fuck themselves, or try to flirt with them. And sometimes the flirting works! I haven't spent enough time with the chatting to tell you how deep the system goes, and there are emotions at play as well as picking logical answers, but it works, it adds a pleasantly human layer to these paper dolls. And if you get a guard mad, you get to swap to combat, which is fun.\n\nSo - let's see. There's a campaign structure, with different missions to do around Berlin. There's a shop, where you can trade currency (gained by completing missions with extra time) for upgrades, new weapons, new powers. There are complications like drones and security cameras.\n\nThere is, alas, the fact that this game is still in early access. The devs aim to have it done by early next year, which is exciting: what's here in the game is solid already, and any expansion to it would be wonderful. For now there's a handy little feedback button in-game that you can use at any time to send the devs a complaint or comment - the most seamless way I've ever seen to tell a dev what you think.\n\nLet me wrap this up: I think this game is brilliant. The atmospheric is astounding, the political overtones add that edge to this cyberpunk title, and the gameplay hits just right. I really, really like this game and want it to do well!", "timestamp_created": 1510018100, "timestamp_updated": 1510018100, "voted_up": true, "votes_up": 27, "votes_funny": 1, "weighted_vote_score": "0.782599", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36243208": {"recommendationid": "36243208", "author": {"steamid": "76561198007045849", "num_games_owned": 485, "num_reviews": 19, "playtime_forever": 743, "playtime_last_two_weeks": 0, "last_played": 1509922654}, "language": "russian", "review": "В 2089-м году, в Восточном Берлине встретились Hotline Miami и Braid, они сразу полюбили друг друга, а плодом их любви стал… Кай — лысый и бородатый мужик, с кибер-протезом руки. Подобно родителям он любил путешествия во времени и врываться в ночной клуб, убивая всех на своем пути под задорную музыку. Или это был какой-то другой Кай? Точно помню, что Кай предпочитал силу слова силе оружия, запугивал, очаровывал и убеждал охрану, всегда уходил по-английски. Или это был какой-то другой Кай? Какой-то из их великого множества, запертых во временной петле, повторяющих одни и те же действия в различной последовательности и в различных вариациях реальности, для которой Холодная война так никогда и не закончилась.\n\nАбзац выше – это фундамент All Walls Must Fall, roguelite-а основанного на путешествиях во времени как сюжетно, так и геймплейно. Разработчикам удалось уместить в одной игре: пошаговые бои, диалоговую систему, прокачку и классическую уже историю про шпионов в разделенном стеной Берлине. Недостаток всего один, игра в раннем доступе и еще не доделана, контента мало, а кампания проходится за два-три часа. Скорее всего, это будет исправлено к релизу, но даже то, что уже есть сейчас достойно покупки.", "timestamp_created": 1509718982, "timestamp_updated": 1509718982, "voted_up": true, "votes_up": 5, "votes_funny": 1, "weighted_vote_score": "0.518727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36144425": {"recommendationid": "36144425", "author": {"steamid": "76561198238946714", "num_games_owned": 2934, "num_reviews": 85, "playtime_forever": 40, "playtime_last_two_weeks": 0, "last_played": 1509136120}, "language": "koreana", "review": "아직 얼리엑세스이고 정식판이 나오려면 많은 시간이 걸릴것이라 생각합니다만.\n 개인적인 짧은 소감으론 괜찮네요. \n단지 세심한 메뉴툴바의 효과음이라던가 총의 소리등이 부족하게 느껴졌고 먼가 목표가 정확히 자동 지정되지 않고 탈출하는 적을 찾으려고 맵을 뒤져야한다는게 불편했습니다..  \n먼가 세심한게 빠진것같은데 그런건 정식이 되면 다 수정되었겠지요. \n단지 피드백을 제작자들에게 남기고 싶으나 영어를 잘 못하는 관계로 패스 합니다.\n 우선은 긍정적이란 평가를 남기고 정식이 되기를 기다리겠습니다.", "timestamp_created": 1509379731, "timestamp_updated": 1509379731, "voted_up": true, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.509804", "comment_count": "1", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36111538": {"recommendationid": "36111538", "author": {"steamid": "76561198038364525", "num_games_owned": 526, "num_reviews": 79, "playtime_forever": 965, "playtime_last_two_weeks": 0, "last_played": 1511655419}, "language": "french", "review": "Il me démange de vous parlez de cette tuerie qu'est ce jeu.Dans un genre déjà bien fourni à savoir le RPG/TPT  All Walls Must Fall parvient l'incroyable en relevant le défi de l'innovation avec un système de combat vraiment,je trouve,bien pensé.La direction artistique soutenue par la bande son,pour peux qu'on aime,est faite pour vous séduire et vous entrainer à continuer encore et encore...Et sur moi on peut dire que l'opération séduction est une réussite totale.Du rythme dans un TPT déjà fallait osé relever ce défi,mais la réussite est au rendez-vous et c'est tant mieux pour nous joueurs qui détenons là un bijou vidéo-ludique comme on en à que trop rarement.Déjà avec cette alpha on voit le potentiel du jeu c'est Géant.\nL'univers du jeu est bien foutu,on évolue dans le monde de la nuit et des trafics en tout genre,le scénario sur l'espace temps est au centre de l'intrigue et de vos compétences.Pour mes espoir pour le jeu c'est j'espère que le boulot continuera sur cette voie  et que le jeu sera traduit en français pour le scénario surtout,pour le jeu il tourne déjà aussi bien sur linux que windows.\nPS:Attention à utiliser avec précaution peut devenir très vite addictif et peut provoquer des troubles de la personnalités sur les personnes sensibles....", "timestamp_created": 1509284293, "timestamp_updated": 1509284293, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.507168", "comment_count": "3", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36477562": {"recommendationid": "36477562", "author": {"steamid": "76561198017214910", "num_games_owned": 496, "num_reviews": 12, "playtime_forever": 74, "playtime_last_two_weeks": 0, "last_played": 1510514487}, "language": "english", "review": "Deus XCom Dancer Inc.\n\nTakes aspects from various games and mashes them together inside a cyberpunk German gay nightclub.\n\nThis game has STYLE!", "timestamp_created": 1510514896, "timestamp_updated": 1510514896, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.502262", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36389306": {"recommendationid": "36389306", "author": {"steamid": "76561198048070486", "num_games_owned": 688, "num_reviews": 14, "playtime_forever": 126, "playtime_last_two_weeks": 0, "last_played": 1510193873}, "language": "english", "review": "I've only played one campaign of this so far, and did so in one sitting. I just write to say: If you're looking for a finished game, look elsewhere. I'm by no means saying this is a bad game. I greatly enjoyed the combat mechanics, the dialogue is fun and simple (as I've seen said elsewhere), and the music, while I wish there was more, is great for the situations it's played over. This is a barebones shell of what this game has the potential to be, and I just hope they take this a LONG way from where it is now. Love it how it stands, but I will not be playing it until the next update, and will update this review with any changes when that occurs.", "timestamp_created": 1510202885, "timestamp_updated": 1510202885, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503610", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36506400": {"recommendationid": "36506400", "author": {"steamid": "76561198313138945", "num_games_owned": 24, "num_reviews": 5, "playtime_forever": 25, "playtime_last_two_weeks": 0, "last_played": 1510452908}, "language": "english", "review": "i like the whole idea of the game - phantasy cold war, cyberpunk cultures, time re-wind and x-com like battel mode. despite this game is still in its early phase, i think this is where you might want to invest, if you were to supprt a group of very creative developers.", "timestamp_created": 1510642068, "timestamp_updated": 1510642068, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36518183": {"recommendationid": "36518183", "author": {"steamid": "76561197988762753", "num_games_owned": 946, "num_reviews": 3, "playtime_forever": 23, "playtime_last_two_weeks": 0, "last_played": 1510689318}, "language": "english", "review": "Just started playing this. It's really pretty and fun. I get a bit lost trying to find my way around but that's likely just me. I am terrible at strategy games but this has a neat time mechanic. The devs are also awesome guys and promised me no paid microtransactions of any kind. Let's support these guys.", "timestamp_created": 1510689651, "timestamp_updated": 1510689651, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36455905": {"recommendationid": "36455905", "author": {"steamid": "76561198055751007", "num_games_owned": 167, "num_reviews": 25, "playtime_forever": 180, "playtime_last_two_weeks": 0, "last_played": 1510442268}, "language": "english", "review": "Satisfying game loop with innovative and well implemented mechanics. I dig the setting too - East Berlin, night clubs, dance music. Not very long currently (got 3 hours out of the campaign with Alpha 4) - looking forward to more content (and more challenging missions) in the future. I'd say worth it already for anyone looking for something with cool new ideas.\n\nUpdate - on the comparison to Invisible Inc: I tried that game before and after AWMF; personally I had much more fun with this game (AWMF). Invisible Inc was too overwhelmingly complex for me. I also prefer games where you only control a single character (like AWMF). Mistakes in Invisible Inc were costly and punished promptly, while in AWMF the rewind mechanics are more fluid and fun - they're part of the core gameplay, not just an \"easy mode\" like in Invisible Inc.", "timestamp_created": 1510442928, "timestamp_updated": 1510513850, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36580494": {"recommendationid": "36580494", "author": {"steamid": "76561198017497072", "num_games_owned": 1729, "num_reviews": 81, "playtime_forever": 153, "playtime_last_two_weeks": 0, "last_played": 1511030597}, "language": "english", "review": "WHAT? PERMADEATH CAMPAIGN?! GONNA UNINSTALL IT.\n\nIF THATS REALISM THEN THE COLD WAR DID END =)", "timestamp_created": 1510951925, "timestamp_updated": 1510951925, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.456387", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
