{"query_summary": {"num_reviews": 3, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 404, "total_negative": 25, "total_reviews": 429}, "reviews": {"38290890": {"recommendationid": "38290890", "author": {"steamid": "76561198042019309", "num_games_owned": 261, "num_reviews": 8, "playtime_forever": 971, "playtime_last_two_weeks": 851, "last_played": 1513780738}, "language": "english", "review": "If you've ever wondered what being a marine from starcraft 1 was like I guess this is the closest you're going to get.", "timestamp_created": 1513209884, "timestamp_updated": 1513209884, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.581749", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38201875": {"recommendationid": "38201875", "author": {"steamid": "76561197967081751", "num_games_owned": 1092, "num_reviews": 18, "playtime_forever": 223, "playtime_last_two_weeks": 0, "last_played": 1512970086}, "language": "english", "review": "TL;DR:  Strongly recommended! An intense and scary single/multiplayer horror/sci-fi FPS, with procedural levels. What people thought the Space Hulk/Colonial Marines games were going to be. Almost impossible singleplayer, but good with a group. Make sure you have at least one friend before buying.\n\n\nTHE LONG VERSION\n\nA deceptively slow-paced and extremely tense game that places you as a space marine in huge, powered armor and puts you on randomly generated ships to download cores for... some reason, or rescue very fragile civilians.\n\nThat may sound standard or identical to other Space Hulk-esque games, but I assure you the execution is unmatched by anything else.\n\nYou see, your suit has limited ammo, vision, and power, but you don't notice that before the game starts cranking the stress-o-meter to 15 out of 10. When your enemies actually bother to show up, it's horribly disorienting (in a good, atmospheric way), and is pretty much guaranteed to make you dookie a shooter straight out through your pants and chair. \n\nNote that \"disorienting\" does not mean \"incomprehensible\". You have a motion sensor, a flashlight, and even a rangefinder counting down the meters before your face eaten off - You'll always know what killed you, it's just a lot faster than you might be used to.\n\nAlso worth noting is that you are very vulnerable in this game. It is not a power fantasy, and a great example of how having weapons and the ability to defend yourself does not necessarily remove the horror element from a horror game. You don't move that fast and have limited room to maneuver. Friendly fire is always on and it doesn't take many rounds to kill a teammate. When guns fire, their muzzle flash can be blinding and disorienting, turning dark hallways into panicked strobe-lit dancefloors of death. In case you weren't stressed out enough, your character's heart rate increases as the enemies close in, represented by the screen pulsating in time with the heart rate. This game is not for epileptics. At all. The menu says it best: \"This game will melt your face off\".\n\nOn top of all that, your enemies - the titular \"Space beasts\" - are very fast and instantly lethal in melee range. They're as deadly as their name is stupid: instant death in melee, able to smash doors, they come out of the goddamned walls, they turn off the power as much as possible, and they do it all at blinding speed. Even with turrets, a full load of ammo, and experienced team members, you are in a race against time to do your job before they overwhelm and kill you.\n\nOn top of THAT, there's an equally stupidly named enemy type called the \"Astro-Creep\". they both scare the shit out of you by face hugging your helmet and obscuring your vision, and also help result in about 3000% more friendly fire incidents by setting off automated turrets, smartguns, and motion sensors that don't realize they're actually very small wall-crawlers. \n\nAll you need to do to get out of this hellhole is accomplish your objectives as quickly as possible and get back to the shuttle. Seemingly impossible at first, but if you use turrets, make good use of locked doors and laser walls, and get a good teammate or two, you have a chance. You also get random upgrades like aim assist or infravision when you accomplish objectives like downloading cores. The upgrades really stack up over time, so doing the job quickly is very helpful. Sentry turrets can be activated to help you out. Naturally, they will shoot and kill you if you stupidly block their line of fire between you and an alien. There are also ammo and repair bays scattered randomly on the map. Tough, but fair.\n\nNote that while you can play by yourself, you will almost certainly fail all but the smallest ships. You really need at least one other person to play with you to have a realistic chance to succeed. Strongly recommended, nevertheless.", "timestamp_created": 1512888206, "timestamp_updated": 1512888206, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.539474", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "37996360": {"recommendationid": "37996360", "author": {"steamid": "76561198014350816", "num_games_owned": 360, "num_reviews": 14, "playtime_forever": 24, "playtime_last_two_weeks": 0, "last_played": 1512200648}, "language": "english", "review": "I know its early access, i get that, the problem is its not even good for early access. Graphics are terrible, gameplay is so bare bones i could play it on my phone. Muzzle flash is blinding at least they warn you of it. There is no tutorial of any kind. Nothing to help you navigate menus or even teach you how to play or what to look out for. At least Dark Souls gave you control information! This game doesn't! Do not waste your money on a 15.00 game that should barely be worth .50 cents!", "timestamp_created": 1512201014, "timestamp_updated": 1512201014, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.356102", "comment_count": "4", "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "36318838": {"recommendationid": "36318838", "author": {"steamid": "76561198170979685", "num_games_owned": 361, "num_reviews": 2, "playtime_forever": 1152, "playtime_last_two_weeks": 0, "last_played": 1509997506}, "language": "russian", "review": "Хотите поиграть в хорошую игру по чужому - alien isolation к вашим услугам. Если же вам больше нравятся чужие  -  однозначно sbtf. В сторону colonial marines даже не смотрите. Она не раскрывает тему колониальной морской пехоты от слова совсем. Другое дело sbtf, правда это не совсем чистые чужие, с легкой примесью space hulk, но по духу все равно ближе к чужим. Толпы противников, медленно, но верно заканчивающиеся патроны, страх быть сожраным заживо на пустом и темном корабле где-то далеко в космосе, где ваш предсмертный крик никто не услышит (особенно если играете в одиночку). Все это sbtf вам обеспечит с достатком. Что касаемо генерации уровней, она очень даже хороша, правда довольно часто можно встретить очень похожие, а то и абсолютно одинаковые фрагменты карты. Так же игра может подкинуть вам довольно неожиданные сюрпризы, в роде терминала (которые надо взламывать, и при том обязательно все) между двух проломов, из которых спавнятся твари. Отдеьная история - это биомасса, или же заражение, как вам угодно. Эта дрянь не причинит никакого вреда, но она запросто скроет от ваших глаз то, что может вам очень даже пригодиться, например панель управления дверью, а то и цеый терминал или раздатчик патронов. К слову, поскольку игра является по сути своей рогаликом, в ней присутствует перманентная смерть, при которой игрок теряет весь прогресс. И вот представьте себе ситуацию: вы уже не плохо так прокачаны, отступаете по коридору, попутно отстреливаясь, и внезапно натыкаетесь спиной на дверь, а стены вокруг вас покрыты заражением, и что бы вы подумали? Поварачиваетесь к тому месту, где находится панель управления, а там сплошная биомасса, и вы начинаете хаотично тыкать в нее, надеясь открыть дверь (а по скольку персонажам здесь присущ страх, то экран ваш в этот момент дергается как эпилептик в припадке), но не успеваете, со спины подкрадывается ксенос и ваншотит вас (смерть здесь в любом случае с одного удара). Качайтесь заново. И такое вполне может случиться даже при ручной генерации уровня, а если выставлена полностью случайная, то каждая секунда может превратиться в ад. В общем, понесло меня, пора бы и закругляться. Игра хороша, хоть и находится в раннем доступе. Но в том, что она из него выберется, можно быть полностью уверенным. Автор хоть и редко, но выпускает обновления, которые очень сильно улучшают игру. Не побоюсь этих слов - лучший симулятор колониального морпеха. Всем однозначно рекомендую, а фанатам чужих так вообще маст хэв. С нетерпением жду релиза.", "timestamp_created": 1509964502, "timestamp_updated": 1509964502, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.557459", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "38602047": {"recommendationid": "38602047", "author": {"steamid": "76561198024660768", "num_games_owned": 478, "num_reviews": 2, "playtime_forever": 16, "playtime_last_two_weeks": 16, "last_played": 1514077896}, "language": "english", "review": "Exited pod, found copy machine, felt everything would turn out OK.  Found Alien horrors.  Everything did not turn out ok.", "timestamp_created": 1514078036, "timestamp_updated": 1514078069, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523810", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}, "35365332": {"recommendationid": "35365332", "author": {"steamid": "76561197977357413", "num_games_owned": 489, "num_reviews": 7, "playtime_forever": 1014, "playtime_last_two_weeks": 0, "last_played": 1508484710}, "language": "english", "review": "This game does co-op/horror/roguelike right. I sincerally hope the developer continues to update this hidden gem.\n\nP.S. The online play is fairly stable, but starting games can get a little wonky (usually taking a few seconds to remake the lobby fixes it)", "timestamp_created": 1506838033, "timestamp_updated": 1506838033, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.000000", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": true}}}
